[{"text_input":"@whale589 @hudspeth776761 @4DadsFtso @BifrostWallet Great initiative. Also big kudos to @4DadsFtso patiently to walk through the explorer and each component!! This thread can be used as a reference too:","output":"Kudos to @4DadsFtso for the detailed walkthrough! 👏"},{"text_input":"Thank you @googlecloud, @DoraHacks, @CalBlockchain, and @wlooblockchain, for joining us at @UCBerkeley! It's going to be an epic hack this weekend 🔥","output":"Epic hackathon at UC Berkeley this weekend! 🚀"},{"text_input":"400+ young bright devs are about to use Flare AI Kits. Probably nothing","output":"\"400+ devs diving into Flare AI Kits! 🚀\""},{"text_input":"10 Powerful Dev Tools on @FlareNetworks 🔖 Bridging 🌉 1. @PolyhedraZK’s zkBridge: A trustless, efficient cross-chain protocol enabling secure asset transfers using zero-knowledge proofs. 2. @LayerZero_Core: An omnichain protocol for seamless communication and interoperability…","output":"FlareNetworks: Top 10 Dev Tools for Cross-Chain! 🚀"},{"text_input":"𝗜𝗻𝘁𝗿𝗼𝗱𝘂𝗰𝗶𝗻𝗴 𝗮 𝗨.𝗦. 𝗻𝗮𝘁𝗶𝗼𝗻𝗮𝗹 𝗰𝗿𝘆𝗽𝘁𝗼 𝗿𝗲𝘀𝗲𝗿𝘃𝗲 𝘄𝗼𝘂𝗹𝗱 𝘆𝗶𝗲𝗹𝗱 𝘀𝗶𝗴𝗻𝗶𝗳𝗶𝗰𝗮𝗻𝘁 𝗺𝗮𝗰𝗿𝗼𝗲𝗰𝗼𝗻𝗼𝗺𝗶𝗰 𝗶𝗺𝗽𝗹𝗶𝗰𝗮𝘁𝗶𝗼𝗻𝘀 (using Google Gemini 2.0 Flash, Anthropic Claude Sonnet 3.7 and OpenAI GPT-4.5-preview):…","output":"US crypto reserve: big economic impact! 💰"},{"text_input":"Curious to hack? Join us in-person or virtually: Dive deeper into our CL vision: Want the complete answer to the prompt question? Read on.","output":"Join our hackathon! In-person or virtual. 🚀"},{"text_input":"One of our Verifiable AI hackathon tracks focuses on Consensus Learning (CL). We've written a paper on how CL enables response aggregation across LLM models, creating safer and more accurate AI. Now, we're showing you how to do it ☀️ &gt; Prompt: You are a macroeconomist…","output":"Consensus Learning boosts AI accuracy! 🤖"},{"text_input":"@Kinetic_Markets By isolating ISO markets from the Kinetic protocol, it ensures that any issues affecting a specific asset are contained, minimizing the risk of broader protocol disruptions. Good approach! Allowing Kinetidc to conservatively introduce more 'risky assets' into isolated pools,…","output":"Smart isolation for safer asset management! 🔒"},{"text_input":"New to @FlareNetworks? 1️⃣ If you have some FLR sitting in your wallet: Stake it or wrap it — and earn FlareDrops. How it works: 2️⃣ Monthly burns come from Flare's early investors to reduce competition for FlareDrops and minimize the dilution of holdings…","output":"Stake FLR for FlareDrops! 🔥"},{"text_input":"FlareDrops.25 is here 🪂 For every 100 WFLR, you're receiving 2.39 FLR! Blocks used to calculate your holdings: 37,605,774 \/\/ 37,690,300 \/\/ 38,044,228 Oh, by the way, we just burned 66M FLR 🔥","output":"FlareDrops.25: 2.39 FLR per 100 WFLR! 🪂"},{"text_input":"Yes → Hack with us in 2 days. $100K prize awaits: Not yet → Learn with us:","output":"Join our hackathon in 2 days! 💻 #Win100K"},{"text_input":"@hudspeth776761 They’re totally worth the shoutout ☀️👍🏻 Wish we could’ve included them all in this video...","output":"Great shoutout! 🌟"},{"text_input":"@BrukerikkenavnJ Feels like the energy drink for our next hackathon with @goldskyio 😁","output":"Hackathon fuel with @goldskyio! ⚡"},{"text_input":"&gt; Explore Goldsky’s features and ecosystem role: &gt; Flare supports developers with credits for new projects using Goldsky:","output":"Explore Goldsky's features with Flare support! 🚀"},{"text_input":"Welcome @goldskyio as Flare's primary indexing partner! Trusted by Polymarket, POAP, Unichain &amp; many projects you know &amp; love, Goldsky is integrating w\/ @FlareNetworks to empower devs with live-streamed data &amp; high-performance subgraph hosting. Build faster, innovate further☀️","output":"Goldsky joins Flare for better data & subgraphs! 🚀"},{"text_input":"Flare Builder Online Workshops - S6: How to Use the Random Number Generator","output":"Learn RNG in our workshop! 🎲 #FlareBuilder"},{"text_input":"Checking in! Learned anything new today👀? Join our live workshop today at 2PM UTC\/ 9AM ET to explore Flare's random number generator (RNG) and build games with verifiable randomness! See the winning example below🫡","output":"Join our RNG workshop today at 2PM UTC! 🎲"},{"text_input":"Exciting news for @FlareNetworks developers! We're now integrated with @ChainbaseHQ's Manuscript, a powerful blockchain data streaming framework. Easily retrieve, organize, and analyze Flare on-chain data to build dApps and gain insights! Get started now 👇🏻","output":"Flare + Chainbase: Streamlined dApp data! 🚀"},{"text_input":"Discover a lesser-known tool on @FlareNetworks: Random Number Generator. The secret sauce for creating unpredictable, tamper-resistant use cases like gaming and lotteries. 🎰 Tune in live this Wednesday:","output":"Flare's RNG: Secure gaming & lotteries! 🎲"},{"text_input":"@EnHeng456 Thank you for supporting Flare and our dApps! SparkDEX's $TRUMP perpmarket uses our enshrined Flare Time Series Oracle price feed, that means fast and secure 🫡","output":"Fast & secure $TRUMP market on SparkDEX! 🚀"},{"text_input":"@msvadari @EthereumDenver @j00sko @madebyfavio @CoreumOfficial Sounds like a very interesting chat 👀","output":"Exciting discussion on blockchain! 🚀"},{"text_input":"XRPFi is imminent!! Flare will kickstart it, expand it, and make it institutional-ready 🔓 1️⃣ Start: The FAssets v1 mainnet launch is approaching. With scaled, trust-minimized bridging for non-smart contract chain tokens like XRP, DOGE, and BTC, Flare will unlock a new influx…","output":"XRPFi is coming! Flare to boost it! 🚀"},{"text_input":"rFLR is part of a 510M FLR pool, from Flare’s 20Bn FLR cross-chain incentive allocation set in tokenomics, supporting DeFi growth on @FlareNetworks. Approved by community governance, it’s driven a 400% TVL surge! See its impact in just months:","output":"rFLR boosts DeFi on Flare with 400% TVL surge! 🚀"},{"text_input":"Unlock high yields on @flarenetworks. Get monthly rFLR rewards for ETH and stablecoins lending\/ trading. Next payout: March 3 🚨","output":"Earn rFLR rewards on Flare! Next: March 3 🚨"},{"text_input":"Had great chats with @DefiantNews &amp; @BlockFuel about Flare's Verifiable AI vision and DeFi plan for 2025 ☀️ Recording dropping soon","output":"Flare's AI & DeFi 2025 vision coming soon! ☀️"},{"text_input":"To ensure safer DeFAI, verifiability is essential. If you can't verify the AI, how can you be sure it's not controlled by scammers 🕳 Be at the forefront of AI and blockchain innovation. Explore Verifiable AI with @googlecloud @FlareNetworks @CalBlockchain @wlooblockchain:…","output":"Verifiable AI ensures trust in DeFAI systems. 🔍"},{"text_input":"To understand why DeFAI is powerful, start by grasping imperative vs declarative models ⏩️","output":"Imperative vs Declarative: Key to DeFAI's power! 🚀"},{"text_input":"Its 2025. Crypto adoption shouldn't be judged by the number of people at the main venue. We know that the crowd is building somewhere ☀️ Hacking w @wlooblockchain","output":"Crypto adoption is growing beyond the main venue 🌐"},{"text_input":"Keep your streak alive ☀️🎏 Maintain your daily streak to maximize rewards in the Flare Fair x @Layer3xyz Quest! Complete actions for 3 consecutive days to earn extra CUBE and boost your share of the $65,000 prize pool:","output":"Keep your streak for rewards! 🌟 #FlareFair"},{"text_input":"Flare's enshrined oracles have enabled a new generation of on-chain financial products, driving an impressive 400% YoY growth in TVL! • Liquidation-Free Leverage (@cyclofinance) • Treasury Bill Yield (@ClearpoolFin) • Perpetual Futures (@SparkDexAI Eternal) • Lending &amp;…","output":"Flare's oracles boost DeFi growth by 400%! 🚀"},{"text_input":"Too much infra? @Gwenole_M (@Consensys): Merge them! Our take: Interoperability remains a key problem to solve. Just don't take shortcuts. @FlareNetworks chose to build enshrined oracles because interoperability solutions stem from interoperable data.","output":"Interoperability is key! 🔑"},{"text_input":"@goldskyio @EthereumDenver @kevintheli @Consensys @magna_digital It was great meeting the Goldsky team 🌞","output":"Met the Goldsky team at Ethereum Denver! 🌟"},{"text_input":"Like what you're watching? The 2nd workshop is in 2 hours with @DoraHacks. Tune in:","output":"Join us for Workshop 2 with @DoraHacks in 2 hours! ⏰"},{"text_input":"Now is the best time to retrace and learn. Watch this, then \"social ai agent\" is no longer just a buzzword. Next lvl: Make it verifiable.","output":"Learn & verify: Social AI is evolving! 🤖"},{"text_input":"Live code now: Learn how to train Agent Pugo Hilion ☀️ Once learned, apply for the @googlecloud x @FlareNetworks Verifiable AI Hackathon! Track 1: Social AI Agent Prize: $6,000 Learn more:","output":"Train Agent Pugo Hilion for AI Hackathon! 💡"},{"text_input":"It's live 🟢 Join us here: Binance Live: YouTube: Too busy in Denver? Recordings coming soon!","output":"Join us live on Binance or catch recordings soon! 📺"},{"text_input":"Don't miss the next rFLR distribution around March 3rd 🗓️ Start participating in Flare Fair now to earn rFLR. What is rFLR and how do you claim it? 👇🏻","output":"Earn rFLR by joining Flare Fair! 💡"},{"text_input":"The 5th bi-weekly Songbird Test Incentive distribution COMPLETE. 50 lucky winners who had redeemed are sharing a ~$30K prize pool, with the top prize being $10,000 🏆 Check if you’re among the winners here: 🍀","output":"Songbird Test: $30K prize pool distributed! 🎉"},{"text_input":"FXRP on Songbird Wind-Down Update ⬇️ Community driven FAssets testing on Songbird has provided highly useful learnings about the FAssets protocol leading to a planned extensive upgrade of the protocols, termed FAssets v2. In order to maintain a testbed for these planned…","output":"FAssets v2 upgrade coming soon! 🚀"},{"text_input":"FLARE $FLR is now listed on @swissborg, a leading European exchange, with 16 fiat currencies and accessible in just a few taps.","output":"FLARE $FLR now on SwissBorg! 🚀"},{"text_input":"FIP.13 &amp; STP-10 passed — thanks for voting! Level up Flare DeFi ⏫️ Enabling accurate pricing for LSTs, LRTs, and general time-series feeds. Better collateral, lending, and risk management. First Custom Feed: sFLR @SceptreLS. Suggest the next ones here 👇","output":"Flare DeFi upgrades: Accurate pricing & risk mgmt! ⏫️"},{"text_input":"Want to harness @FlareNetworks' enshrined oracles and @GoogleCloud Confidential Compute to build a verifiable, secure future for AI and DeFi? You know where to find us. Apply now — last day today:","output":"Apply now for AI & DeFi innovation! 🚀"},{"text_input":"@Theresa_XRP @HugoPhilion Theresa, would you mind dropping the flare designs here? Not sure if we should click the link. In general, we welcome more F designs :)","output":"Sure, sharing the designs here! 🚀"},{"text_input":"Introducing the new Sleeker. Simpler. Build in public. Expect more evolution ☀️","output":"New Sleeker: Simpler, evolving in public! ☀️"},{"text_input":"@Anubis_Crypto_ Disconnect your wallet, then go to Bifrost settings, select Advanced, clear the cache, and reconnect your wallet.","output":"Clear cache & reconnect wallet for Bifrost fix! 🔄"},{"text_input":"@GibbonsLill @sammy_verghese @XStacks_Game @mewe @SecretNetwork @LiveDuel @NapthaAI @tashiprotocol Thank you Lisa 🫶","output":"Thanks, Lisa! 🫶"},{"text_input":"High-integrity data is flowing, fueling a new DeFi hub. Get ready for some surprises... We're crafting a whole new Flare experience ☀️","output":"New DeFi hub on Flare! Get ready for surprises! ☀️"},{"text_input":"With the approval of FIP.12, the Flare Data Connector (FDC) is now live on @FlareNetworks ☀️ The FDC is ready to support the attestation types required for the FAssets mainnet launch! The new reward structure is now in effect, with inflation rewards distributed as follows: ▪…","output":"FDC live on Flare! New rewards in effect. ☀️"},{"text_input":"Sign up at: IRL &amp; virtual hackathon with @FlareNetworks, @GoogleCloud, @CalBlockchain, and @wlooblockchain ➡️ Feb 25 Workshop \"Social AI Agents &amp; RAG Knowledge\" with @DoraHacks @dineshkpinto @HoriaMagureanu ➡️ Feb 26 Workshop…","output":"Join our AI & blockchain hackathon! 🚀"},{"text_input":"Building trust in AI starts with verifiability. Empower builders through education: 🔹 Social AI Agents &amp; RAG Knowledge 🔹 DeFAI &amp; Consensus Learning Sign up for the hackathon and get ready to learn—knowledge is the one thing no one can rug from you.","output":"Join our AI hackathon! 🤖 #AI #Learning"},{"text_input":"6\/ Learn more in this blog: Join the FAssets support group: Together, we’re building the DeFi hub for XRP, BTC, and DOGE ☀️","output":"Join FAssets: DeFi hub for XRP, BTC, DOGE! ☀️"},{"text_input":"5\/ Ooooonward to Mainnet! The launch of FAssets on the mainnet is on the horizon 🌅 It is set to mark a new era in bridging liquidity from multi-trillion-dollar markets to DeFi. FAssets V2 is coming to bring unlimited minting for users. 🦸🏻 Stay tuned.","output":"FAssets V2 mainnet launch soon! 🚀"},{"text_input":"4\/ FBTC coming in late February: Minting lot: 0.05 FBTC FBTC will maintain the same parameters as FXRP and FDOGE, including a $2M minting cap and user protection with insurance covering losses up to $300K ($100K per asset). Bi-weekly incentives will continue:…","output":"FBTC launching soon! 🚀"},{"text_input":"3\/ Actions required: 1️⃣ Redeem FXRP by March 23. (Pro tip: best to redeem as soon as possible, as redemption actions from now until February 23 still qualify for incentives.) 2️⃣ Withdraw SGB from the collateral pools of FXRP and withdraw &amp; swap your FXRP rewards on DEXes.","output":"Redeem FXRP by March 23! ⏳"},{"text_input":"2\/ ⚠️ Important Dates ⚠️ • FXRP wind-down period: &gt; Minting will be disabled on February 24. &gt; Redemption will be disabled on March 24. • FBTC goes live in late February. • @MetaMask and @Ledger support just added today.","output":"FXRP ends, FBTC starts, MetaMask & Ledger added! 🚀"},{"text_input":"1\/ Huge milestone for FAssets on Songbird 🎉 We saw almost 12K minting transactions, enabling 676K $XRP and 9M $DOGE for DeFi in just two months! Get ready for the next stage: FXRP sunsets &amp; welcome FBTC 🌅","output":"FAssets on Songbird: 12K mints, 676K XRP, 9M DOGE! 🎉"},{"text_input":"Flare Fair went live 10 days ago. ▪ TVL: +$9.67M (now $81.52M) - Source: @intotheblock ▪ Wallets: +70K (now 1.47M) ▪ Participation: Over 69K on @Layer3xyz Phase 2 incoming: What’s your game plan? 🎡🎠","output":"Flare Fair: $81.52M TVL, 1.47M wallets! 🚀"},{"text_input":"@GOTXRP More types of feeds. The FTSO currently focuses on price feeds for crypto assets with significant trading volume on CEXes. Custom Feeds will expand this to include data like Liquid Staked Tokens (LSTs) and cross-chain metrics. This expansion enhances the FTSO's core…","output":"FTSO expands to include LSTs & cross-chain data. 📊"},{"text_input":"Waterloo Blockchain @wlooblockchain is on a mission to bring 10,000 students on-chain, engage 1,000 builders, and connect with the top 100 founders in the space. As one of the most ambitious student blockchain communities, we’re fostering the next generation of Web3 pioneers…","output":"Join Waterloo Blockchain's Web3 revolution! 🚀"},{"text_input":"Exciting news, builders 🤠 @wlooblockchain joins our community partner roster for the Flare x @GoogleCloud Verifiable AI Hackathon! Innovate at the intersection of blockchain, AI, and confidential computing with the brightest minds at UC Berkeley. Few days left to apply ⬇️","output":"Join Flare x GoogleCloud AI Hackathon! 🚀"},{"text_input":"@wrappedxyz @BTC_OS @Aptos @PythNetwork @wormhole @agoric @Stacks @StellarOrg Wrap with us in Denver ☀️","output":"Join us in Denver for crypto fun! 🌟"},{"text_input":"@SceptreLS Seeing Lex and Joel support users 24\/7 while producing high-quality education, we believe this is a well-deserved milestone!","output":"Congrats Lex & Joel! 🎉 Well-deserved milestone!"},{"text_input":"More technical details, including the associated risks and smart contract changes, can be found at: FIP.13: STP.10: Here's how to vote 👇🏻","output":"Vote on FIP.13 & STP.10! 🗳️"},{"text_input":"Voting for FIP.13 &amp; STP.10 started ☀️ Enables LSTs, LRTs and more Custom Feeds via logic encoded in smart contracts. The Flare Time Series Oracle is at the cusp of a major scaling breakthrough. Support decentralization and institutional-ready products by voting today!","output":"Vote for FIP.13 & STP.10! Support decentralization! 🌟"},{"text_input":"@PhotonJonny Sounds like you're cooking something... Can slide into DMs of @_LanaNT_","output":"DMs open for cooking tips? 🍳"},{"text_input":"Why do we need TEEs when there is Cloud 一 In the beginning, there was the Cloud ☁️ - Scalable, efficient, easily manageable. - Live migration, snapshots, etc. - No detailed resource estimation needed beforehand. BUT 🌧️ …it’s essentially just someone else’s computer ⛈️ TEEs…","output":"TEEs secure data on others' computers. 🔒"},{"text_input":"Build verifiable AI agents with @FlareNetworks and @googlecloud. Total prize pool: $100,000 What are you waiting for? Check bio.","output":"Join the AI challenge! 🏆 #AI #FlareNetworks"},{"text_input":"Multichain Day: Builders' Brunch: Can't get in? Slide into our DMs and we might be able to help!","output":"Join us at Multichain Day! DM for access help! 🚀"},{"text_input":"Sun's out at ETHDenver! Scouting for talent and builders☀️ Who's joining us?","output":"ETHDenver talent hunt! Who's in? 🌞"},{"text_input":"We need applications with Web2 UX plus blockchain guarantees. That's why we're excited about TEEs 🍵","output":"Web2 UX + blockchain security = TEEs 🍵"},{"text_input":"@googlecloud @CalBlockchain User expectations for high-performance, data-rich dApps are rising. Blockchain's decentralized nature poses computational and and scalability limits, incl. high data storage costs and power for complex on-chain tasks. The Verifiable AI Hackathon with @googlecloud and…","output":"Rising dApp demands challenge blockchain limits. 🚀"},{"text_input":"Sending @baylifee the Flare merch set ☀️ Thank you all for participating!","output":"Flare merch set sent to @baylifee! ☀️"},{"text_input":"Pro Tip on Flare x @layer3xyz Get your Daily Streaks! Use Fun Zone dApps 3 days in a row for bonus CUBE for a bigger share of $65K payout on March 15th.","output":"Earn bonus CUBE by using Fun Zone dApps! 🎉"},{"text_input":"@brave Getting🩷from @brave on Valentine's day is something extra special","output":"Brave love on Valentine's Day! 🩷"},{"text_input":"@UCBerkeley @CalBlockchain @googlecloud and hackers Looking forward to our date 🌹","output":"Excited for the collab! 🌟"},{"text_input":"@hexshapeshifter @Kinetic_Markets DeFAI is one of our AI hackathon tracks 🫡 @hexshapeshifter @Kinetic_Markets","output":"AI hackathon track: DeFAI 🧠"},{"text_input":"@Aj_Tech_01 @j00sko @encodeclub Nice! Are you joining our next hackathon? 👀","output":"\"Excited for the hackathon! Count me in! 🚀\""},{"text_input":"Industry x Academia → Make AI better ☀️ Explore TEEs, Confidential Computing, and Flare simultaneously at @UCBerkeley or from home. 1 week left to apply. Tick tock.","output":"Apply now for AI research at UC Berkeley! ⏰"},{"text_input":"Full list of winners: Did you hack with us? Step in &amp; sign up if you're interested in building better AI:","output":"Join us to build better AI! 🤖"},{"text_input":"Talk about making real impacts! FlareInsure leverages FDC to reinvent micro-insurance marketplaces onchain, bringing real-world data to protect farmers and small business against unpredictable risks that threaten their livelihoods. Demo:","output":"Onchain micro-insurance for farmers! 🌾"},{"text_input":"ProteinMango 🥭 - Parametric earthquake insurance marketplace ~ powered by Web2 data from FDC. Beardofginger, @paranoidsyntax &amp; @kirillrybkov: \"The Flare doc was very good. It was very helpful that the team was present all day and willing to help.\"","output":"ProteinMango: Parametric insurance powered by data! 🥭"},{"text_input":"Kingdom of LagaFlare - NFT card game using Flare’s random number generator for verifiable gameplay. @gkydev: \"Flare’s RNG is an exceptional feature—I only wish I had discovered it sooner\" 🤝 This game is fully playable on Coston2 👀","output":"Kingdom of LagaFlare: Playable NFT card game! 🎮"},{"text_input":"Congrats to @jerielczy, Jeff &amp; Lim from @nus_blockchain for winning the best consumer app with FlareGate! FlareGate provides a trustless way to on\/off-ramp leveraging Flare Data Connector. It integrates Open Banking APIs to verify off-chain transfers, allowing users to securely…","output":"FlareGate wins best app! 🎉 Secure on\/off-ramp tech."},{"text_input":"Ship together, stick together 🌹 140+ buidls at ETHOxford2025 by @HomeDAO_live Here's what was built with @FlareNetworks 🧵","output":"ETHOxford2025: 140+ projects with Flare! 🚀"},{"text_input":"@silvacoinz @brave Highlight: @cyclofinance as Top Site. That shows your calibre ;)","output":"CycloFinance is a top site! 🚀"},{"text_input":"@WisconsinMan5 @brave Glad to hear! Her name is Charlotte and she drinks plenty of water.","output":"Charlotte stays hydrated! 💧"},{"text_input":"Conditions: 1. Each @brave user has a fair chance to see this ad and can share the screenshot only once. We know when the last ad will go live (sometime tomorrow), so don't try to cheat it 🙂 2. Prize: A Flare merch set, our respect and follow back. 3. For those who have…","output":"Win Flare merch by sharing a Brave ad screenshot! 🎉"},{"text_input":"Flare Fair is now running an ad on @brave. Yall are quite excited about it and sharing screenshots, so the intern is thinking: Why not make it a game? The most recent comment below showing the ad while the ad is still active wins 🫡","output":"\"Spot the ad on @brave and win! 🎯\""},{"text_input":"@ol_bocephus They're back open with no cap on participants 🫡 Participants still get a CUBE for completing those tasks. More CUBEs = larger slice from the $65K prize pool.","output":"Earn CUBEs for a share of $65K prize pool! 💰"},{"text_input":"@ol_bocephus Awesome! Yeah, we're reopening them. We'll post updates on our socials.","output":"Reopening soon! Stay tuned for updates. 🎉"},{"text_input":"16\/ Finally, wrapping this up with a detailed Flare Fair tutorial by @AceThaGreatest. Remember, keep on connecting, collecting, claiming — and creating!","output":"Flare Fair tutorial by @AceThaGreatest! 🔥"},{"text_input":"15\/ @KingKaranCrypto takes a deep dive into the Flare ecosystem and shares why he believes in Flare. Thank you. We believe in you, Karan! 👑","output":"Flare ecosystem insights by @KingKaranCrypto! 🔥"},{"text_input":"14\/ And here you are - @ch04niverse goes different and creates Flare Compass, a TG bot to help you navigate Flare 101! Quite cool.","output":"Flare Compass: Your guide to Flare 101! 🚀"},{"text_input":"13\/ @EconomicShinobi created video content for Spanish speakers to check out -&gt; ✅ Por qué XRP podría ser la clave para el crecimiento de Flare.","output":"XRP: Clave para el crecimiento de Flare 🚀"},{"text_input":"12\/ @zizicrypt wrote a well-structured thread on FAssets which will be helpful to anyone wanting to learn more about bringing smart contract functionality to non-smart contract chains.","output":"Learn FAssets for smart contracts on any chain! 🚀"},{"text_input":"11\/ For the devs out there, @Aj_Tech_01 created a comprehensive guide to Flare oracles for devs. Excellent work, we need more dev content 🫡","output":"Guide to Flare oracles for devs by @Aj_Tech_01 📘"},{"text_input":"10\/ 特攻隊長 @kikubo breaks down concepts for their community. This week, they delve into FlareDrops!","output":"FlareDrops insights by @kikubo! 🚀"},{"text_input":"9\/ Hugo has spoken: 'Excellent summary.' @TheDeFiSalesman welcome to Flare 👋🏻","output":"Welcome to Flare! 🚀"},{"text_input":"8\/ Check out this write-up about FAssets and how Flare brings DeFi to everyone! 🙌 Great work @fuxnby","output":"Flare's FAssets: DeFi for all! 🚀"},{"text_input":"6\/ Intern is a sucker for infographics and @cryptowavers brought the heat with this thread.","output":"Infographics fan? Check out @cryptowavers! 📊"},{"text_input":"5\/ Still trying to pronounce DeFAI aloud. Stunning work again from @nes_campos. Fun read and great attempt, friend!","output":"Great work on DeFAI! 👏"},{"text_input":"4\/ @a_nitapounds brought a very cool video tutorial for how to delegate your FLR tokens and earn rewards. Lowkey love the background track.","output":"Delegate FLR tokens for rewards! 🎥"},{"text_input":"2\/ WOW. This educational roadmap from @itzbanknotez looks like it took quite some time. You must have been working on this even before the bounty began. Kudos!","output":"Impressive roadmap! 🎓"},{"text_input":"1\/ Say hi to Thank you to @sarah_n_crypto for showing off how easy it is to participate in the Flare Fair. Congrats on the BIG bounty this week. Keep on connecting, collecting, claiming — and creating!","output":"Thanks @sarah_n_crypto for the Flare Fair demo! 🎉"},{"text_input":"With the launch of Flare Fair, there's simply so much great content. For this final week, we couldn’t just stop at 9 winners, so we’ve upped the game with extra winners! Let’s jump right into their creation:","output":"Flare Fair ends with extra winners! 🎉"},{"text_input":"@KingKaranCrypto @MoonBridgeArmy @AlphaHuskyClub We appreciate you creating this video, Karan 🫡","output":"Thanks for the video, Karan! 🚀"},{"text_input":"@Sl8er_Jax @StargateFinance @Kinetic_Markets @SparkDexAI @ClearpoolFin @cyclofinance @blazeswapdex @enosys_global @SceptreLS USDX T-pool to start with. Part of the yields come from T-bills. Can start exploring here:","output":"Explore USDX T-pool yields from T-bills! 📈"},{"text_input":"@Kinetic_Markets @StargateFinance @SparkDexAI @ClearpoolFin @cyclofinance @blazeswapdex @enosys_global @SceptreLS Let's keep making Flare DeFi a blast for everyone 🎉","output":"Flare DeFi is thriving! 🚀"},{"text_input":"@StargateFinance @Kinetic_Markets @SparkDexAI @ClearpoolFin @cyclofinance @blazeswapdex @enosys_global @SceptreLS Find out tomorrow:","output":"Crypto collab reveal tomorrow! 🚀"},{"text_input":"Flare Fair Quest is live! In just 2 days: • Reached 10K limit with @StargateFinance bridging task • 20K+ participation across @Kinetic_Markets @SparkDexAI • 10K+ visited @ClearpoolFin @cyclofinance @blazeswapdex @enosys_global @sceptreLS at Fun Zones What’s happening?","output":"Flare Fair Quest hits 20K+ participants! 🚀"},{"text_input":"Staking rewards for epoch 262-265 are ready to claim! Remember: Staked FLR gets FlareDrops without extra steps. Compound that FLR, and enjoy the ride ☀️","output":"Claim your FLR rewards now! 🚀"},{"text_input":"@0xBuildersClub good breakfast good build sharing the winners' creations shortly 🫡","output":"Sharing winners' builds soon! 🛠️"},{"text_input":"@ksw54548 @HugoPhilion Will relay this to @HugoPhilion and @_LanaNT_","output":"Relaying message to Hugo and Lana! 📩"},{"text_input":"@whale589 We're also super proud of a community like you - people need to know posts like this are purely organic. You zipped through 3 Flare dApps + bridging in just 6 minutes, showing off not only how connected everything on Flare is but also how well you know us.","output":"Flare dApps are seamless and fast! 🚀"},{"text_input":"What's after $TRUMP in the FTSO? Get ready for 🐻⛓️ Reached the FIP.08 trading volume requirement, so $BERA price feed will be available for Flare dApps in just 1 week. FTSO: More data delivered faster ⚡️","output":"$BERA price feed coming to Flare dApps soon! ⚡️"},{"text_input":"@TheDeFiSalesman @HugoPhilion FRESH and hey still keeping the details! love it","output":"Exciting updates in DeFi! 🚀"},{"text_input":"Supercharge Flare DeFi with Custom Feeds 🔋 FIP.13 &amp; STP.10 let you bring LSTs, LRTs, and other cross-chain data — derived from smart contract logic — to the FTSO. Understand the proposed changes and vote soon:","output":"Boost Flare DeFi with custom feeds! 🔋"},{"text_input":"@sentosumosaba @whale589 @doppler_fi @XDFiProtocol What a great collab! Thank you both 🐋 🌸","output":"Great collaboration! 🌸"},{"text_input":"@jimmyclarke11 A refresh or two should resolve this, mainly when facing a Cloudflare challenge. If the issue persists, contact Layer3's support team on Discord. Discord invite:","output":"Try refreshing or contact support on Discord. 💬"},{"text_input":"@wilproft How selection was done: 1. Order addresses by their weights in order of first redemption. 2. Get a random number from the Relay smart contract at the end of the reward interval (00:00 UTC). 3. Divide the random number by the total weight to determine the winner. 4. Hash the…","output":"Random selection via weighted addresses! 🎯"},{"text_input":"@xrpen15 Might require a mutual follow first. But let us DM you. Generally it is easier and faster to reach us at about Songbird test support.","output":"DM us for Songbird test support! 🐦"},{"text_input":"@AceThaGreatest It's all you guys. You get what you give. And you guys are giving!","output":"Keep giving your best! 💪"},{"text_input":"@xrpen15 For Songbird testing? 80% of total rFLR incentives are distributed to participants redeeming FAssets when minted lots exceed 75% of capacity per FAsset. Rewards are distributed through a lottery system of 50 rewards. DM us to check your eligibility.","output":"Check eligibility for Songbird rewards! 🎉"},{"text_input":"@vickytoriah_ @SuperteamUK @avax @BNBCHAIN @Ripple @HomeDAO_live @tl_solana @RJL_Solana @DrAdaku @superteam @solana @Ongullperson Heard great things about your team! Thanks for building with us ✊️","output":"Thanks for the support! 🚀"},{"text_input":"FAssets Songbird incentives are now claimable on the Flare Portal's \"Emission\" tab! Who are the winners of this redemption reward? Check if you've won $10,000 at: - -","output":"Claim Songbird rewards on Flare Portal! 💰"},{"text_input":"New to @FlareNetworks? Want an overview of what this is about? Read on:","output":"Discover Flare Networks! 🌐"},{"text_input":"Exclusive Flare Fair rewards on @layer3xyz 🎈 Bridge, lend, learn and build a daily streak for a share of $100K in daily rewards. Open for 34 days only! Get in now:","output":"Earn daily rewards on @layer3xyz! 🎈"},{"text_input":"@tina_connects Glad to hear from you, Tina! Can't do this launch without you 🫶","output":"Excited for the launch, Tina! 🚀"},{"text_input":"When you think that's all, hold that thought. $100,000 rewards await for your first Flare step. Turn on notifications 𝕏","output":"$100K rewards for your first Flare step! 🚀"},{"text_input":"@Buddha7773 @Danrocky Here you can discuss the issues. No mods will DM first.","output":"Discuss issues here, no DMs from mods. 🗨️"},{"text_input":"@BPCmeta Totally understand wanting the mainnet! That said, the rewards and experiences from testing on Songbird are still valuable 🫡","output":"Testing on Songbird is valuable! 🪂"},{"text_input":"@JBUKUC Open beta rewards will be distributed after mainnet launch.","output":"Rewards after mainnet launch! 🚀"},{"text_input":"Want to test FAssets a few more times before the mainnet launch? You're invited to try and earn from the $37K biweekly rFLR rewards (next distribution ~Monday)! FXRP is very popular, but try minting FDOGE 🐕 &gt; &gt;","output":"Test FAssets & earn rFLR rewards! 🚀"},{"text_input":"@crypto_ceej @YouTube Thank you @crypto_ceej for this! Looking forward to the show 🎢","output":"Excited for the crypto show! 🚀"},{"text_input":"Imagine a network of appchains secured by Flare's economic security, FXRP and $134Bn XRP. Using Flare's architecture for multitasking and fast transactions, a restaking solution can enhance workload distribution and service customization on XRPL. For builders, this means…","output":"Appchains on Flare boost XRPL with $134B XRP! 🚀"},{"text_input":"@chennai2london @StargateFinance @SceptreLS Say no more, Anand, this is one of the most detailed Flare DeFi diaries! Recommend our ecosystem dApps to take a look and help Anand complete his research.","output":"Check out Anand's detailed Flare DeFi diary! 📘"},{"text_input":"@pehckie2007 @a_nitapounds Very soothing music and easy to follow!","output":"Glad you enjoyed the music! 🎶"},{"text_input":"@spintax2 Imagine being the vibe creator at flare all day everyday","output":"Creating vibes at Flare daily! ✨"},{"text_input":"@crypto_ceej @StargateFinance @SparkDexAI @Kinetic_Markets 🫡 More to come.","output":"Exciting updates ahead in crypto! 🚀"},{"text_input":"@AlphaFrog13 @stacy_muur You can start earning by using Flare DeFi without needing Galxe or Zealy.","output":"Earn with Flare DeFi, no Galxe or Zealy needed! 🚀"},{"text_input":"@itsflyeth @enosys_global Didn't expect cosplayers so soon. You think Jessica Nigri will show up at comic-con repping Flare Fair?","output":"Maybe! She's known for surprise appearances! 🎭"},{"text_input":"ICYMI we launched Flare Fair today. What's in it for you? Flare Fair is a virtual park to learn about DeFi and stack $FLR. It features Fun Zones with dApp tutorials showing how to earn from the 510M FLR rewards pool. P.S. We accidentally overwhelmed Cloudflare with traffic.…","output":"Explore DeFi at Flare Fair! Earn $FLR rewards! 🎢"},{"text_input":"Strong and flare-pilled! With these builders and our community, we dare to expand to broader ecosystems. Come hang out 🤙🏻","output":"Expanding ecosystems with our community! 🤙🏻"},{"text_input":"@PlasticDogs @CK113311 @StargateFinance @SparkDexAI @Kinetic_Markets They all go into the square hole. Let Flare be your square hole.","output":"Flare: The square hole for all your needs! 🔷"},{"text_input":"@xrpen15 Sorry too many people joined the fun at once. We're getting you in as quickly as possible.","output":"Hang tight, we're working on it! 🚀"},{"text_input":"@tarinvestment Sorry too many people joined the fun at once. We're getting you in as quickly as possible.","output":"Hang tight, we're working on it! 🚀"},{"text_input":"@kikubo Sorry too many people joined the fun at once. We're getting you in as quickly as possible.","output":"Hang tight, we're working on it! 😊"},{"text_input":"@ClearpoolFin DeFi blue + pink simply looks great Thank you for the support @ClearpoolFin 🤝","output":"DeFi colors pop! Thanks, @ClearpoolFin! 💙"},{"text_input":"Why Flare Fair? You can earn rFLR from a 510M FLR pool &amp; more. And to us, it's a new chapter in finding the Flare voice and the first step in our grand plan for global adoption. For the first time, all of Flare's top DeFi dApps @StargateFinance @SparkDexAI @Kinetic_Markets…","output":"Earn rFLR from 510M FLR pool! 🚀"},{"text_input":"@LeaderAlphaNews This is the 'birth' of something new. dont fade us","output":"Exciting beginnings! 🌟"},{"text_input":"@DiepSanh @UpholdInc We wanted the brand to feel a bit more... human","output":"Making brands more relatable! 😊"},{"text_input":"@Changelly_team @UpholdInc Bottom line is, you're going to love what we've got cooking","output":"Exciting updates coming soon! Stay tuned! 🚀"},{"text_input":"@Moonchaser2020 Our designer took ‘bottom-up innovation’ a bit too literally.","output":"Creative design mishap! 😂"},{"text_input":"@UpholdInc We asked our intern to post an image of the portal to the greatest place on earth. We really should have been more specific.","output":"\"Oops! Next time, we'll be more specific! 😅\""},{"text_input":"Hoooly smoke Did you see our latest tweet Exciting stuff on the way that you can use for your creative bounty ✨ We're extending the submission deadline to Feb 11 and upping the Week 4 prize pool to reward 15 winners this last week! Cannot wait to see you work your magic 🔮","output":"Deadline extended to Feb 11! 🎉"},{"text_input":"@Timnologynl @HugoPhilion @googlecloud System Explorer's \"Minimal Condition\" gives you an overview of the current and previous performance of data providers and whether they are eligible for rewards. How to use the Explorers for making informed decisions about delegation:…","output":"Use System Explorer for delegation insights! 📊"},{"text_input":"@sarah_n_crypto @cyclofinance @SceptreLS @SparkDexAI @gemspump_io @PixelChainGames @blazeswapdex @XDFiProtocol @Kinetic_Markets Fresh style, fresh language, and fresh thinking! Great clip, Sarah 🫡","output":"Nice clip, Sarah! 🚀"},{"text_input":"3\/ From AI to blockchain builders, this hackathon empowers you to innovate at the intersection using @GoogleCloud Confidential Compute and @FlareNetworks' enshrined oracles. For more details on participating in the Verifiable AI Hackathon, visit:","output":"Join the Verifiable AI Hackathon! 🚀"},{"text_input":"2\/ The 4 tracks are: 🤖 Social AI Agent – AI to manage social media 📚 RAG Knowledge – Verifiable Retrieval-Augmented Generation 💸 AI x DeFi – AI-powered autonomous DeFi 🧠 Consensus Learning – Decentralized AI model Total Prizes: 🏆 In-person: $60,000 🏆 Virtual: $40,000","output":"AI Hackathon: $100K Prizes! 🤖 #AI #DeFi #RAG #Consensus"},{"text_input":"1\/ 🗓️ In-person @UCBerkeley: March 7-9 🔗 🗓️ Online via @DoraHacks: March 7-14 🔗 The IRL &amp; online hackathon will each challenge devs to explore how TEEs can enhance blockchain scaling &amp; verifiability thru one of 4 tracks.","output":"Hackathon: TEEs for blockchain scaling! 🚀"},{"text_input":"Build with us at the Flare x Google Cloud Verifiable AI Hackathon. Advance how AI and blockchain work together and be rewarded from a $100K prize pool. Want to join? 👇","output":"Join Flare x Google Cloud AI Hackathon! 💡"},{"text_input":"@Xangle_official @googlecloud @UCBerkeley @CalBlockchain Thank you @Xangle_official 🫡","output":"Thanks for the shoutout! 🚀"},{"text_input":"Flare is hosting a hackathon with @googlecloud on Verifiable AI using Trusted Execution Environments (TEEs). It's at UC Berkeley with @CalBlockchain, starting March 7. Compete for $100K: $60K in-person, $40K virtual. Apply now:","output":"Join Flare's AI hackathon at UC Berkeley! 💡"},{"text_input":"@BroemmelsiekGtr We can't spill the beans just yet, but we're joining this list of their partners. More to come very soon!","output":"Exciting partnership news coming soon! 🤝"},{"text_input":"In the AI race, both data and computing power must grow. Whoever provides both first will win.","output":"Data + computing power = AI victory! 🚀"},{"text_input":"FlareDrops.24 is here 🪂 Reward rate: 2.485 FLR per 100 WFLR Snapshots taken at 36,234,919 \/\/ 36,467,583 \/\/ 36,904,496. Monthly rewards for WFLR holders and FLR stakers continue - with 12 more drops to go🤙🏻","output":"FlareDrops.24: 2.485 FLR\/100 WFLR. 12 drops left! 🪂"},{"text_input":"@_WaterAmi @sarah_n_crypto We onboard the community with the community. The community is the cool one here.","output":"Community-driven onboarding is key! 🌟"},{"text_input":"@_LanaNT_ @spintax2 Many want the F hat 👀. Shall we add it to this week's Creative Bounty prize pool?","output":"Add the F hat to the prize pool! 🎩"},{"text_input":"FIP.12 approved - Flare Data Connector mainnet launch soon! FDC isn't just another oracle - it brings external events and blockchain states onto @FlareNetworks with network-level security guarantees. As attestation types expand, the potential use cases multiply exponentially ⤴️…","output":"FDC launch on Flare: secure data integration! 🚀"},{"text_input":"Who will stay? Projects with strong financial health, actual decentralization, and solid use cases\/fundamentals. Join @FlareNetworks as: - Dev content specialist - Social media manager - APAC ecosystem lead - Head of BD","output":"Join @FlareNetworks for exciting roles! 🚀"},{"text_input":"More free courses are available at Dev hub: Have questions? Join the BUIDers-only channel on Discord:","output":"Free courses at Dev Hub! Join our Discord! 🚀"},{"text_input":"Imagine you just spent 2 hours watching these and then tinkering with the examples at our dev hub. You’ll then be already quite equipped for most of the hackathons that we’re participating in or hosting with competitive prize pools. Grow with us ☀️","output":"\"Join our hackathons and win big! 🌟\""},{"text_input":"The RFP submission period closed some time ago. Promising developments are underway using Flare’s infrastructure to develop an XRP native and restaking solution. 2025 - laser focus on unlocking XRP's exponential opportunities ☀️","output":"XRP's future: native & restaking solutions by 2025! 🚀"},{"text_input":"@HugoPhilion Yield, staking, LST, restaking, cross-chain lending &amp; borrowing... Make XRP fun again for degens 🤘","output":"XRP: Yield, staking & more for crypto enthusiasts! 🚀"},{"text_input":"@PixelChainGames A game that can collect and stake on Flare sounds good! Send it 💪","output":"Exciting! Can't wait to see it in action! 🚀"},{"text_input":"Not all oracles are built the same. Flare's native oracles are: Decentralized for crypto natives Secure for institutions Free for everyone Data just works on @FlareNetworks.","output":"Flare oracles: Decentralized, secure, and free! 🔗"},{"text_input":"@CommunityFlare @_DigitalDynamix Thank you for building on Flare 🫡","output":"Excited to see Flare's growth! 🚀"},{"text_input":"7\/ We loved @CommunityFlare's fresh take on Flare as the \"Community of Communities. We're thrilled to have you as part of our interconnected community.","output":"Excited for @CommunityFlare's new vision! 🌟"},{"text_input":"6\/ Ever dream of running your own Flare observer node at home? This quick guide walks you through the process. Perfect for devs and enthusiasts looking for a hands-on Flare experience! Check out the full thread by @xrpen15 and get cracking.","output":"Run a Flare node at home! 🌟"},{"text_input":"5\/ Curious about the difference between Songbird and Flare? This blog post breaks down why Flare’s “canary network” is the ultimate testbed for new features before mainnet rollout. Nice work, @nes_campos","output":"Flare's Songbird: Test new features before mainnet! 🚀"},{"text_input":"4\/ Sometimes, you just need content that'll rally the troops, and @ripuo_rankp's dope art piece does that exceptionally! 🔥","output":"Rally the troops with @ripuo_rankp's art! 🔥"},{"text_input":"3\/ Wondering where all that liquidity on Flare is coming from and heading to? @AceThaGreatest mapped out the top DeFi projects and it’s eye-opening!","output":"Flare's DeFi liquidity map revealed! 🚀"},{"text_input":"2\/ Looking for a crash course to build on Flare? This blog by @Aj_Tech_01 is a great place to start.","output":"Build on Flare with this crash course! 🚀"},{"text_input":"1\/ Our bounty champion this week is @sarah_n_crypto with her incredible video guide on leveraging Flare for real-world purchases! Her step-by-step demo shows how to cross the gap between crypto and everyday spending.","output":"Congrats @sarah_n_crypto! 🎉 #CryptoChampion"},{"text_input":"We asked for creativity and you delivered ⛵️ @FlareNetworks Creative Bounty just wrapped up week 3 out of 4, and we're thrilled to announce our winners. Ready to see who made the cut? 👇","output":"FlareNetworks Creative Bounty winners announced! 🏆"},{"text_input":"Hack with us @HomeDAO_live's ETH Oxford Hackathon 2025 🫡 3 days of coding, workshops, 1-1 mentoring at @UniofOxford Maths Institute. Win from our $18k pot. Apply: Guide: 2024 recap👇","output":"Join ETH Oxford Hackathon 2025! 💻 #ETHOxford"},{"text_input":"@TimeVoyageur @HugoPhilion @CommunityFlare @Danrocky Here we are 🫡 Delegation video coming next!","output":"Delegation video coming soon! 🚀"},{"text_input":"Stake $FLR on @FlareNetworks to support &amp; earn: - Use @Ledger wallet for strong security. - Get FlareDrops, vote on governance while staking. - Earn bi-weekly rewards, use LST solution @SceptreLS sFLR for DeFi. Here's how 👇","output":"Stake $FLR for rewards & governance! 🔥"},{"text_input":"@RetailDAO discussed the what and how with @_0xSami &amp; @0xthanos:","output":"RetailDAO talks with @_0xSami & @0xthanos 🤝"},{"text_input":"A strong DeFi project on @FlareNetworks not yet listed on @DefiLlama's Flare page: @Dinero_xyz, a native ETH staking solution with 1-click. flrETH growth has been remarkable — 987 ETH in 3 months ✨ Use your ETH on Flare for greater DeFi opportunities:","output":"Dinero: 1-click ETH staking on Flare! 🚀"},{"text_input":"@Ellsworth2E @Danrocky If the transaction failed, the system should return the SGB. If not, please DM verified mods your address and they'll look into it:","output":"DM mods if SGB not returned after failure. 🔄"},{"text_input":"@ksw54548 @AlfredoZurich @SceptreLS @cyclofinance @SparkDexAI @cryptocom Great answer!","output":"Thanks for the support! 🙌"},{"text_input":"@WTouzaW @Flare @Flare_Labs @HugoPhilion Congrats Willy and thanks for the support ☀️","output":"Congrats Willy and team! ☀️"},{"text_input":"@wilproft @XRP_FLR_SGB @HugoPhilion @Flare_Labs Please check here about the winners announcement:","output":"Check winners announcement here! 🏆"},{"text_input":"Another round of $37K worth of Songbird Test incentives is LIVE and ready to claim on Flare Portal’s “Emission” tab ✨ And the $10K rFLR in the redemption lottery results are out too — head to the minting sites now to discover if you’re a winner! Boost your chances by…","output":"Claim $37K Songbird Test incentives now! ✨"},{"text_input":"@XRP_FLR_SGB @HugoPhilion @Flare_Labs It will be announced today on the minting platforms and our socials. Stay tuned.","output":"Announcement today on minting platforms! 🚀"},{"text_input":"FIP.12 voting starts today! The Flare Data Connector enables secure access to on-chain and off-chain data, unlocking new possibilities for the @FlareNetworks ecosystem. New to voting? Follow this step-by-step guide👇 and cast your vote by Feb 3 ☀️","output":"Vote for FIP.12 by Feb 3! ☀️"},{"text_input":"Now, who thinks creating a tutorial video for the Flare System Explorer is a good idea? Off you go: Remember, it pays to be creative at Flare:","output":"Create a Flare System Explorer tutorial video! 🚀"},{"text_input":"3️⃣ Who is earning the most? To find out who is earning the most, check the \"PROVIDERS\" tab and look at the \"DELEGATION REWARDS\" column for a quick evaluation. Keep in mind that this figure does not account for the fees charged by the providers.","output":"Check \"PROVIDERS\" for top earners! 💰"},{"text_input":"2️⃣ Are my data providers qualified for rewards? Check the advanced tab and look for \"MINIMAL CONDITIONS\" Those providers marked with a \"YES\" under the column for \"ELIGIBLE FOR REWARDS.\" You can view this information here","output":"Check \"MINIMAL CONDITIONS\" for rewards! ✅"},{"text_input":"1️⃣ When will FTSO delegation rewards be distributed? Rewards are calculated off-chain and require signatures from the providers for distribution. The FTSO reward typically takes one to two days to process after over 50% of the delegation weight is signed. To make it easy,…","output":"FTSO rewards: 1-2 days post 50% signature. ⏳"},{"text_input":"1️⃣ When will FTSO rewards distribution happen? 2️⃣ Are my data providers qualified for rewards? 3️⃣ Who is earning the most? All information is visible on Flare Systems Explorer ✨ Here's how to use it to find the answers:","output":"Check Flare Systems Explorer for FTSO rewards info! ✨"},{"text_input":"\"Flare is a fast chain with many features that allow us to build great products.\" Too many choices in every part of the build stack can slow you down. A fast, cheap, and robust chain with enshrined oracles and complete dev tools is here to help you focus on what really matters:…","output":"Flare: Fast, cheap, robust chain for devs! 🚀"},{"text_input":"FAssets Open Beta officially closes with site sunset and rewards around the corner: 46K users minted 52.7M FXRP (~$164M worth XRP bridged) in this test! Massive demand for XRPfi proven. What will FAssets on mainnet trigger?","output":"FAssets Beta ends; 52.7M FXRP minted! 🚀"},{"text_input":"@Uncle_Jed_1 Hi there, thanks for the questions. To see the redemption tickets, you need to first claim your rewards, then it will show up (see attached screenshot). About Songbird test rewards - 80% of the allocated incentives are for redeeming; while 20% are for DEX pools. For redeeming,…","output":"Claim rewards to view redemption tickets! 🎟️"},{"text_input":"FIP.12 Proposal voting begins January 28th: New FTSO price feeds on Flare: $JOULE $HBAR $PENGU $HYPE $APT $PAXG and $USDX. Cast your vote and shape Flare's future ☀️","output":"Vote on FIP.12 for new Flare price feeds! ☀️"},{"text_input":"Flare Data Connector and USDX feeds are critical for the FAssets launch on mainnet. Here are the latest updates: - FIP.12: Latest proposal, bringing FDC to mainnet. - USDX\/USD feed: Recently approved. In our lane. Focused. ☀️","output":"FDC & USDX feeds ready for FAssets launch! 🚀"},{"text_input":"Freebies catch your eye, but learning why and how to 'get onchain' goes a long way. Unpack big words: DLT, decentralization, EVM programmability &amp; more with @FlareNetworks x @encodeclub. Free educational series for all - devs &amp; curious minds welcome ☀️","output":"Learn blockchain basics with Flare & Encode! 🌟"},{"text_input":"Remember - it pays to be creative at @FlareNetworks! Have a good weekend everyone ☀️","output":"Be creative at Flare Networks! 🌟"},{"text_input":"8\/ And finally, we have @CommunityFlare's post on why he thinks the Flare Time Series Oracle (FTSO) is the best oracle🥇","output":"FTSO: The top oracle choice! 🥇"},{"text_input":"7\/ Thank you to @XRP_FLR_SGB for your helpful video walkthrough of FDoge on Songbird! Anyone who wants to better understand minting + redeeming should watch this.👇","output":"Check out the FDoge video on Songbird! 🎥"},{"text_input":"6\/ @AceThaGreatest has this handle for a reason – his guide on the Flare DeFi ecosystem is comprehensive and perfect for those who want to dive into Flare DeFi.","output":"Flare DeFi guide by @AceThaGreatest is a must-read! 📚"},{"text_input":"5\/ What are the different ways to add to your $FLR stack? Our friend @kikubo from the Flare JP 🇯🇵 community breaks it down for you in this well-researched thread. 🧵","output":"Add to $FLR stack via staking, trading, or rewards. 🔥"},{"text_input":"4\/ Tier 2 Hats off to @itzbanknotez with their creative strategy on how to leverage the Flare ecosystem:","output":"Creative Flare strategy by @itzbanknotez! 🎩"},{"text_input":"3\/ Tier 2 Cheers to @BrukerikkenavnJ! Thank you for the Friday good vibes and for the continued support.","output":"Thanks for the support, @BrukerikkenavnJ! 🎉"},{"text_input":"2\/ Tier 2 A round of applause for @nes_campos 👏 We loved your video tutorial on FTSO delegation; it was easy to follow.","output":"Great FTSO delegation tutorial! 👏"},{"text_input":"1\/ Tier 1 Award Congrats to @danemon8038 for claiming the top spot! Your submission blew us away with its cute and cuddly aesthetic ✨","output":"Congrats @danemon8038! 🏆 Cute and cuddly win!"},{"text_input":"Flare's community creativity strikes again! Week 2 creative bounties champions have been crowned! 👑 Did your favorite creator make the podium?","output":"Flare's Week 2 winners announced! 🎉"},{"text_input":"Support Flare Data Connector to be added to mainnet! Vote on Jan 28 - Feb 3 ⤵️ FDC brings verifiable external data to @FlareNetworks, powering interoperability use cases like FAssets ☀️ Data providers, take time to review and get ready to participate.","output":"Vote for FDC on Flare! 🌟"},{"text_input":"5\/ Try now! Click 'How it works' on the minting platforms to learn more. Redeem and win now—there are a few days to maximize your chances to win up to $100,000 in prizes 🔥 &gt; &gt;","output":"Win up to $100K! Redeem now! 💰"},{"text_input":"4\/ Redeem to earn lottery tickets: No. of Tickets = Redemption Lot Size × Reward Multiplier Example: Redeem 1 lot of FDOGE at 20x multiplier = 20 tickets Redemptions from Jan 13 onwards earn tickets if requirements are met. Check your ticket count on minting platforms 👇","output":"Earn lottery tickets by redeeming FDOGE! 🎟️"},{"text_input":"3\/ Lottery The lottery rewards participants who redeem FAssets when total minted lots exceed 75% of the total lot capacity for each FAsset. There will be 50 prizes available: • 1st Place: $10,000 USD in rFLR • 2nd to 49th Places: Each receives $400 USD in rFLR 🍀","output":"Win big! Redeem FAssets & join the lottery! 🍀"},{"text_input":"2\/ Incentives To make testing more rewarding, there is a $260K prize pool, with around $37,000 in rFLR distributed every 2 weeks. To encourage users to redeem FAssets, 80% of the incentives are dedicated to this purpose. The lottery system adds an exciting dynamic ⚡","output":"$260K prize pool for testing! 🎉"},{"text_input":"1\/ Recap After the successful open beta on Coston, we launched the Songbird test for FAssets on Dec 18. Within a month, $XRP and $DOGE were added, with FXRP consistently 100% minted due to high demand. This new feature aims to boost much needed redemptions to free up more…","output":"FAssets test on Songbird: $XRP & $DOGE added! 🚀"},{"text_input":"In a few days, some of you will receive the third batch of FAssets Songbird test rewards. A new feature has been introduced: a lottery system to make supporting FAssets even more fun 🎟 Here's how the lottery works:","output":"FAssets Songbird rewards lottery is here! 🎟"},{"text_input":"Watch the full interview with @tokenpost: Tweet inspired by our amazing community @ksw54548 .","output":"Check out our interview! 🎥 #CommunityLove"},{"text_input":"What can you do on @FlareNetworks? Borrowing, lending, swapping, earning yields in DEX pools, trading futures\/perps, liquid staking, delegating, staking, voting, empowering your XRP, BTC, and DOGE with FAssets... This isn’t the future; it’s happening now.","output":"DeFi on Flare: borrow, lend, stake, trade! 🚀"},{"text_input":"@2lambro @Kinetic_Markets @SceptreLS Best yields for ETH and stables on Flare 🫡 Thanks @2lambro!","output":"ETH & stable yields on Flare are top! 🚀"},{"text_input":"@Anubis666Crypto @spintax2 @BrukerikkenavnJ Yes, a Flare mascot please.","output":"Flare mascot coming soon! 🎉"},{"text_input":"Say hi to our team: careers@flare.network Get paid for being creative:","output":"Join our creative team! 💡"},{"text_input":"Keep building. We’ve got your back with fresh brews, grants, and good data ☀️ Next up: EthOxford EthDenver And more brewing for the Bay Area 🔜","output":"Building with support: brews, grants, data! ☀️"},{"text_input":"@FreediverCrypto @cyclofinance 👏 We're so lucky to have you in our community!","output":"Welcome to the crypto community! 🚀"},{"text_input":"@routescan_io @Infrablix @SuperchainEco @avax @bobanetwork @Optimism good data is great","output":"Great data insights! 📊"},{"text_input":"There's got to be a better way to speak the Flare language. Created something cool? We've got a prize for you. Think you can bring this creativity (and many more) skills to help Flare grow? We're hiring. Check our bio @FlareNetworks","output":"Join Flare Networks! 🌟 We're hiring creative minds!"},{"text_input":"@spintax2 @Burstnodes @Danrocky Keep it real and conversational ✊🏻","output":"Stay genuine and friendly! ✊🏻"},{"text_input":"@Dogecoinride Wow this is an interesting one, thank you for having us! If doge fam wants to do an engaging space with us, hit us up 🤙🏻","output":"\"Excited for a collab with Doge fam! 🚀\""},{"text_input":"*Correction: ✅ Ensure 'Number of Passes' is at least 1. Best providers have up to 3 passes, with 3 being the maximum. How it works: When a provider meets the minimum requirements in a reward epoch, they gain a pass. Providers can hold a maximum of 3 passes.","output":"Max 3 passes for top providers! 🚀"},{"text_input":"To uphold data integrity, we're implementing an effective incentive structure to promote active participation from data providers in 2 weeks☀️ Check our new tool before delegating\/staking: ✅Look for 3+ passes ✅\"Eligible for Rewards\" status Learn more","output":"New incentives for data providers in 2 weeks! 🌟"},{"text_input":"Meme x utility is no longer a marketing gimmick Over 197K $DOGE has been bridged to Songbird 30% of bridged $DOGE now earning 10% APY From 'much woof' to 'much yield' 🐶📈 @dogecoin utility\/acc","output":"DOGE earns 10% APY on Songbird! 📈"},{"text_input":"@JohnEDeaton1 @HugoPhilion Thanks for the kind words, John. Yes, we are; Flare is unique, and we must tell and show the world.","output":"Flare is unique; let's show the world! 🌟"},{"text_input":"@wrappedxyz @BTC_OS @Aptos @PythNetwork @wormhole @agoric @Stacks @StellarOrg ☀️","output":"Crypto networks and projects shoutout! 🚀"},{"text_input":"Join @HugoPhilion, @spintax2 and @Dogecoinride for: 💡 What are FAssets? 🐕‍🦺 A closer look at $FDOGE on Songbird 🌟 DOGEfi's future with @FlareNetworks Jan 21, 5PM UTC. Set reminder, see you soon!","output":"FAssets & $FDOGE on Songbird, Jan 21, 5PM UTC! 🌟"},{"text_input":"6\/ Here are more guides for you: Open a position: Close: SparkDEX Telegram: Find the rest in their channel 🤝","output":"Explore SparkDEX guides on their Telegram! 🤝"},{"text_input":"5\/ Want to see how it works in action? @SparkDexAI Eternal brought TRUMP\/USD market to Flare!","output":"TRUMP\/USD now live on Flare via @SparkDexAI! 🚀"},{"text_input":"4\/ Risks • Small adverse price movements can trigger margin calls &amp; forced liquidations • Requires understanding of leverage, funding rates &amp; risk mgmt • Higher leverage ⇑ vulnerability to market swings • Leverage magnifies both gains &amp; losses","output":"Leverage boosts gains & losses. Handle with care! 📉📈"},{"text_input":"3\/ Leverage Leverage in perps trading: • Amplifies market exposure • Allows control of larger positions with less capital • Capitalizes on small price movements • Increases both potential profits and losses","output":"Leverage boosts gains & risks in trading! 📈"},{"text_input":"2\/ Shorting Shorting with perps allows traders to bet against an asset's price. If prices drop, traders can close positions at lower prices and profit. This strategy offers: • Gains during market downturns • Portfolio hedging to offset potential losses on long positions","output":"Bet on price drops with perps! 📉"},{"text_input":"1\/ Perps Perpetual contracts, or \"perps,\" are powerful financial derivatives in DeFi that allow traders to speculate on asset prices without holding the underlying asset. Unlike traditional futures, perps have no expiration date, offering indefinite position holding.","output":"Perps: Trade assets without owning them! 📈"},{"text_input":"Congratulations to @SparkDexAI on opening a perpetual futures market for TRUMP\/USD! Here's a breakdown of what perps are, highlighting short selling, leverage trading, and associated risks 🧵📌","output":"TRUMP\/USD perps now live! 📈"},{"text_input":"TRUMP\/USD feed now live on @FlareNetworks &amp; Songbird ☀️ Price updates every block, typically 1-2 seconds. DApps can start building with it 🥊 Guide: Please read the risk section to understand the high volatility risk of this new feed.","output":"TRUMP\/USD feed live on Flare & Songbird! ⚡"},{"text_input":"@CommunityFlare Very nice🍰 It's clear that you're constantly upping your game in motion design too!","output":"Great work on the motion design! 🎨"},{"text_input":"The FTSO is built differently. Enshrined in @FlareNetworks, secured by ~100 data providers with +60% $FLR staked. 1.8-second reliable feeds enable platforms like SparkDEX perps to calculate funding rates precisely and execute liquidations efficiently. IYKYK ☀️","output":"FTSO: Fast, secure data for DeFi on Flare. ☀️"},{"text_input":"@HideIttInMySock Yes, the FAssets beta retroactive airdrop will be distributed after the FAssets release on the Flare mainnet, as announced on October 10, 2024.","output":"FAssets airdrop post-mainnet release! 🚀"},{"text_input":"🔥 $TRUMP is making waves! Flare Foundation is adding the TRUMP\/USD feed to FTSO on Flare mainnet. Anchor and block latency feed inclusion begins tomorrow. Once live, this feed opens the door for potential integration into @FlareNetworks dApps.","output":"TRUMP\/USD feed joins Flare mainnet! 🚀"},{"text_input":"6\/ Resources: a. Where to find the active pools &amp; APYs? b. Songbird test incentives guide: c. What is rFLR: d. Flare Telegram (where you'll find the OGs to help):","output":"Explore Flare resources & join the Telegram group! 🔥"},{"text_input":"5\/ Withdraw partially or all? Since locked rFLR earns monthly FlareDrops, maximize withdrawal by waiting for full vesting (12 months).","output":"Wait 12 months for max FlareDrops! 💰"},{"text_input":"4\/ Can you claim the 768 rFLR now? Yes, but you won't receive the full amount. Early withdrawal of vesting rFLR comes with a 50% discount. After clicking \"Withdraw all\", in this case, 384 WFLR is sent to the test wallet.","output":"Claim 768 rFLR now, get 384 WFLR. 💸"},{"text_input":"3\/ 💡 rFLR vests linearly over 12 months, with 1\/12 claimable and withdrawable as WFLR monthly from the Portal. In this example, out of 1332 WFLR, 564 has completed 5 months of vesting and can be fully withdrawn. 768 WFLR is still vesting. Note that the WFLR accrues FlareDrops…","output":"Vesting WFLR: 564 claimable, 768 still vesting. 💡"},{"text_input":"2\/ Here's how to claim rFLR: Go to the portal's emission tab, select the project you contributed to, and check for new rewards to claim. Your rewards will show in your ➤ WFLR balance. Click 'Claim' to see the withdrawable amount in ➤ Available funds. Then withdraw to your…","output":"Claim rFLR via portal's emission tab! 💰"},{"text_input":"1\/ What is rFLR? rFLR, or reward FLR, are tokens you receive for participating in selected DeFi actions on @FlareNetworks or redeeming FAssets during Songbird testing. You can withdraw them as wrapped FLR (WFLR) to your wallet for trading.","output":"Earn rFLR for DeFi actions on Flare! 🚀"},{"text_input":"Hey, you may have gotten some rFLR lately! To check how much you've got, visit and click the \" Emission \" tab. Now, let's help you claim them 🧵","output":"Check your rFLR under the \"Emission\" tab! 💡"},{"text_input":"@Dogecoinride Lowkey thinking about doing a space in a few days with @Dogecoinride...","output":"Planning a Dogecoin space soon! 🚀"},{"text_input":"DeFi, reimagined. Flare Fair, your one-stop hub for new experiences and prizes. Opening doors soon.","output":"Flare Fair: New DeFi experiences await! 🚀"},{"text_input":"Flare Emissions Committee Quarterly Report 🔖 During the last quarter, the Flare Emissions Committee allocated rewards to dApps to continue bootstrapping liquidity on @FlareNetworks. The following dApps distributed rFLR during this period: ▸@SparkDexAI ▸@blazeswapdex…","output":"Flare rewards dApps for liquidity boost! 🔥"},{"text_input":"@Anubis666Crypto Big congrats to all ☀️ We appreciate everyone's creativity and enthusiasm in showcasing Flare. Remember, the bounty runs for 3 more weeks, with new winners every week. Keep submitting your creative work for a chance to win part of the $10,000 in FLR prize pool:…","output":"Win weekly in Flare's $10K FLR bounty! 🌟"},{"text_input":"@Anubis666Crypto As we share the results of the creative bounty, we want to clarify that the Flare team does not endorse the messaging or claims presented in the winning submissions. These works are creative interpretations by participants and do not necessarily reflect the views or opinions of…","output":"Creative works, not Flare's views. 🎨"},{"text_input":"And finally, here's @Anubis666Crypto's piece on uniting the Flare community. We are always grateful any time a community member shares their thoughts with us through constructive feedback. Build together, grow together.","output":"Building unity in the Flare community! 🤝"},{"text_input":"@DieCsHamburg @XRP_FLR_SGB @Kinetic_Markets @BroemmelsiekGtr If you like Flare and XRP, peep @nes_campos' submission about XRPFi within the Flare ecosystem. (Hint: FAssets) Well-researched and digestibly written!","output":"Check out XRPFi in Flare! 🔍"},{"text_input":"@DieCsHamburg @XRP_FLR_SGB @Kinetic_Markets 🔊 Volume ON for @BroemmelsiekGtr, who wrote an original song for this week's bounty submission! This is going on the playlist. PS - we thought your vocals were great!","output":"Great vocals on the new track! 🎶"},{"text_input":"@DieCsHamburg We smashed that 👍🏻 button for @XRP_FLR_SGB's video tutorial series on how to use @Kinetic_Markets and claiming rFLR! We appreciate your dedication to making educational content for the Flare community.","output":"Great tutorial on using Kinetic Markets! 👍🏻"},{"text_input":"Our final Tier 2 winner is the first of two songs awarded a bounty this week. Thanks to @DieCsHamburg for the smooth beat. See you at the Flare party!","output":"Congrats to our Tier 2 winner! 🎉"},{"text_input":"Next, we have @FreediverCrypto, who shared a very interesting DeFi leverage flow on how to go from the Flare blockchain to tangible goods using @cyclofinance. Nice presentation! Quick and to the point, showing how you can dive into an innovative dapp right away!…","output":"DeFi leverage flow from Flare to goods! 🚀"},{"text_input":"🥈 Coming in at the second prize tier, we have @xrpen15’s very sleek FAssets rewards analytics interface. This submission showcases profitability margins for participation in the Songbird FAssets tests. The attempt to use live price data from the FTSO to analyze the incentives…","output":"FAssets analytics interface wins 2nd prize! 🥈"},{"text_input":"🥇 @CommunityFlare breaks down the Flare tech stack into a clear and compelling narrative highlighting the game changing nature of decentralized bridging and the opportunities it unlocks for BTC, XRP, DOGE, and more. The motion graphic is top-notch as well!","output":"Flare tech: Decentralized bridging for BTC, XRP, DOGE 🚀"},{"text_input":"First week of @FlareNetworks’ Creative Bounty is a wrap, and the winners are in 👊🏻 Check out the winning submissions and see how we collectively prove the Flare energy 💥🧵","output":"FlareNetworks' Creative Bounty winners announced! 🎉"},{"text_input":"@BroemmelsiekGtr @HugoPhilion Securely explore XRPfi, BTCfi, and DOGEfi? We can't wait to hear the whole band together once your wife is back :)","output":"Excited for the crypto jam session! 🎶"},{"text_input":"Demand for FAssets is real. Agents are raising the minting collateral ratio now to cool down the minting. Redeeming and getting back your $XRP and $DOGE is helpful and earns you rewards too 👍🏻🫡","output":"Minting FAssets is hot! Redeem for rewards! 🚀"},{"text_input":"@XRP_FLR_SGB @Flare_Labs @CommunityFlare @Danrocky @TsoAtlas @aucc_official @Oracle_Daemon @BifrostWallet @nortso Thanks for the feedback! Sharing this with @Flare_Labs 🫡","output":"Thanks for the feedback! Sharing with @Flare_Labs 🫡"},{"text_input":"@kikubo And thanks for offering the help too! Your local insight could be invaluable in connecting us with the Japanese community. Let us know if you'd like to discuss further.","output":"Thanks for your help! Let's connect soon! 🇯🇵"},{"text_input":"@kikubo Hey @kikubo, thanks for catching that. We're committed to multilingual support, and the Japanese version is now back up at the link:","output":"Japanese version is live again! 🇯🇵"},{"text_input":"@defi_gal @CommunityFlare @HugoPhilion @dineshkpinto @0xMichaelC @AnnamarieJ708 This is quite a nice one-pager! Thank you so much @defi_gal","output":"Great one-pager! Thanks, @defi_gal! 🙌"},{"text_input":"4\/ The FAssets Songbird Test is dynamic, with all participants contributing their time and efforts to test and improve the system in every possible way. These tests will help us deliver a product we can all be proud of ☀️ Learn more about FAssets and the Songbird Test:…","output":"Testing FAssets on Songbird for improvements! ☀️"},{"text_input":"3\/ Helpful tips: 🟧 Minting and redeeming FDOGE might take longer (approximately 1 hour) due to Dogechain's block confirmation time. Don't worry, you'll receive live updates during the process. 🟧 Before testing, if you had connected the wallets before with the minting…","output":"Minting FDOGE takes ~1 hour. ⏳"},{"text_input":"2\/ Have you tried FXRP in the Songbird Test already? If so, you're a veteran 👏 Several adjustments are being implemented to help more users test the system. Read on to learn more: 1️⃣ Dynamic agent minting collateral ratio (CR): When too many FDOGE or FXRP are being minted,…","output":"Testing FXRP on Songbird? You're a pro! 🚀"},{"text_input":"1\/ The second FAsset is in - welcome, $DOGE and the @Dogecoin community to Songbird. Mint, trade, and get rewarded: &gt; &gt; Spark DOGEfi with FAssets today 💥","output":"DOGE joins Songbird! Mint & trade now! 🚀"},{"text_input":"@Oldincrypto127 @enosys_global @blazeswapdex We understand mainnet launch is highly anticipated, and we're thankful for that. However, each FAsset represents a unique system with its own contracts, parameters, and market dynamics, which means that FAssets cannot be thought of as a single system. Therefore, each FAsset…","output":"FAssets are unique, not a single system. 🚀"},{"text_input":"FDOGE is about to hit FAssets on Songbird! Bridging $DOGE to Songbird (Flare's canary network) for FDOGE? ✅ Depositing it into juicy DEX pools on @Enosys_Global and @BlazeSwapdex? ✅ Some key differences of FDOGE from your FXRP adventures: ∙ Minting and redeeming might take…","output":"FDOGE hits Songbird! Bridge $DOGE for FDOGE! 🚀"},{"text_input":"Community casually started collectively explaining FDC, where everyone’s genuinely focused on supporting each other and building a complete understanding together. Could there be a more authentic and organic form of community-driven marketing?","output":"Community-driven marketing at its best! 🌟"},{"text_input":"@iMustBeNewLOL No, but very soon. We're looking at requesting proof submissions from attestation providers on mainnet this week.","output":"Proof submissions on mainnet coming soon! 🚀"},{"text_input":"@xrpen15 @HugoPhilion Wonderful feedback. We need to work harder on educating people about FDC, step by step..","output":"Educating on FDC is key! 📚"},{"text_input":"Flare Data Connector (FDC) is an underappreciated enshrined oracle of @FlareNetworks. It is not a price oracle, it brings verifiable data proofs from external chains and real-world events to the network. What can it enable? 1️⃣ Enhanced economic security for XRP staking,…","output":"FDC boosts security with real-world data! 🔗"},{"text_input":"🚨The second batch of Songbird Test incentives is now claimable on the Flare Portal's \"Emission\" tab. As we enter the 5th week of Songbird testing, several adjustments are being implemented, such as dynamic agent minting fees and revised redemption bonuses. The changes to the…","output":"Claim Songbird Test incentives on Flare Portal! 🚀"},{"text_input":"Thanks for the great interview, @tokenpostkr. Give them and @FlareNetworksKR a follow, as they'll be sharing the full interview too!","output":"Follow @tokenpostkr & @FlareNetworksKR! 📢"},{"text_input":"Last month, Flare Foundation shared a Request for Proposal to develop a staking and liquid staking protocol for XRP, Bitcoin, and Doge. We've received high-caliber builder proposals and are currently conducting detailed technical evaluations with promising implementation…","output":"Evaluating top proposals for XRP, BTC, DOGE staking! 🚀"},{"text_input":"What have you planned today? How about being creative with Flare, crafting: 🎥 Tutorials, Explainers &amp; memes 🐦 Blogs &amp; threads 📊 Infographics &amp; demo apps and win from a $10,000 prize pool?","output":"Create with Flare & win from $10K prize pool! 🎨"},{"text_input":"Just facts — 2024, some milestones at @FlareNetworks: 1\/ Rolled out FTSOv2 on mainnet with significant improvements: Block latency updates (1.8s) which can support 1,000 price pairs. 2\/ Successful launch of the Flare Data Connector (FDC) on Songbird. FDC brings verified…","output":"FlareNetworks: FTSOv2 & FDC launched! 🚀"},{"text_input":"What if there was a new place where Flare DeFi came with a splash of fun?","output":"Flare DeFi: Fun meets finance! 🎉"},{"text_input":"6\/ A heartfelt thank you to all our incredible applicants! While we could only select a few this time, the journey doesn't end here. More opportunities are on the horizon as our ambassador program continues to grow. Stay tuned for the upcoming @encodeclub x Flare Educate Series…","output":"More chances ahead! Stay tuned for updates! 🚀"},{"text_input":"5\/ And finally, say hello to Anantabh 👋🏻 Anantabh is an enthusiastic developer fascinated by the ideas of decentralization and novel financial systems. He firmly believes that modern technology should be built sustainably to benefit everyone and that the next step for this world…","output":"Hello Anantabh! 🌍 Embrace sustainable tech!"},{"text_input":"4\/ Next, meet Kaushtubh 👋🏻 Kaushtubh is passionate about blockchain and has been actively contributing to the space for over a year. He has delivered impactful projects while continually exploring unique protocols and ecosystems, recently winning at ETHglobal Bangkok. Welcome,…","output":"Kaushtubh wins at ETHglobal Bangkok! 🎉"},{"text_input":"3\/ First up is Antoine 👋🏻 A passionate full-stack developer with a strong background in pharmacy, who leverages blockchain technologies and JavaScript. Antoine is also a confirmed Solidity Jedi , with expertise that will bring so much value as we…","output":"Antoine: Full-stack dev & Solidity Jedi! 🚀"},{"text_input":"Continuing the celebration 🎉 Meet our three @FlareNetworks Developer Ambassador founding members who’ll drive innovation with unique skills and passion to help shape Flare’s future ecosystem. Exciting journey ahead! 🧵","output":"Flare's future: innovation with new ambassadors! 🚀"},{"text_input":"What stories can you tell about @FlareNetworks? Be educational and inspiring ✨ Share your creativity for a chance to win a piece of the $10,000 FLR prize pool, distributed weekly! Join the fun before February 7: @bountybot","output":"Join @FlareNetworks for a chance to win! 💰"},{"text_input":"Two years ago, over 4 billion FLR landed in your hands, igniting the @FlareNetworks journey ☀️ We’ve achieved together: • 11 proposals voted • 6.97B staked • 24.95B delegated Preparing something nice for you… Stay tuned 👨🏻‍💻🎪","output":"Flare's journey: 11 votes, 6.97B staked, 24.95B delegated! 🌟"},{"text_input":"When bridging, transparency isn’t just nice — it’s essential. With FAssets, you’ll see: •Who provides collateral •What assets back it •Exact collateral amounts All of this, directly on-chain. Here's how to read it 👇🏼","output":"On-chain transparency with FAssets! 🔍"},{"text_input":"If you're building on @FlareNetworks, one key advantage you can enjoy is the free data feeds from our enshrined oracle FTSO. Live workshop on how it works and how to integrate it in 2H:","output":"Free data feeds from FTSO on Flare! 📊"},{"text_input":"Competition drives innovation, and Flare is full of innovation. We come with our own set of unique offerings, from building a robust network with a rapidly growing DeFi ecosystem, to bringing FAssets on mainnet and enabling native staking for XRP, BTC, and DOGE, and spearheading…","output":"Flare: Innovating DeFi with FAssets & staking! 🚀"},{"text_input":"@ClearpoolFin @avax @base @VelodromeFi @LayerZero_Core @Hex_Trust @ethena_labs @SolvProtocol @Synnax_ai @Polytrade_fin It has been great teaming up with you!","output":"Great collaboration! 🚀"},{"text_input":"Many want Instagram or X to run on-chain, but overlook the infrastructure limitation. Rich data and complex compute deliver this. Locked in.","output":"On-chain apps need better infrastructure! 🔗"},{"text_input":"2\/ More context: FTSOv1 was already deprecated on Songbird, Flare's canary network, in November 2024. This deprecation is the final step in the changes needed for the v2 transition. Learn more about FTSOv2 here:","output":"FTSOv1 deprecated on Songbird. Transition to v2! 🚀"},{"text_input":"1\/ 🚨 FTSO Update: V2 Transition Complete 🚨 FTSOv1 is now officially deprecated on the mainnet! Delegators, claim your rewards before Jan 10 or they'll be burned. 3.6M FLR are waiting. Claim on or via the wallets with which you delegated.","output":"Claim FLR rewards by Jan 10! 🔥"},{"text_input":"Interested in using Flare Time Series Oracle but find the doc at overwhelming? Join the workshop and get your questions answered directly by or dev rel lead @j00sko 🔔","output":"Join our Flare workshop for direct Q&A! 🔔"},{"text_input":"@Pa45252666 Staked FLR is eligible for FlareDrops without requiring additional actions.","output":"Earn FlareDrops with staked FLR! 🚀"},{"text_input":"With Flare, you don’t just hold, you compound. - FTSO delegation: Every 3.5 days - Staking: Every 14 days - FlareDrops: Every 30 days - rFLR DeFi rewards: Every 30 days @FlareNetworks makes your journey rewarding ☀️","output":"Compound rewards with Flare! ☀️"},{"text_input":"Tx hash: 0xf0caff8999149577d4c6b395ea5a0a943676330bf12008b8f1ce7d3772988e0a FlareDrop + FLR burn = a lovely warm day to say thank you to our community 🌈 In 2025, we’ll keep finding ways to support greater network participation and benefit you.","output":"FlareDrop & FLR burn: Thanks to our community! 🌈"},{"text_input":"It's 💧 time. FlareDrop.23 is claimable! Snapshots taken at 34,757,216 \/\/ 35,170,691 \/\/ 35,405,192 Reward rate: 2.57 per 100 FLR Claim it before they're burnt (67days) 🔥","output":"Claim your FlareDrop.23 now! ⏳"},{"text_input":"Ambassadors kickoff @encodeclub incubator Virtual workshops Hackathon — all for builders in just 1 month. At this rate, we can expect bootcamps, on-ground meetups, parties, and maybe a chance to join the Flare team very soon ☀️ Who’s in?","output":"Builders unite! Join @encodeclub events now! 🚀"},{"text_input":"Oracles allow for the automation of contract execution based on on-chain and off-chain data without human intervention, which is a core promise of smart contracts. Are you building? Choose your oracle wisely.","output":"Choose the right oracle for smart contracts! 🔮"},{"text_input":"All @Dune bounties have been distributed 🫡 Congrats again to all the winners. If you haven’t already, check out the great work they’ve done below! We’re working on our next bounty – something many of you can join 🔜","output":"Dune bounties distributed! New one coming soon! 🚀"},{"text_input":"@routescan_io @HugoPhilion @flarescan_com @CommunityFlare Great thread!","output":"Thanks for sharing! 🚀"},{"text_input":"@FlothOnFlare We don’t disagree. However, to stay competitive in the industry and attract wide participation—especially for something as crucial as testnet development for FAssets—we need to offer incentives. That said, we have always appreciated those who dedicate their time and effort to…","output":"Incentives boost testnet dev for FAssets! 🚀"},{"text_input":"Why is @Flare_Labs developing FAssets? This initiative aims to allow tokens like BTC to participate in DeFi in a trustless manner. Understand the bridging challenge for BTC:","output":"BTC in DeFi, trustless bridging! 🚀"},{"text_input":"Happy birthday, Bitcoin ₿ You deserve to enjoy a DeFi summer in 2025 while staying true to the principles of decentralization 🍊","output":"Bitcoin's future: DeFi summer 2025! ₿"},{"text_input":"@postofficeguy ETH from Ethererum and most of its L2s can be bridged to Flare as WETH via @StargateFinance.","output":"Bridge ETH to Flare via Stargate! 🚀"},{"text_input":"Over 4.4M USDC.e, 3M USDT, and 989.19 WETH have been bridged to @FlareNetworks! Did you bridge? If so, don’t miss out on Flare DeFi incentives. A new rFLR rewards epoch has just started ☀️ Learn more:","output":"Join Flare DeFi for new rFLR rewards! ☀️"},{"text_input":"It's the perfect time to learn something new! Join @j00sko's builder workshop on @FlareNetworks' enshrined oracle, FTSO. Hands-on tutorial, live Q&amp;A, and Flare merch giveaway 👋 Jan 8th, 2 PM UTC:","output":"Join @j00sko's FTSO workshop on Jan 8th! 🛠️"},{"text_input":"@Cryptonaut_01 Each FAsset is its own set of contracts, parameters and supply and demand market, which means that FAssets cannot be thought of as a single system. Therefore, each FAsset needs to be tested on Songbird. Once the FDC is launched on Flare and when an FAsset has been tested on…","output":"Test each FAsset on Songbird before Flare launch. 🚀"},{"text_input":"Currently, you can mint, redeem FXRP and provide SGB as collateral using these sites during the Songbird test:","output":"Mint, redeem FXRP & use SGB on Songbird! 🚀"},{"text_input":"This New Year, make your $XRP work harder 🔥 Bridge XRP to Songbird (and soon Flare) to unlock staking, yielding and lending, all with unmatched security through overcollateralization. The Songbird test is live with ~70K FXRP circulating. 👉 Redeem now to let others test this…","output":"Bridge XRP to Songbird for staking & lending! 🔥"},{"text_input":"Pretty happy with our media coverage last year, but we know we can do even better. What are some genuine and valuable media outlets for @FlareNetworks to connect with in 2025?","output":"\"Top media outlets for 2025? Let's connect! 📈\""},{"text_input":"On this first day of 2025, we want to express our gratitude for a team that values authentic and resilient development, along with the strong support of our community. We’re committed to giving our best in 2025 ☀️","output":"Grateful for our team's growth and community support! 🌟"},{"text_input":"@Danrocky Thank you Dan for the wonderful year of 2024. Without you, the Flare community will not be the same! To a great 2025 ☀️","output":"Cheers to Dan and the Flare community! 🎉"},{"text_input":"@DieCsHamburg Here’s to crafting our own stories of growth, joy, and success in 2025 🥂","output":"Cheers to our future stories in 2025! 🥂"},{"text_input":"@The_General_101 @HugoPhilion Thank you for your support! We wish you a great year too","output":"Thanks for the support! 🎉"},{"text_input":"Over 1.4 million rFLR has been distributed to more than a thousand addresses, worth over $37,000 🔥 If you’ve redeemed FXRP or used SGB as collateral, you may qualify for rewards! How to claim ↴ 1. Connect with @BifrostWallet on and select the Flare…","output":"Claim your rFLR rewards with Bifrost Wallet! 💰"},{"text_input":"@RasakAwwal @HugoPhilion rFLR rewards are for redeeming FXRP and providing SGB as collateral. They can be collected on","output":"Earn rFLR by redeeming FXRP & using SGB! 💰"},{"text_input":"@eyrockmusic @Iam_CrypticMind @HugoPhilion Note that rFLR can be earned simultaneously with monthly FlareDrops. rFLR vests linearly over 12 months, with 1\/12 claimable and withdrawable as WFLR each month from the Portal. Early withdrawal of unvested rewards incurs a 50% penalty. For maximum returns, wait for full vesting.…","output":"Earn rFLR monthly, vest over 12 months! 💰"},{"text_input":"@mycryptoplygrnd @rachelleskinner @SongbirdNetwork @Tuthman3 👍 More contexts: rFLR can be earned simultaneously with monthly FlareDrops. rFLR vests linearly over 12 months, with 1\/12 claimable and withdrawable as WFLR monthly from the Portal. Early withdrawal of unvested rewards incurs a 50% penalty. For maximum returns, wait for full…","output":"Earn rFLR monthly, avoid early withdrawal! 💡"},{"text_input":"@rachelleskinner @mycryptoplygrnd @SongbirdNetwork @Tuthman3 If you’ve chosen ‘withdraw’, it should appear as WFLR in your wallet.","output":"Check your wallet for WFLR! 💼"},{"text_input":"@HideIttInMySock @CommunityFlare A big shout out to @CommunityFlare indeed 👏","output":"Thanks for the shoutout! 🙌"},{"text_input":"@RodeoBabeUS Flare staking is technically more challenging than other operations on Flare, such as wrapping and delegating. There are many ways to use your FLR. Besides staking, you can also consider wrapping your tokens to qualify for FlareDrops and delegate to the FTSO data providers. If…","output":"Explore FLR: Stake, Wrap, Delegate! 🚀"},{"text_input":"@iluvsheep3 That’s the plan! Currently, XRP holders can bridge their XRP to Songbird as FXRP using the FAssets system, allowing them to earn yields and rewards. For more details, check out our recent posts about FAssets.","output":"Earn yields by bridging XRP to Songbird! 🚀"},{"text_input":"Imagine it’s your first interaction with @flarenetworks —what would you do? Where would you go? Let’s share some $FLR tips to welcome newcomers into the Flare family as we enter the new year ☀️ 💫","output":"Explore Flare's website and join the community! 🌟"},{"text_input":"@XRP_FLR_SGB rFLR will soon be claimable on the Flare Portal. DEX pool rewards will be airdropped by Enosys and BlazeSwap.","output":"Claim rFLR soon on Flare Portal! 🚀"},{"text_input":"@XrpTom Retroactive airdrop for Open Beta will occur — All participation data has been captured, and the distribution script is a work in progress.","output":"Open Beta airdrop coming soon! 🚀"},{"text_input":"Flare starts with FAssets, and it’s exciting to be on the verge of coming full circle. That’s not all; @HugoPhilion summarized the key events of @FlareNetworks in 2024, covering technical achievements and ecosystem expansion. 2025 has only one direction to go: FORWARD ➡️","output":"Flare's future: growth and innovation! 🚀"},{"text_input":"In the next few days, we will begin distributing the first batch of rFLR rewards for the FAssets Songbird Test ☀️ Approximately $37,000 in rFLR is planned for distribution! rFLR Reward Allocation • 80% of the rewards will be allocated to participants who redeem FAssets when…","output":"$37K rFLR rewards coming soon! 🎉"},{"text_input":"Perp DEX has arrived at @FlareNetworks! We are looking at you, @SparkDexAI Eternal 👀 Perpetual contracts, or \"perps,\" are among the most traded derivatives in the crypto space. But what are they exactly? What are the advantages and risks? Learn about it in the latest 101:…","output":"Perp DEX on Flare: Trade crypto derivatives! 🚀"},{"text_input":"5\/ Method 2️⃣ a. Swap bridged USDC.e\/USDT for WFLR on one of the participating DEXs. b. Deposit WFLR on Sceptre to mint the sFLR liquid staking token. c. After sFLR is minted, deposit sFLR on Kinetic when it goes live. Users lending assets can borrow other assets against their…","output":"Swap USDC.e\/USDT for WFLR, mint sFLR, deposit! 🚀"},{"text_input":"4\/ Method 1️⃣ a. Bridge USDC or USDT from another chain to Flare using @StargateFinance. •If this is your first time bridging to Flare and you have no FLR in your destination wallet, you will automatically receive a small amount to enable you to transact immediately on the…","output":"Bridge USDC\/USDT to Flare via Stargate. 🚀"},{"text_input":"3\/ You can experiment with various strategies across multiple dapps. Here are two example strategies:","output":"Try new strategies on dapps! 🚀"},{"text_input":"2\/ The program distributes rewards to participants who engage with DeFi protocols on Flare, such as @blazeswapdex, @Kinetic_Markets, @SparkDexAI, and @SceptreLS, with more protocols to come! By staking, lending, borrowing, or providing liquidity, users earn rewards in rFLR. This…","output":"Earn rFLR by engaging with DeFi on Flare! 🚀"},{"text_input":"1\/ It’s a 510 million FLR program designed to incentivize DeFi activities on @FlareNetworks.","output":"Flare's 510M FLR DeFi boost! 🚀"},{"text_input":"The Flare DeFi Emissions Program is still ongoing, but what exactly is it? 🧵👇","output":"DeFi rewards program on Flare Network. 💡"},{"text_input":"@FreediverCrypto View this here: When you point to a specific protocol, only that line will be displayed.","output":"View protocol details by pointing to a line. 📊"},{"text_input":"@hudspeth776761 @DecryptMedia Meanwhile, there are users who have managed to claim. Which wallet are you using? Did you add the Matic network? Feel free to send a DM so we can help you troubleshoot.","output":"\"Try adding the Matic network! 🛠️\""},{"text_input":"@hudspeth776761 This is a really good start! Video will only become increasingly important than ever. We love seeing our community skill up every day 👏","output":"Video content is key! Keep learning! 📹"},{"text_input":"FAssets transform $XRP, $BTC, and $DOGE into DeFi assets. Start using FXRP to earn yield on @enosys_global and @blazeswapdex today. Incentivized pairs (current live pairs highlighted)👇 Details:","output":"Earn yield with FXRP on Enosys & BlazeSwap! 🚀"},{"text_input":"@FutureISBrightG Thanks for remembering $FLR birthday! Keep an eye out for what we're going to do.","output":"Excited for $FLR's plans! 🎉"},{"text_input":"Exciting times ahead in 2025. With institutional adoption driven by ETFs, the next step is building the infrastructure for impactful applications. Offchain computing is set to be a fascinating area to explore 💡","output":"Offchain computing: the future of impactful apps! 💡"},{"text_input":"@alfydavy Currently, you can mint FXRP using this site during the Songbird test: You can also mint here:","output":"Mint FXRP on Songbird test site! 🚀"},{"text_input":"2025 will be the year for builders 🔥 Make the most out of this weekend by getting ahead while others are still having fun. 1️⃣ Deploy smart contracts on @FlareNetworks: 2️⃣ Sign up for @encodeclub x Flare Educate:","output":"Build in 2025: Deploy on Flare, join Encode Club! 🚀"},{"text_input":"Minting and redeeming are equally crucial parts of testing FAssets. Learn how to do both in under 2 minutes 👇","output":"Mint & redeem FAssets in 2 mins! 🚀"},{"text_input":"@SirCasticness @CommunityFlare @Flare_Labs @HugoPhilion This is a scammer. We're working on taking it down with @X support.","output":"Scammer alert! 🚨 We're on it with @X support."},{"text_input":"When it comes to staking FLR, did you know that besides the Flare Portal, you can: 1️⃣ Use @Ledger through the Flare app. 2️⃣ Stake via @BifrostWallet or @SolidiFiHQ wallets. 3️⃣ Use @MetaMask (it's back!) and @WalletConnect in the Flare Portal. Or stake FLR to get sFLR (LST)…","output":"Stake FLR via Ledger, Bifrost, MetaMask, or more! 🔥"},{"text_input":"Minting is just the start, but redeeming ensures you get your base assets back. For the Songbird test, redeeming also enables others to mint for further testing, leading to a better product and more rewards for you!","output":"Redeem to improve & earn! 🎉"},{"text_input":"Ever wanted to prove your knowledge of Flare and earn a certification for it? Well, now you can, thanks to @DecryptMedia. I. Introduction II. FTSO III. FAssets IV. FDC V. DeFi Opportunities on Flare VI. Flare Incentives Start now:","output":"Earn Flare certification with @DecryptMedia! 🚀"},{"text_input":"@hobbiesOne \"The whole system should run and settle in a fully permissionless way on the Flare Network and be able to secure a wide range of different protocols running on other networks connected to Flare with resolution for deterministic slashing being provided via FDC.\" Full details can…","output":"Flare Network enables secure, permissionless protocols. 🔗"},{"text_input":"@appcarcara1 @defidaddy23 @ClearpoolFin USDX is also listed on bitmart","output":"USDX is now on BitMart! 🚀"},{"text_input":"We'd like to see a liquid staking and restaking protocol for XRP holders, integrating both XRPL and Flare. Calling for proposals with a $500,000 fund. Deadline: Jan 15","output":"$500K for XRP staking proposals! Deadline: Jan 15 🚀"},{"text_input":"Warm wishes to all the Flare Family out there ☀️ Looking forward to an even more exciting and productive 2025!","output":"Excited for 2025 with the Flare Family! ☀️"},{"text_input":"Flare report is now also available in Japanese: Thank you @Tiger_Research_ ☀️","output":"Flare report now in Japanese! 🇯🇵"},{"text_input":"@vant_tnav @elovianoo_ Well deserved 👏🏻 Your dashboard is thorough and demonstrates a real understanding of the Flare rewards distribution system 🫡","output":"Great job on the Flare dashboard! 👏"},{"text_input":"@vant_tnav @elovianoo_ @hashed_official @abthelhaks @boristarandaa We will handle outreach and prize distribution on or after December 27th 🎁 Keep building and sharing insights about Flare: Stay tuned for upcoming bounties to showcase your skills in the @FlareNetworks ecosystem ☀️","output":"Outreach & prizes post-Dec 27! 🎁 #FlareNetworks"},{"text_input":"@vant_tnav @elovianoo_ Honorable mentions🪙 👍🏻 Great Overview + TPS tracking by @hashed_official ➡️ 👍🏻 Easy-to-Read overview by @abthelhaks ➡️ 👍🏻 Flare TXs comparison w\/major networks by @boristarandaa ➡️ 👍🏻 Flare's USDX in…","output":"Flare insights & comparisons by experts! 📊"},{"text_input":"Below are the most starred creations with the best ecosystem support 🫡 🥇 Great overview of Flare's rewarding schemes by @vant_tnav ➡️ 🥈 Good overview of FlareDrops by @elovianoo_ ➡️ 🥉 Best Flare ecosystem overview by…","output":"Top Flare ecosystem insights! 🌟"},{"text_input":"Context: Thank you to @bountycaster &amp; @ljxie for being the wonderful host. And big thanks to @insights4vc for building the great examples with the @SparkDEXAI, @SceptreLS and @Kinetic_Markets 🙏🏻🥉","output":"Thanks to all for the amazing collaboration! 🙌"},{"text_input":"Flare's data is now accessible at connecting us with you and @Dune wizards! 30 dashboards have collectively received 580 stars. 🤩 Now, let’s announce the winners:","output":"Flare's data shines with 580 stars! 🌟"},{"text_input":"Unlike traditional bridges, FAssets ensures security with not one, but THREE layers of collateral. Learn with the agents 🕶️","output":"Triple-layer security with FAssets! 🔒"},{"text_input":"Yesterday, one of the five agents, Atlas TSO (0x09..5Ccd), entered \"full liquidation.\" The reason has been identified, and the FAssets system, along with its checks and balances, functioned as intended. No funds were lost. Below is a detailed report on how this occurred. 1.…","output":"Atlas TSO liquidation: system worked, no funds lost. ✅"},{"text_input":"PSA: DeFi without decentralized data isn’t DeFi at all. Bring true DeFi to non-smart contract assets, starting with FAssets.","output":"True DeFi needs decentralized data! 🌐"},{"text_input":"Can I support these infrastructure providers too? Yes, you can! Over 70% of the circulating supply of FLR has been staked or delegated, earning rewards while supporting Flare. ☀️ See the list of IPs: Delegate\/stake tutorials:","output":"Stake FLR to earn rewards and support Flare! ☀️"},{"text_input":"Who are the other infrastructure providers on @FlareNetworks? These providers are independent entities; among the professional validators who joined us are @GoogleCloud, @stakecapital, and @encodeclub, along with experienced data providers from the community!","output":"Google Cloud, Stake Capital, Encode Club 🌐"},{"text_input":"Why is this approach better? It enhances network security &amp; data reliability! 1️⃣ Every IP contributes to every single feed, ensuring all data feeds share the same security guarantees, unlike the common practice of using a limited set of offchain nodes 2️⃣ Validators on Flare are…","output":"Enhanced security & reliability for all data feeds! 🔒"},{"text_input":"Flare’s IPs function as both validators and data providers. 1️⃣ Support network security as validators for Flare’s PoS consensus mechanism, proposing and validating new blocks on Flare. 2️⃣ Contribute to Flare’s native oracles as data providers.","output":"Flare's IPs: Validators & Data Providers 🔗"},{"text_input":"Welcome @StakeCapital to our network of infrastructure providers (IPs)! They are @FlareNetworks' data providers and also serve as validators. And you can support them! What does it mean?","output":"Welcome @StakeCapital as validators! 🚀"},{"text_input":"Flare Educate Series x @encodeclub is here! Starting Jan 20th, start coding on @FlareNetworks with this 4-week program - 8 sessions - Hands-on practice with enshrined oracles - Ecosystem pros teach you everything + hackathon &amp; incubator ☀️ Apply:","output":"Flare Educate Series: Learn & code with Flare! ☀️"},{"text_input":"@XRP_FLR_SGB @CommunityFlare @HugoPhilion @Danrocky Great video! @XRP_FLR_SGB That makes us think about creating a creative bounty for a helpful community like yours. @spintax2 thoughts?","output":"Creative bounty for helpful community? 🤔"},{"text_input":"👀 @Tiger_Research_ just released a paper on @FlareNetworks ! Eng: KR: Written by @0xyuns @yoonlee_tiger. Definitely worth reading.","output":"New paper on Flare Networks by Tiger Research! 📄"},{"text_input":"Build mode is ON at Flare 🟢 @TenderlyApp, an industry-leading solution for debugging, TX simulation, and production infrastructure has just integrated with @FlareNetworks. Start streamlining your dapp development today:","output":"Flare integrates with Tenderly for dapp dev! 🚀"},{"text_input":"Many are working on ethereum l2s, bitcoin l2s, or xrpl sidechains. None of them are tackling all three at the same time. We're building a liquidity hub that brings together multiple ecosystems","output":"Building a cross-chain liquidity hub! 🚀"},{"text_input":"☀️ Check out these 2 tutorials and get started! Dashboard overview: Mint and redeem: You can mint FXRP using this site during the Songbird Test: • Support Group: Let’s make the…","output":"Explore FXRP minting on Songbird Test! 🚀"},{"text_input":"2️⃣ rFLR Retro Airdrop A total of $260,000 in rFLR will be distributed bi-weekly! 20% of the rFLR will be allocated to collateral providers and 80% upon redemptions when utilization is past 75%. The more you redeem, the higher your rewards 📈","output":"Earn rFLR rewards by redeeming more! 💰"},{"text_input":"1️⃣ DEX Pool Incentives DEX pool incentives in $SGB will be provided by @Flare_Labs on @enosys_global and @blazeswapdex. 📊 Incentivized Pairs &amp; APR Targets below. The highlighted pairs are already live!","output":"DEX pool incentives live on Enosys & BlazeSwap! 🚀"},{"text_input":"You can find the full version in this blog: But if you'd like a TL;DR, keep scrolling...","output":"Check out the blog for the full story! 📖"},{"text_input":"Exciting news for the community🐦 The FAssets launch is bringing two types of incentives: • DEX pool incentives targeting 30 - 70% APR • $260K retroactive airdrop of rFLR Here's how to start 🧵","output":"FAssets launch: Earn 30-70% APR + $260K airdrop! 🚀"},{"text_input":"@XRPvalidators @collectionist FTSO rewards didn't stop. There are some changes in the distribution schedule because of the FTSO upgrade. Please refer to this post:","output":"FTSO rewards continue, check schedule update! 🔄"},{"text_input":"@PlasticDogs Thank you to everyone who supports us in the way you do! We're all making history ☀️","output":"Thanks for the support! We're making history! ☀️"},{"text_input":"Your $XRP can now sing a new tune 🐦 FAssets are LIVE on Songbird, @FlareNetworks' canary network, with the mainnet launch coming soon. Mint FAssets, explore DeFi, and be rewarded! Find out how to get started:","output":"FAssets live on Songbird! Explore DeFi & earn! 🎵"},{"text_input":"Last ecosystem call of the year — you can bet it’s going to be a good one. So much to unpack with @HugoPhilion @Arnno39 @0xAnna0 @Warlock_NKey &amp; Lex. Make sure to be there 👇","output":"Join the final ecosystem call of the year! 🎉"},{"text_input":"@MacroBrooks 🫶 And we can't stress enough that the main driver here comes from the support of the community, like yourself, @MacroBrooks. Thank you so much.","output":"Community support is key! 🙌"},{"text_input":"@aixbt_agent @XRPL_ART_WORK @aixbt_agent Just take a look at $FLR :)","output":"Check out $FLR! 🚀"},{"text_input":"🌀☀️ Cyclo is live on @FlareNetworks Experience liquidation-free leverage by locking @SceptreLS' sFLR to get cysFLR and unlock new trading strategies: Powered by FTSO, Flare’s enshrined oracle, @cyclofinance enables new DeFi opportunities while ensuring…","output":"Cyclo offers leverage on Flare with sFLR! 🚀"},{"text_input":"@splinter0n @cielbiru @TBukher @LAvbreht @_WaterAmi @dineshkpinto @timrowley_au @0xthanos @j00sko Great thread! 🫡","output":"Thanks for sharing! 😊"},{"text_input":"Thanks to @vant_tnav for the 🔥 dashboard! We look forward to seeing more data-driven insights on FAssets once they're live. Who is building the FAssets dashboard on @Dune?","output":"@vant_tnav is building the FAssets dashboard! 📊"},{"text_input":"More incentives coming. Simply by using $XRP to get FXRP and explore DeFi.","output":"Earn more with $XRP & DeFi! 🚀"},{"text_input":"It's starting to feel a bit more festive in here... Some wins to celebrate before 2025. Meet Flare's friends @SceptreLS, @Kinetic_Markets, and @SparkDexAI to see how @Dune visualized their milestones. Plus, @HugoPhilion will share updates on","output":"Celebrating milestones with Flare's friends! 🎉"},{"text_input":"\"We need good oracles in our ecosystem.\" Check out FTSO and FDC, the enshrined oracles of @FlareNetworks. What are enshrined oracles?","output":"Enshrined oracles are trusted data sources. 🔗"},{"text_input":"Love the vision for permissionless native staking and restaking $XRP? Building it solo might be tough, but remember, you're not alone. The Foundation can offer significant support 👇 plus a $500K grant.","output":"$XRP staking support & $500K grant available! 🚀"},{"text_input":"Flare is live on @Dune, but that's not all. We are offering a $6,000 bounty to reward data wizards 🧙🏻‍♂️. Submit via @bountybot or reply below 👇 Deadline: Dec 23 Get some ideas:","output":"Earn $6,000 for data insights! 🧙‍♂️"},{"text_input":"@Hercules_Defi Nice! Goal: Enable XRP holders to stake both their XRP directly on the XRPL and bridged XRP on Flare (FXRP) to secure various third-party services (oracles, layer 2s, bridges, etc.). Then expand to BTC and DOGE. ;) One month to go to submit your proposal at…","output":"Staking XRP on XRPL & Flare soon! 🚀"},{"text_input":"Learn what a Safe Smart Account is and how it benefits @FlareNetworks ecosystem partners:","output":"Safe Smart Account boosts Flare's ecosystem! 🚀"},{"text_input":"Flare 🤝 @palmera_dao From now on, Palmera brings Safe Smart Accounts to builders on @FlareNetworks. ▶️ Streamlined treasury management ▶️ Enhanced multisig security ▶️ Interoperability across 12+ EVM chains How's that for an extra level of security and DeFi?…","output":"Palmera enhances security on Flare with Safe Accounts! 🔒"},{"text_input":"Reminder that @FlareNetworks Blockchain Machine Images is already live on @GoogleCloud Marketplace. Developers can now: ✅Deploy full blockchain nodes in minutes for over 20 networks. ✅Run nodes cost-effectively without relying on external services.","output":"FlareNetworks nodes on Google Cloud! 🚀"},{"text_input":"Confirmed: FXRP on Flare - Highly Sought-After ✅ What's even better? Our offering is fully decentralized.","output":"FXRP on Flare: Decentralized and in demand! 🚀"},{"text_input":"@CompareNodes @ankr @envio_indexer @thirdweb @tatum_io @etherspot @QuickNode Good analysis! builders should take a look 👆","output":"Builders, check out this analysis! 👆"},{"text_input":"Get ready for the last workshop of the year! We will discuss all things oracles, a key offering of @FlareNetworks. To top it off, we're giving away a full set of Flare merch ☀️ Join today at 2PM UTC:","output":"Join our final oracle workshop today at 2PM UTC! ☀️"},{"text_input":"@DugagjinDD Bridge first then check our dex aggregator for the best swap route","output":"Bridge first, then find the best swap route! 🔄"},{"text_input":"Can you develop a liquid staking and restaking protocol that allows $XRP, $BTC, and $DOGE to be staked on their original networks and bridged to @FlareNetworks to secure various third-party services? If so, this $500K opportunity is for you to seize:","output":"Liquid staking for $XRP, $BTC, $DOGE? $500K awaits! 🚀"},{"text_input":"The first perp DEX on @FlareNetworks, fully backed by Flare Time Series Oracle, is here—welcome to @SparkDexAI Eternal☀️ Up to 100x leverage Automated conditional orders Smooth transactions across 12 chains Major crypto + commodities &amp; forex coming soon","output":"First perp DEX on Flare: SparkDexAI! 🚀"},{"text_input":"WFLR unlocks the fun on @FlareNetworks ☀️ Don't let your $FLR sit still. Use 1-click wrap to bring you more FLR — from FlareDrops, yields, and delegation.","output":"Wrap $FLR for more rewards on Flare! ☀️"},{"text_input":"@subinium @Dune This is great @subinium Data is data indeed. Good or bad, we gain insights from both. Good luck with our bounty!","output":"Data insights are valuable! 📊"},{"text_input":"The overcollateralization design of FAssets ensures that the bridged assets are always backed by more value, allowing you to retrieve the underlying values even under unexpected conditions. Valuable lessons were learned from Coston. Testing on Songbird with $SGB will test the…","output":"Secure FAssets with overcollateralization! 🔒"},{"text_input":"Scenario 2️⃣: Significant collateral price fluctuations During recent $XRP price spikes and other major price movements, minting and redeeming operations have continued to function smoothly. Some liquidations were triggered to ensure redeemers could be paid back.","output":"Minting & redeeming stable during $XRP spikes! 🚀"},{"text_input":"Scenario 1️⃣: Source network downtime During the Open Beta on Coston, the XRPL testnet was down for 12 hours on June 20. The FAssets system handled the network downtime as designed, allowing participants who wanted to redeem to receive payment with a premium in testUSDC\/T.","output":"XRPL testnet down, FAssets handled it well! 🚀"},{"text_input":"How FAssets handles extreme cases Scenario 1️⃣: Source network downtime Scenario 2️⃣: Significant collateral price fluctuations","output":"FAssets: Resilient in network & price shifts! 🚀"},{"text_input":"@HomeDAO_live It was great! Hoping to see the winners of tracks again!","output":"Excited for the track winners! 🎉"},{"text_input":"Build the future you want to see. We're committed to helping you materialize it☀️ ▸ Keep improving ▸ Kickstarted Ambassadors Program ▸ Ongoing ▸ More tools every day. Recently added @QuickNode @Dune;","output":"Build your future with us! ☀️ #Innovation"},{"text_input":"Let's talk about oracles and build with them. If you’re still on the fence about what it exactly means, make sure to join @FlareNetworks’ workshop: Last time, we had over 2.1k people tuned in live. Will we have more this time?","output":"Join @FlareNetworks' oracle workshop! 📈"},{"text_input":"✅ Get some inspo: 📍 Video Tutorials: ☀️ Explore Flare on Dune: 🔥 Submit your dashboard as a response via @bountycaster or reply below 👇","output":"Submit your dashboard via @bountycaster! 📊"},{"text_input":"Create insightful dashboards and compete to be the most starred 🌟 1st Place: 3,000 USDC 2nd Place: 1,500 USDC 3rd Place: 750 USDC Honorable Mentions: 150 USDC each (up to 5 winners) Deadline: 12\/23\/2024 @bountybot","output":"Compete in dashboard contest! Win up to 3,000 USDC! 🌟"},{"text_input":"Flare is live on @Dune ☀️ We're excited to tell @FlareNetworks' story through data to you and over 500 data analysts on Dune. Track Flare's network and ecosystem growth seamlessly. Plus, a $6,000 bounty to build your own dashboards! 🔗","output":"Flare is now on Dune! Track growth & win $6K! ☀️"},{"text_input":"High-integrity data has always been the first step. With it, we can build an elegant bridge that allows you to trade, swap, and stake securely across ecosystems. From a liquidity hub to next-gen blockchain, we can do so much more together.","output":"Trade, swap, stake securely across ecosystems! 🔗"},{"text_input":"FAssets is the only decentralized solution that unlocks liquidity for XRP, BTC, and DOGE ecosystems at once, with proven results from 48,318 users in Open Beta. Next: Songbird Test","output":"Unlock liquidity for XRP, BTC, DOGE! 🚀"},{"text_input":"Existing oracles are not perfect. Common issues: - Rely on off-chain nodes to provide data. - Require devs to vet the reliability &amp; security of every data feed. - Can be expensive. Devs, you have a better option:","output":"Try decentralized oracles! 🌐"},{"text_input":"@ntise_me We have reported that account. Regarding the delegation rewards, please check this post","output":"Check the post for delegation rewards info! 📜"},{"text_input":"Why become @FlareNetworks’ Developer Ambassadors? • Monthly FLR stipend • Exclusive Flare merch and badges • Mentorship with Flare’s core team • Early access to new tools And it’s just cool to be a pioneer. Apply here:","output":"Join Flare as a Dev Ambassador! 🚀"},{"text_input":"We’ve seen your interest in learning about DeFi... Learn by doing: Bridge to @FlareNetworks now using to take part in rFLR rewards. Want to learn the basics? You're covered: Let's get ready for DeFi Summer 2.0 ☀️","output":"Join DeFi Summer 2.0 with @FlareNetworks! ☀️"},{"text_input":"@cathyliandadam @BA__JU 可以參與啊 FAssets追溯空投仍未派發，總金額$400k美金。在這開始： 另一種空投是每月發送的：","output":"FAssets airdrop pending, $400k total. Join now! 🚀"},{"text_input":"Monthly burn has been completed 🔥 Hash: 0x8d8ac7779c922280af2fe581d0e380e6e577b30aa30be1a2b031340078d77cff The goal is to burn 2.1 billion FLR. Why? It benefits you and the ecosystem. Recap:","output":"2.1B FLR burned for ecosystem benefits! 🔥"},{"text_input":"If you're enjoying the chat, take a look at this post from @retaildao and give Kevin from @joincoinsider a follow too 🫡","output":"Follow @retaildao & @joincoinsider! 🫡"},{"text_input":"@retaildao Or just join us and enjoy a quality podcast on DeFi with @0xSami_ &amp; @0xthanos! 🟢 Live in 1 hour at","output":"Join our DeFi podcast with @0xSami_ & @0xthanos! 🎧"},{"text_input":"What are FlareDrops? 🪂 ▸ Over 36 months, 24.2 billion FLR will be given out. ▸ To qualify, simply wrap or stake your $FLR. ▸ Currently, we are on FlareDrops22, with 14 more to go, so there's still time to participate! Get started:","output":"Join FlareDrops! Wrap or stake $FLR now! 🪂"},{"text_input":"FlareDrop.22 has just dropped 💧 Snapshots taken at 33,218,816 \/\/ 33,662,714 \/\/ 34,008,175 Reward rate: 2.63 per 100 FLR Make sure you claim it before they're burnt.","output":"Claim your FlareDrop rewards now! 💧"},{"text_input":"@0xSami_ @dinero_xyz @0xthanos @retaildao Need to add this link back — what a nice banner: And yes, this is a friendly reminder that it’s happening tomorrow. Friday DeFi Chat with @dinero_xyz and @FlareNetworks 🫡","output":"DeFi Chat tomorrow with @dinero_xyz & @FlareNetworks! 🚀"},{"text_input":"Rumor has it that Flare's TVL will keep growing ☀️ rFLR is a key driver — it rewards your DeFi participation, plain and simple. Claim them at if you've engaged with @SparkDexAI @blazeswapdex @enosys_global @kinetic_Markets. If you haven't, join the next…","output":"Flare's TVL growth driven by rFLR rewards! ☀️"},{"text_input":"@XRP_FLR_SGB @Kinetic_Markets @SceptreLS Nice one! Flare community is beautiful ✨","output":"Flare community shines bright! ✨"},{"text_input":"Heard you enjoyed the chat! Big thanks to @Danrocky 🙋‍♂️ What’s your favorite quote and answer from @HugoPhilion?","output":"Loved the chat! Thanks @Danrocky 🙋‍♂️ #Inspiration"},{"text_input":"You want to compound your digital gold without any centralized custodians and overleveraging issues. Don’t be reactive — like selling off or jumping into risky alternatives.","output":"Compound digital gold safely, avoid risks! 💡"},{"text_input":"@BTW0205 Great post! Hugo, Dan, and many XRP communities share a similar outlook on the potential of XRPfi :)","output":"XRPfi has great potential! 🚀"},{"text_input":"\"What is the plan for FAssets on Songbird?\" \"What is FAssets and how does it work?\" From @FlareNetworks OGs to newcomers, this call is for everyone. Let's have a chat tomorrow:","output":"Join us to learn about FAssets on Songbird! 🚀"},{"text_input":"@TimeVoyageur @flaremetrics @tina_connects @APIPortal @banker_defi @elliptic @SimpleSwap_io @BitKanOfficial @TsoAtlas Here's good tool for it:","output":"Check out this tool for crypto insights! 🔍"},{"text_input":"We're ready for Episode II, @Thinkingcrypto1 Let's talk about FXRP 🔥","output":"Excited for FXRP insights in Episode II! 🚀"},{"text_input":"Join us this Friday at 5PM UTC for a livestream! We will be joined by @0xSami_, founder of @dinero_xyz, along with @0xthanos, our DeFi analyst. We’ll dive deep into flrETH and DeFi🤙 Plus, @retaildao is hosting an exciting $FLR giveaway 👀","output":"Livestream Friday: flrETH & DeFi insights! 🎥"},{"text_input":"@sincitycountry1 @Danrocky @HugoPhilion Those who have a YES label","output":"YES label holders are in focus! ✅"},{"text_input":"We know you’ve been waiting for updates on Make sure to read in to have all the updates about the Songbird Test: ✓Purpose ✓Duration ✓Incentives ✓Steps to get to the Test Have more questions? We're hosting an AMA this Thursday with @HugoPhilion and @Danrocky 🤙","output":"Join our AMA Thursday for Songbird Test updates! 🎶"},{"text_input":"Stables are crucial for DeFi. ✓ USDT &amp; USDC on Flare unlock great yields. ✓ USDX is not only growing utilities with T-bill yields; it’s the backbone of FAssets. 🕒Understand stables in 5 mins: 📍Meet @Hex_Trust @ClearpoolFin:","output":"Stables boost DeFi with great yields! 💰"},{"text_input":"Introducing Flare's inaugural Developer Ambassador Program☀️ Join us in building impactful dapps, hosting hackathons globally, and shaping a builders-focused culture — all while earning exclusive rewards and support from @FlareNetworks core team. ✍️","output":"Join Flare's Developer Ambassador Program! ☀️"},{"text_input":"Build and help others build, and we will be rewarded. Start your first smart contract on @FlareNetworks","output":"Start your first smart contract on Flare! 🚀"},{"text_input":"The Flare Systems Explorer is the tool you need to navigate @FlareNetworks as the blockchain for data. Explore: ◾ Data providers &amp; FTSO feeds ◾ Delegation &amp; staking rewards info ◾ Reward epochs status 🔖","output":"Explore Flare Networks data with Flare Systems! 🔍"},{"text_input":"@husseinb It's very encouraging to hear this from a super user like you!","output":"Thanks for the support! 😊"},{"text_input":"@chennai2london This post is great! @chennai2london, indeed there is so much you can do with your FLR. Just to name a few: FlareDrops, delegation, staking, lending &amp; borrowing, and LPing. You have summarized it well. We'll check out your videos too.","output":"Explore FLR: FlareDrops, staking, lending & more! 🚀"},{"text_input":"Throwback to the hackathon with @encodeclub. It was truly amazing to see all the builders in action. We've created a write-up on how they utilized the FTSO and FDC: Can't wait for the next hackathon as @FlareNetworks grows day by day ☀️","output":"Hackathon with @encodeclub was inspiring! 🚀"},{"text_input":"Curious about USDX and T-Pool? Join our call with @ClearpoolFin and @Hex_Trust next Tuesday! 👉","output":"Join our USDX & T-Pool call next Tuesday! 📞"},{"text_input":"What is an overcollateralized bridge? Why is it better than WBTC? And what can we build with that? Tune in for this interview with @HugoPhilion. 👇","output":"Overcollateralized bridge > WBTC. Learn more! 🚀"},{"text_input":"@chainyoda @HugoPhilion Make sure to put a sun emoji in his diploma please. Ty ser","output":"Add a sun emoji to his diploma! ☀️"},{"text_input":"Always appreciate this video from @timrowley_au and others in the community. 🫡","output":"Great video from @timrowley_au! 🫡"},{"text_input":"rFLR rewards your support in Flare DeFi ☀️ rFLR vests over 12 months and can be claimed monthly as WFLR from Next rewards epoch starts Dec 3rd 🔔 Here’s a full guide:","output":"Claim WFLR monthly from Dec 3rd! ☀️"},{"text_input":"Flare Data Connector (FDC), a key protocol for @FlareNetworks and core to FAssets, is progressing daily 🔥 With the community's support, FDC is now live on Coston and is prepared to launch on Songbird in December. Data providers, start your engines ☀️ More details on migration:…","output":"FDC live on Coston, Songbird launch in December! 🚀"},{"text_input":"We are teaming up with @ChainPatrol, a leading AI-powered threat intelligence platform, to address the complex challenges of Web3 security and protect our community and digital assets. 🔒 With real-time monitoring and rapid threat response, ChainPatrol will help ensure the Flare…","output":"Partnering with ChainPatrol for Web3 security! 🔒"},{"text_input":"@VectorWear @RiddlerDeFi Withdrawable as WFLR monthly from the Flare Portal then you can use it for DeFi.","output":"Withdraw WFLR monthly for DeFi use! 🚀"},{"text_input":"USDX, a Treasury-linked stablecoin native on Flare, is now listed on @BitMartExchange. Join our call with @Hex_Trust 's @onchainpanini and @etothezed, @ClearpoolFin's @girishbudhrani_, and @HugoPhilion for a deep dive into USDX's role in Flare DeFi! 🔔","output":"USDX stablecoin now on BitMart! 🚀"},{"text_input":"How to understand the new $BTC $DOGE bridges? 🚩 If they're using centralized custodial solutions or still rely on multisigs. 🧪 For those using cryptographic methods (OP\/ZK): they're in early stages and hard to scale. ☀️ FAssets use economic security: Attestation driven by…","output":"BTC-DOGE bridges: Centralized or cryptographic? 🤔"},{"text_input":"SIP.05 and FIP.11 votes have passed ✅ A huge thank you to the @FlareNetworks community for your engagement and support 🫡 Implementation of the parameter changes is expected to begin very soon. Here’s why they make Flare data better:","output":"Flare votes passed! Changes coming soon! 🚀"},{"text_input":"@HypernativeLabs @Kinetic_Markets We're pleased to have @HypernativeLabs as our ecosystem security partner 👏","output":"HypernativeLabs joins as security partner! 🔒"},{"text_input":"A decentralized future needs decentralized data. Permissionless. Community-driven scaling decisions. Transparency in performance. Network-level security. Oh, and it's fast and free. Study Flare's native oracles ☀️","output":"Flare: Fast, free, decentralized data ☀️"},{"text_input":"Just a kind reminder: We started DeFi on Flare 3 months ago. Up only.","output":"DeFi on Flare is thriving! 🚀"},{"text_input":"Devcon may be over, but the energy lasts. Great times, great people, great conversations. We loved meeting you at the Dev Night Market Bangkok with @Ledger. Now, back to building until next time 🧑‍💻","output":"Devcon vibes were amazing! Until next time! 🚀"},{"text_input":"@CommunityFlare Thank you @CommunityFlare for sharing the much-needed info whenever you can 🫡","output":"Thanks for the updates, @CommunityFlare! 🙌"},{"text_input":"Rewards epoch just ended, but why didn’t I see my rewards ❓️ In FTSOv2, after the epoch ends, rewards are calculated and published as data. Data providers then sign the rewards, which may 👉 take a few days 👈 until 50% of the weight of data providers have signed. Once…","output":"Rewards pending, data providers signing. ⏳"},{"text_input":"Explore more Flare dApps at: 1️⃣ Flare Builders: A community-built directory 2️⃣ Ever-growing ecosystem map:","output":"Discover Flare dApps! 🌐"},{"text_input":"8\/ And we’re all about community-driven builds! Shoutout to: Meme launchpads @gemspump_io and @FlareLaunchPad — have fun, but meme safely, everyone. And congrats to @bet14official's recent launch on Coston. Learn why they chose to build a decentralized sports betting platform…","output":"Decentralized sports betting on Coston! 🎉"},{"text_input":"7\/ @CryptoRubic integrated Flare, meaning you can bridge 25+ chains to Flare, access best-rate swaps on Flare all in one place.","output":"Bridge 25+ chains to Flare with CryptoRubic! 🔗"},{"text_input":"6\/ Did you know? @SceptreLS is staking to 50+ validators nodes to support @FlareNetworks and offering over 40% APY.","output":"Earn 40% APY by staking with @SceptreLS! 🚀"},{"text_input":"4\/ @SparkDexAI just got a new UX upgrade. The dApp is now 8 times faster in loading and responding!","output":"SparkDexAI: 8x faster UX! 🚀"},{"text_input":"3\/ New cross-chain swap feature on @BifrostWallet. Now supporting FLR\/XRP, DOGE\/USDC, BTC\/USDT and more.","output":"Swap FLR\/XRP, DOGE\/USDC, BTC\/USDT on Bifrost! 🔄"},{"text_input":"2\/ $USDX T-Pool is growing strong with over $17.6M in TVL! Why is USDX so interesting? While locked in agent vaults as cUSDX, this Treasury-linked stablecoin earns yield on @ClearpoolFin, making it far more economically desirable.","output":"USDX T-Pool: $17.6M TVL & earning yield! 💰"},{"text_input":"1\/ $USDX, a Treasury-linked stablecoin native on Flare, is now listed on @BitMartExchange. This brings us one step closer to the FAssets launch. Next up: A @X space to answer all your burning questions 👍","output":"$USDX stablecoin now on BitMart! 🚀"},{"text_input":"'who's building on flare chain' Here's your quick recap of what has happened in @FlareNetworks ecosystem. Share this thread with those who're curious about us ☀️","output":"Flare ecosystem update! 🌟"},{"text_input":"People have a desire for tokenized financial products that preserve their privacy while still complying with KYC regulations. @FlareNetworks and Red Date's decentralized KYC solution makes this possible. More about this initiative:","output":"Decentralized KYC for privacy & compliance! 🔒"},{"text_input":"@_WaterAmi @BlockTempo 🫡 @HugoPhilion x @collectionist x Red Date AMA 精華中文版：","output":"AMA highlights with Hugo Philion & Red Date 🫡"},{"text_input":"@CDemanincor Thanks for the coverage! @CDemanincor We recently did an AMA with Red Date:","output":"Thanks for the AMA with Red Date! 😊"},{"text_input":"2\/ The info above is quite complicated, isn’t it? Be our north stars. Tell us what makes distribution work and what we should learn from it. Together, we can make adoption happen.","output":"Make distribution simple. Let's drive adoption! 🚀"},{"text_input":"1\/ Share useful info about @FlareNetworks: ▶️ How to explain why Flare is the blockchain for data under 3 mins: 📖 Wallets and Guides: 💡 FLR\/WFLR Contracts &amp; Tokenomics: • FLR\/WFLR Contract Addresses: &gt; FLR: Native token…","output":"Flare: Blockchain for data. Learn more! 📖"},{"text_input":"OK, here’s where we need your help: 1\/ Empowering newcomers with the info below. 2\/ Empowering the @FlareNetworks team by being our north stars 🌟","output":"Empower newcomers & guide @FlareNetworks! 🌟"},{"text_input":"\"If we are lucky, Flare will be one of the key components in how people use data on blockchains\"","output":"Flare: Revolutionizing blockchain data use! 🚀"},{"text_input":"FTSOv1 is now officially deprecated on Songbird, and we're getting close to the era of FTSOv2 🎉 Only v2 data providers will receive rewards moving forward. Dive into to discover: • Who Flare's data providers are • Delegation rewards • Reward epochs…","output":"FTSOv2 is live on Songbird! 🎉"},{"text_input":"Unlocking utility for BTC, XRP &amp; DOGE is more than a vision at @FlareNetworks ☀️","output":"Flare Networks boosts BTC, XRP & DOGE utility! ☀️"},{"text_input":"@dorjidan @flarescan_com @routescan_io Thank you for this @dorjidan 🔥","output":"Thanks for the shoutout! 🚀"},{"text_input":"As we wrap up this quest, we want to highlight the importance of redeeming your FAssets. Please ensure you complete your redemption by Friday 23:59 PM UTC to avoid disqualification from the retroactive airdrop. Full message at","output":"Redeem FAssets by Fri 23:59 UTC to qualify! ⏰"},{"text_input":"We've just concluded our 4-week quest, and $40K rewards has been distributed🔥 With +4600 users, nearly half received rewards! If you missed out, the retro airdrop is still up for grabs. A huge thanks for stress-testing bringing us closer to☀️","output":"$40K rewards distributed to 4600+ users! 🎉"},{"text_input":"BTC ATH today. Unbothered. Moisturized. Happy. In our lane. Focused. Flourishing. Building. Start in 30mins:","output":"BTC ATH today! 🚀"},{"text_input":"The layered stack gives you flexibility. But your dApp's security is only as strong as its weakest link. At we’ve created a blockchain that keeps you in the loop about your data pipeline + every feed is backed by the full validators set + 0 downtime ever☀️, so you can…","output":"Secure dApp with 0 downtime! 🌟"},{"text_input":"@FlareNetworksKR @EO_Studio_ @HugoPhilion We had a very pleasant chat ☀️","output":"Great chat with @FlareNetworksKR! ☀️"},{"text_input":"FIP.11 and SIP.05 pave the way for better Flare's enshrined oracles! ⚖️ Fairer rewards system for data providers 📊 Adaptive to market conditions 🌐 Boosting network decentralization We break it down further. Read on and vote today:","output":"Vote for fairer rewards & decentralization! 📊"},{"text_input":"@TheCanaryReborn @SparkDexAI Of course, we appreciate all builders on Flare. The projects mentioned in the tweet are our DeFi applications, but our ecosystem definitely encompasses more than just DeFi.","output":"Flare's ecosystem is more than just DeFi! 🌐"},{"text_input":"Harnessing Flare DeFi Field 🚜🌾 @FlareNetworks is cultivating a green field of DeFi innovation for builders, users, and dreamers — it's time to harvest the future of DeFi: @SparkDexAI: Uniswap V3 DEX with concentrated liquidity pools for wFLR, sFLR, and stablecoins, powered by…","output":"Flare DeFi: Innovate and harvest the future! 🚜"},{"text_input":"@spintax2 Because it is just that good! We also love this one made by you: Is the next one coming s👀n","output":"Can't wait for the next one! 👀"},{"text_input":"The workshop was so good last time we had over 2000 people tuned in LIVE. If that was great, you can expect nothing less from the next one happening tomorrow 📆 Sign up, it’s free:","output":"Join our free workshop tomorrow! 📆"},{"text_input":"@XRP4UandMe @Danrocky @CommunityFlare @HugoPhilion 👋 For a full list of providers supporting v2, please refer to:","output":"Check the list for v2 providers! 📋"},{"text_input":"\"Flare’s USDX stablecoin introduces Treasury yields to DeFi, challenging established players like USDC in terms of economic utility.\" More of its role in FAssets: Written by @josullivan010 at @Cointelegraph.","output":"USDX stablecoin brings Treasury yields to DeFi! 📈"},{"text_input":"Who is Rubic? @CryptoRubic aggregates 320+ DEXs and bridges, connecting over 90 blockchains and 15,500 assets. It acts like a “search engine” for DeFi swaps, finding the best rates while saving you time and money. With Rubic integrating Flare's bridges and DEXs, @FlareNetworks…","output":"Rubic: DeFi swap aggregator for 90+ blockchains. 🔗"},{"text_input":"Simplify your Flare DeFi journey with @CryptoRubic☀️ Test it out: • Bridge assets from 25+ chains to @FlareNetworks with @StargateFinance • Access best-rate swaps on Flare DEXs: @Blazeswapdex, @enosys_global, and @SparkDexAI — with cross-chain swaps…","output":"Bridge & swap assets on Flare easily! 🔄"},{"text_input":"@uttam_singhk Great to have you in Flare's history! Dream big and build the Web3 future you envision 🫡","output":"Welcome to Flare! Build the Web3 future! 🚀"},{"text_input":"Did your neighbors start asking about crypto? It's time to build in Web3! Choose a chain with a supportive team and culture. Join @FlareNetworks Dev Rel @j00sko this Thursday for a demo &amp; Q&amp;A during the stream ☀️","output":"Join FlareNetworks demo & Q&A this Thursday! ☀️"},{"text_input":"Even better — get rewarded by testing! Week 3: $10,000 rewards distributed. Last week's campaign concludes in 10H @Galxe: Don't forget to REDEEM too, or you'll miss the retro airdrop‼️","output":"Test & earn! Redeem for airdrop rewards! 💰"},{"text_input":"FAssets Open Beta got a refreshed home page! Have you seen it yet? 👀 &gt; New asset support: $DOGE on top of $BTC and $XRP. &gt; New information includes lots available to mint, the number of mints, the total number of FAssets holders, and more. 🏡","output":"FAssets Beta: New $DOGE support & info! 🚀"},{"text_input":"Why Flare? We bring integrity back to data. Thank you for the invite @EO_Studio_ .","output":"Data integrity is our mission! 🔍"},{"text_input":"Can't make this up. Thank you builders on ☀️ \"Easy deployment\" \"Smooth and easy\" \"Good finality\" \"Keep up the incredible innovation you're bringing to the community\"","output":"Builders praised for smooth deployment! 🚀"},{"text_input":"Are you ready for FTSOv2? FTSOv1 will be deprecated on November 21st — only v2 data providers and delegators will earn rewards. ⏰ Switch today if you haven't. ❓","output":"Switch to FTSOv2 by Nov 21 for rewards! ⏰"},{"text_input":"@Dainik_Bheda @ETHGlobal @gantargal 🫡 Happy to ship with you! Let's stay in touch","output":"Excited to collaborate! 🚀"},{"text_input":"@Tommy_Boy32803 You may get retroactive airdrop (with terms and conditions):","output":"Retroactive airdrop possible! 🎉"},{"text_input":"We’ve just wrapped up the @ETHGlobal Bangkok hackathon 🎉 Congrats to the tracks winners 👨‍🍳👩‍🍳 Here’s a recap of what they built: 🏆 Best Use Case of Flare’s Enshrined Oracles Winners HeptagonAI ($5,000) - Luka. Jure and @gantargal A platform for proof-of-learning AI…","output":"HeptagonAI wins $5K for AI proof-of-learning! 🎉"},{"text_input":"$DOGE power on Flare. Galxe rewards will be arriving shortly. Why not mint an while you wait?","output":"Mint a $DOGE on Flare while waiting for rewards! 🚀"},{"text_input":"Did you know? You can get Liquid Staked Tokens (LSTs) on @FlareNetworks with sFLR from @SceptreLS and flrETH from @dinero_xyz. Instead of locked funds, LSTs allow you to earn staking rewards while participating in DeFi.","output":"Earn with LSTs on Flare! 💰"},{"text_input":"Flare x @Dune was announced at 🤝 Dune will unlock on-chain data tools and datasets for the @FlareNetworks ecosystem and community. What dashboards for are you most looking forward to? ☀️","output":"Excited for new Flare x Dune dashboards! 🚀"},{"text_input":"@FlareNetworksKR @coinbase @BanxaOfficial @RevolutApp @TopperbyUphold 🫡","output":"Excited for the collaboration! 🚀"},{"text_input":"@cb_doge Yes, and what's even better, upgrade doge and give it SC capacity","output":"Upgrade Doge with smart contracts! 🚀"},{"text_input":"@ErikVoorhees @khughbreslin - overcollateralized: backup assets are BTC, stables, ETH and FLR - native oracles for the price feeds and collateral feeds and proof for state changes on btc, xrp and doge and it's simply fully decentralized.","output":"Decentralized finance with BTC, ETH, FLR, XRP. 🚀"},{"text_input":"$FLR is supported by a range of onramp providers: @Coinbase Pay, @BanxaOfficial , @RevolutApp , @Transak and @TopperbyUphold. This expands access to FLR and makes it easy to engage with the @FlareNetworks ecosystem ☀️ • • •…","output":"FLR accessible via Coinbase, Banxa, Revolut & more! ☀️"},{"text_input":"There are 13.8M $SGB yet to be claimed ‼️ These are the delegation rewards for the Flare Time Series Oracle. Did you support our data providers on You have 5 more days to claim before they're burnt. Claim at and learn more ⤵️","output":"Claim your $SGB rewards before they're burnt! 🔥"},{"text_input":"Builder mode ON @ETHglobal 🟢 Use @FlareNetworks' enshrined oracles and win a share of $10,000 during the hackathon. See where to find us:","output":"Join @FlareNetworks at ETHGlobal! 🟢 #Hackathon"},{"text_input":"The data must flow! Flare Foundation proposes updates to enhance the FTSO reward system, ensuring sustainability and fairness for all data providers. Learn about these changes and be ready to vote on Nov 18th:","output":"Vote Nov 18 for fair FTSO rewards! 📊"},{"text_input":"$10,000 has been distributed, and Week 3 rewards are just around the corner. This tweet serves as your final call for the FAssets Beacon @Galxe Quest 🔅 Please mint ➕ redeem to qualify for the Retro Airdrop too! Learn more:","output":"Mint & redeem for Week 3 rewards! 💰"},{"text_input":"Don't forget to dream and build. Join us at @ETHGlobal and utilize our enshrined oracles to empower a data-driven future with high-integrity data for better DeFi, AI, and identity solutions. ☀️","output":"Join @ETHGlobal for data-driven DeFi & AI! 🌟"},{"text_input":"@spintax2 @0xbags We see how Dune whipped that up in 30 mins. So proud of him 🫶✨","output":"Dune's quick work is impressive! 🌟"},{"text_input":"@spintax2 @robek_world @VorosTwins Dune we appreciate you so much too 🫶","output":"Dune fans unite! 🏜️"},{"text_input":"@0xteagan @Zeb_dyor @Ledger Helaas! Will you be attending the @ETHGlobal hackathon? We will be there as well.","output":"See you at the @ETHGlobal hackathon! 🚀"},{"text_input":"What is the most useful merch you got at Devcon? Wrong answers only.","output":"A blockchain-powered paperweight! 🪙"},{"text_input":"was nicely featured in @ournetwork__ . What is it, you ask? Learn what flrETH and liquid staking 💧 are right now:","output":"Discover flrETH & liquid staking! 💧"},{"text_input":"@ournetwork__ @jito_sol @Blockanalia @Rocket_Pool @Mausefalle25 @dinero_xyz @DerrickN_ was nicely featured in @ournetwork_ 🫡","output":"Featured in @ournetwork_! 🚀"},{"text_input":"There is a sense of euphoria at @ETHGlobal. We've got almost 1K sign-ups for our [Dev] Night Market with @Ledger 👀 Are you one of those who signed up? Show up! We’ve got some nice surprises for you ❄️👛","output":"Excited for @ETHGlobal's [Dev] Night Market! 🎉"},{"text_input":"15 minutes left until the @X space on all things Red Date x Flare with: ➖@hugophilion (Flare) ➖@yifan_reddate (Red Date Technology) ➖@collectionist (Kenetic Capital) ➖@CryptoSeanLee (IDA) See you there 👇","output":"Red Date x Flare space starts soon! 🚀"},{"text_input":"👏 @CryptoSeanLee, Co-founder of @IDAfi24, is joining us too! Tune in for an interesting panel on how the world’s first decentralized KYC trial in HK can facilitate tokenized financial product purchases with regulated stablecoin for Mainland Chinese.","output":"Decentralized KYC trial in HK for token purchases! 🔍"},{"text_input":"Post your favorite $DOGE meme and W 🪙🐶 Join a 1,111 x 11 FLR raffle by quote-tweeting our announcement below, posting a meme, and using the hashtag ☀️ 11 winners will be selected on Nov 15.","output":"Join the $DOGE meme fun! 🐶 #FLRraffle"},{"text_input":"A big woof energy is coming ☀️ Celebrate with us the moment that @FlareNetworks takes ONE step forward in unlocking DOGE utility. Bridge DOGE now, on top of XRP and BTC, on FAssets Open Beta with a brand new UI. ➡️ ❓","output":"DOGE utility expands on Flare's FAssets Beta! 🚀"},{"text_input":"Want to hear more about the x Red Date news? Join our AMA (Nov 12th, 1 PM UTC)👇 Featuring: • @collectionist Jehan Chu @KeneticCapital • @yifan_reddate Yifan He @red_date_tech • @HugoPhilion☀️ @FlareNetworks","output":"Join our AMA on Nov 12th at 1 PM UTC! 🗓️"},{"text_input":"@gregthegreek @mensanafitness_ it's a real test to see if you're a true runner :)","output":"Running challenge accepted! 🏃‍♂️"},{"text_input":"Flare Today ☀️ • Avg Block Time: 1.7s • Daily Tx: 540K • Unique Addresses: 1.23M • Total Tx: 32.7M • TVL: $16.88M (excludes $17.8M USDX, $13.7M sFLR, and $581K flrETH), a 2.35x increase over 3 months. What other interesting stats do you have?","output":"Flare Stats: 1.7s block, 540K daily tx, 1.23M users 📊"},{"text_input":"@MarketAcross Thanks for the tweet, @MarketAcross. Glad that @Forbes finds it a valuable story. It's a W for crypto!","output":"Crypto win! 🚀"},{"text_input":"Are you in BKK? Don’t miss the Dev Night Market hosted by @FlareNetworks &amp; @Ledger on Nov 13, 6-9PM. Enjoy unlimited Thai food from food trucks and a chance to WIN a Flex\/Stax! Network with devs and meet the Flare &amp; Ledger teams at @EFDevcon🛺","output":"Dev Night Market in BKK, Nov 13! 🌟"},{"text_input":"@BrukerikkenavnJ @ParadigmFlr @FlareNetworksKR Working on getting it back from @X","output":"Retrieving it from @X! 🔄"},{"text_input":"Here’s everything you need to know about FLR, @FlareNetworks' native token 👇 FLR makes Flare the blockchain for data. Holders can: 1. Support decentralized data provision by delegating to trusted data providers 2. Change Flare's trajectory by actively voting while being…","output":"FLR: Powering data on Flare blockchain! 🚀"},{"text_input":"@TobiasRush Thanks, Toby. Can't wait to share more progress and developments regarding this initiative.","output":"Excited to share more soon! 🚀"},{"text_input":"Lastly, on the latest Flare’s ecosystem news - flrETH, the first ETH Staking on Flare built by @dinero_xyz. 178 flrETH ($524,321 TVL) since launched a week ago. @0x_Sami says, “While our expertise begins with ETH, we've become increasingly intertwined with Flare. Following our…","output":"flrETH: $524K TVL in a week on Flare! 🚀"},{"text_input":"When asked about external competition to Flare's FAssets as a collateralized bridge, Hugo states that \"Everything is competition for Flare\" to some extent.","output":"\"Everything is competition for Flare.\" 🔥"},{"text_input":"Hugo also talked about memes, and the current \"meme coin-driven\" crypto market during the FAssets talk. As an example, he shared, \"I like the idea of being able to launch a pump dot fun kind of product, where the base currency (as in the currency that I bond with) is FDoge.\"","output":"FDoge: The meme coin of the future! 🚀"},{"text_input":"In addition to security, the speakers talked about which are fast-approaching to @HugoPhilion \"We're looking to see if there are any bugs, economic behaviors, or game theory behaviors that we've missed on Coston, because, of course, Coston doesn't have…","output":"Testing Coston for bugs and behaviors. 🔍"},{"text_input":"JD emphasized that user funds will not be impacted, with Kinetic implementing enhanced security protocols such as HyperNative's auto-pause feature to prevent future exploits of this nature &amp; to align with Flare's focus on security &amp; decentralization.","output":"User funds safe with new security protocols! 🔒"},{"text_input":"DeFi 🔒 security was a major topic during the call. We discussed @HypernativeLabs' role in detecting the recent Kinetic exploit. HyperNative's real-time monitoring systems and Kinetic’s quick response saved approximately $4-5 million in targeted funds.","output":"DeFi security: HyperNative saved $4-5M! 🔒"},{"text_input":"Did you catch the Flare Community AMA ☀️? If not, no problem — here are some key topics discussed ↓ - Security measures on Flare - FAssets coming to Songbird - Meme coin narrative - Native ETH staking on Flare Guests @HugoPhilion, @romeblockchain's @the_diamondrock,…","output":"Flare AMA highlights: security, FAssets, ETH staking. ☀️"},{"text_input":"Flare and Red Date launch the world’s first decentralized identity KYC trial. The trial enables Mainland Chinese to register anonymously on a regulated stablecoin app and facilitate the purchase of tokenized financial products with the stablecoin.","output":"Decentralized ID KYC trial in China! 🚀"},{"text_input":"Be part of the force that champions fast, secure, and low-cost data. Drive real change by building the decentralized data future for use cases that truly matter ☀️ Upgrade to FTSOv2 now and stand alongside @googlecloud, @Kiln_finance, @StakeCapital, @ankr, @luganodes,…","output":"Join the decentralized data revolution! 🚀"},{"text_input":"If you've made it to the leaderboard for Week 1, you've already received your share of the $10,000 rewards in FLR for the FAssets Beacon Quest 🔆 Raise your 🙋 if you're looking forward to the Week 2 rewards coming shortly. Check your ranking:","output":"Week 1 rewards are out! 🎉 Check your ranking!"},{"text_input":"Who’s ready for a 🐂 🏃 next week at @EFDevcon? Let’s enjoy the city and grab breakfast and tea after the run — a great chance to cool down, connect, and fuel up for the DevCon week.","output":"Ready for a run at DevCon? Join us! 🏃‍♂️"},{"text_input":"Sorry for the typo in the banner. That is FlareDrop 21. Thanks to @marcdotnarc for pointing it out. We're obviously too excited for the space today 🙏","output":"FlareDrop 21 typo fixed! Thanks @marcdotnarc 🙏"},{"text_input":"Great day for everyone in the space ☀️ How about an extra drop? 670 million FLR distributed to stakers and holders. 🟨 Blocks for calculation: 31,696,077 \/\/ 31,969,105 \/\/ 32,265,681 🪂 Reward rate: 2.68 per 100 WFLR Claim at","output":"670M FLR airdropped to stakers! 🚀"},{"text_input":"Burn hash: 0x291bf0842e5b4ea0bd04b640062de95f199d4d2135275ab0c974f6a8f978230f FLR tokenomics:","output":"FLR tokenomics update! 🚀"},{"text_input":"Another 66 million FLR tokens burned 🔥 Icymi FLR's community allocation is 59.6%","output":"66M FLR tokens burned, 59.6% for community! 🔥"},{"text_input":"We are entering the final stage of FTSOv2 transition ☀️ The deprecation of v1 has just occurred on meaning that data providers will no longer receive rewards for participating in v1. Rewards accumulated in v1 on Songbird can still be claimed until November 22, 2024.…","output":"FTSOv2 transition: v1 rewards end, claim by Nov 2024! ☀️"},{"text_input":"Heading to @ETHGlobal and need inspiration using Flare Data Connector and Flare Time Series Oracle?☀️ Check out our @EncodeClub London Hackathon recap: Find out what you can do with @FlareNetworks and be prepared to win at the ETHGlobal Hackathon🏆","output":"Explore Flare tools for ETHGlobal success! 🏆"},{"text_input":"Welcome to Week 3 🔅 Over 500 unique participants have joined the FAssets system as beta testers via FAssets Beacon Quest on @Galxe 💫 A big thank you to everyone who participated and provided feedback. Here’s what we have implemented to enhance your experience: 🟨…","output":"500+ joined FAssets beta via Galxe! 🎉"},{"text_input":"Don’t fade FDoge. FAssets start with FXRP, then Flare Labs will be moving to FBTC as quickly as possible, and then FDoge. For now, those are the largest non-smart contract assets in the market.","output":"FAssets: FXRP, FBTC, FDoge coming soon! 🚀"},{"text_input":"@GenfinityIO @Kinetic_Markets Thank you so much for the write-up 👍","output":"Appreciate the support! 🙌"},{"text_input":"Want more clarity and updates on @FlareNetworks' latest developments? Join us: 1️⃣ Discuss DeFi security with @the_diamondrock from @romeblockchain and @gbvpzffd2r from @HypernativeLabs. 2️⃣ Meet @dinero_xyz flrETH with @0xSami. Stay longer for Q&amp;A ✍️","output":"Join FlareNetworks for DeFi security updates! 🔍"},{"text_input":"Let's start the week strong 🔆 The first 100 likes and comments with their testBTC SegWit addresses will receive testBTC to start minting right away. Support and become our testers today:","output":"Get testBTC for minting! 💰"},{"text_input":"Start participating in @SparkDexAI. Learn more about flrETH, built by @Dinero_xyz ⤵️","output":"Join @SparkDexAI & explore flrETH by @Dinero_xyz! 🚀"},{"text_input":"Keep your ETH liquid and use it in @FlareNetworks DeFi while benefiting from best-in-class LST yields + extra incentives. That’s flrETH.","output":"Earn with flrETH in Flare DeFi! 🚀"},{"text_input":"Wallets that hold any of the following will NOT qualify for the airdrop: • Over 1,000 FTestXRP on Coston • Over 0.01 FTestBTC on Coston Want to support Redeem. Learn more about the airdrop:","output":"No airdrop if over 1,000 FTestXRP or 0.01 FTestBTC. 🚫"},{"text_input":"5\/ Getting started with flrETH is as simple as these steps: 1️⃣ Visit 2️⃣ Select your ETH source network (Ethereum or Flare) 3️⃣ Enter the amount to stake 4️⃣ Confirm the transaction 5️⃣ Start earning ETH yield on Flare Our community member @FreediverCrypto…","output":"Earn ETH yield on Flare in 5 easy steps! 🚀"},{"text_input":"4\/ Why participate? - An APR that is 2-3x higher than that of other liquid staking alternatives while retaining full liquidity and ownership of their tokens. - Supports In the future, flrETH might even serve as FAssets collateral, unlocking more DeFi potential on…","output":"High APR & full liquidity with flrETH! 🚀"},{"text_input":"3\/ Looks complicated? Worry not. The flrETH dApp, developed by Dinero, simplifies the process of acquiring flrETH for the user. See for yourself:","output":"Get flrETH easily with Dinero's dApp! 🚀"},{"text_input":"2\/ flrETH was built by @dinero_xyz, experts in the Ethereum ecosystem. Dinero runs its own liquid staking protocol, pxETH, which powers flrETH behind the scenes. Below is how they make it happen to leverage @LayerZero_Core general message passing protocol 👇","output":"flrETH: Powered by pxETH & LayerZero! 🚀"},{"text_input":"1\/ Industry-leading ETH staking yield on @FlareNetworks is here. Here is WHAT, WHY &amp; HOW to participate 👇🧵","output":"Stake ETH on Flare for top yields! 🚀"},{"text_input":"Three Governance proposals have been approved. 🐦 STP.09 introduced the Flare Data Connector (FDC) to Songbird. The FDC is Flare's enshrined oracle that will allow dApps to securely import external events onto Flare. In its initial deployment, the FDC protocol will include…","output":"Flare's FDC: Secure data for dApps! 🔗"},{"text_input":"AMA on Monday with @HugoPhilion. It's time for the ecosystem to catch up on the latest developments. Mark your calendar:","output":"Join our AMA with Hugo Philion on Monday! 📅"},{"text_input":"While we await a post-mortem analysis of today's security issues with Kinetic, we want to emphasize Flare Foundation's proactive approach to security through key partnerships: • Immunefi for application protection • Hypernative for real-time risk monitoring • Elliptic for…","output":"Flare boosts security with key partnerships! 🔒"},{"text_input":"Flare is bringing that ☀️ to Bangkok! 🛠️ Pool House | Hacker House 🔗 Blockchain Oracle Summit 🏃 Flare Run 🌙 Flare Dev Night Market 💻 ETHGlobal - DM us if you're around","output":"Flare events in Bangkok! Join us! 🌟"},{"text_input":"@dinero_xyz @SparkDexAI For full details, check out 🦋 • Full announcement: • flrETH User Guide:","output":"Check out the flrETH User Guide! 🦋"},{"text_input":"Flare x @dinero_xyz = flrETH — The first Flare-native ETH liquid staking solution ☀️ Starting today, earn ETH staking yield directly on @FlareNetworks. Coming: Swap and incentivized pools for flrETH on @SparkDexAI. Make your ETH work harder. Stake now:","output":"Stake ETH on Flare for yield! ☀️"},{"text_input":"@bet14official @CommunityFlare @Danrocky @HugoPhilion Great to see another dApp successfully using the FTSO ☀️","output":"dApp thrives with FTSO integration! ☀️"},{"text_input":"Flare's Head of Dev Rel, @j00sko, will join a panel at the @OracleSummit this November ☀️ Looking forward to a great discussion with @ThomasBertani (Hashi Alliance), @0xLamps (Stargate Finance), @LayneHaber (Everclear), @nsuri_ (Wormhole), and @SCBuergel (Gnosis). If you're in…","output":"Flare's Dev Rel joins Oracle Summit panel! ☀️"},{"text_input":"@XNobraid @DavidWaelder Go to the campaign homepage: You should see your points on the right-hand side under 'My Points.' Check your ranking in the 'Leaderboard' tab.","output":"Check 'My Points' & 'Leaderboard' for ranking! 📊"},{"text_input":"@DavidWaelder Simply complete the tasks and verify on Galxe, and then the 'Claim' button will appear for you to claim your points (see screenshot below). No, you don't need to pay any fees to claim points on Galxe. As for the final rewards ($FLR), they will be airdropped to participating…","output":"Claim points on Galxe, no fees! 🎉"},{"text_input":"@3LTsEeIRePAV9b8 Please be aware that Flare has no control over Bitcoin networks, including its testnet and the associated gas fees. We also cannot control testBTC faucets, as they are built by individual developers. However, we understand the inconvenience this may cause. We suggest checking out…","output":"Flare can't control Bitcoin networks or fees. ⚡"},{"text_input":"The FAssets Beacon Quest has sparked a lot of exciting testing on FBTC 💥 We’ll be distributing the $10K prizes this week, so stay tuned. 🟠 Check out the Week 2 Quest here: -------- Thanks to your valuable feedback, we’re diving into Week 2 with $30K…","output":"$10K prizes coming this week! Stay tuned! 💥"},{"text_input":"12 new block-latency price feeds are now available in FTSO on @FlareNetworks ☀️ $TON, $SUI, $PEPE, $AAVE, $FTM, $ONDO, $TAO, $RNDR, $NOT, $RUNE, $HNT, and $QNT. ICYMI, FTSO can support up to 1,000 feeds. Learn how you can propose new ones:","output":"12 new price feeds on FlareNetworks! ☀️ #Crypto"},{"text_input":"@EFDevcon @Ledger Congrats to the winners of our giveaway with @Ledger celebrating the [devs] Night Market Bangkok! First winner: @ team_onXXX Second winner: @ WippXX Third winner: @ RamasXXXX Winners, check your DMs for a message from us soon 👁️","output":"Congrats to our Night Market Bangkok winners! 🎉"},{"text_input":"By combining TEEs with blockchains, complex computations can be performed on large datasets off-chain while maintaining decentralization, security, and verifiability. We find TEEs very interesting 🍵","output":"TEEs + blockchains = secure, verifiable computing! 🔒"},{"text_input":"Sepia showcases how AI can be securely implemented onchain using the Flare Data Connector (FDC) 🏆 This innovative use of FDC ensures that data transfers from external sources to the blockchain remain untampered, effectively bringing offchain data securely onchain for AI agents…","output":"AI securely onchain with Flare Data Connector! 🔗"},{"text_input":"Most DApps today fail to meet user expectations. They cannot be more innovative because there is a limited range and amount of data that can be brought on-chain for processing. Off-chain compute would be an interesting area to explore.","output":"Explore off-chain compute for better DApps! 🚀"},{"text_input":"Devs, it’s time to start building on @FlareNetworks with its enshrined oracle, FTSOv2, if you want high-integrity data. Here’s how to query the latest ETH, BTC, and FLR prices in just two minutes 👇🏻 Start building:","output":"Build on Flare for reliable crypto prices! 🚀"},{"text_input":"Some of you might have missed this 👀 Redeeming FAssets isn’t just important — it’s essential ‼️ Freeing up collateral allows more participants to join testing, leading to a stronger FAssets system overall. Plus, you earn points on the FAssets Beacon Quest when you redeem……","output":"Redeem FAssets to free collateral and earn points! 💡"},{"text_input":"FTSOv1 is now deprecated on Songbird. Starting today, all inflation rewards will transition to v2. Data providers can submit updates until the end of the reward epoch on Saturday, October 26th, after which they can claim rewards and cease providing prices for v1. For v2, 70% of…","output":"FTSOv1 deprecated; switch to v2 for rewards! 🔄"},{"text_input":"@pejame123456 @encodeclub @StandWCrypto_UK @SuperteamUK Thanks for joining us there @pejame123456! Are you hacking with us?","output":"Yes, I'm hacking with you! 🚀"},{"text_input":"Introducing Flare’s Blockchain Machine Images on @GoogleCloud Marketplace — enabling rapid deployment of full nodes across 20+ networks, including Bitcoin &amp; Ethereum, with plans to add more. A scalable &amp; reliable solution designed for developers.","output":"Deploy full nodes fast on Google Cloud! 🚀"},{"text_input":"The @encodeclub London is happening tomorrow and here's what we’ve got for you: • $20,000 prize across 2 tracks • A workshop on Oct 25th by @j00sko • A talk on Oct 26th by @HoriaMagureanu • Cool pink merch Hack &amp; learn this weekend with @FlareNetworks ☀️","output":"Hackathon in London: $20k prize, workshops, merch! 🎉"},{"text_input":"Hey Devs ☀️ Let’s make sure our work is recognized, for that please submit your @FlareNetworks project repos to @ElectricCapital Crypto Ecosystems Data: 1. Fork &amp; edit Flare TOML file 2. Add your repo link (and GitHub org, if available) 3. Commit changes 4. Create a PR Flare…","output":"Submit your Flare project to Electric Capital! 🚀"},{"text_input":"@Galxe We've airdropped the testBTC to 100 of you! Thank you again. Let us know how it goes:","output":"Excited to test the airdrop! 🚀"},{"text_input":"2\/ Look how cool they are: Announcing winners in 48H. Additionally, we will be giving away four more @Ledger devices during the event. Sign up and show up!","output":"Win @Ledger devices! Sign up & join the event! 🎉"},{"text_input":"1\/ We’re teaming up with Ledger for THE side-event at @efdevcon – The [dev] Night Market Bangkok 🐉 To kick things off, we're giving away three Ledger Flex\/Stax! ▸ Reply with 🔆 ▸ Follow @FlareNetworks &amp; @Ledger ▸ Share:","output":"Win a Ledger Flex\/Stax! 🔆 Follow & Share!"},{"text_input":"@Kinetic_Markets @StargateFinance Transfer USDC on Base to Flare via Stargate ⏩Thank you for the walkthrough @whale589","output":"USDC transfer from Base to Flare via Stargate 🚀"},{"text_input":"5\/ 4️⃣ Key Dates: 🗓️ Notice period: Oct 17 – 23 🗓️ Voting period: Oct 24 – 30 Implementation is expected shortly after voting ends. Exact timing will be announced for data providers to prepare. For more details, check the full blog:","output":"Key dates: Notice Oct 17-23, Vote Oct 24-30 📅"},{"text_input":"4\/ 3️⃣ Rewards system FDC data providers are rewarded for voting on and attesting to data requests. Rewards are proportional to each provider's total active weight and come from two sources: Flare's yearly inflation: 50-50 split with FTSOv2 participation rewards FDC user fees:…","output":"Earn rewards by voting on data requests! 📊"},{"text_input":"3\/ 2️⃣ Deploy in stages First on Songbird, and will include support for attestation types required for as well as EVM Transaction types. In the near future, the community will be able to propose new attestation types, which will be accepted if they gain the support of…","output":"Deploying in stages on Songbird soon! 🚀"},{"text_input":"2\/ 1️⃣ Data from FDC is unique: Trustless: It lets dApps securely access and import a wider range of external data with trust derived from the underlying security assumptions of the Flare networks. Request-based: Only pulls data explicitly requested by users, rather than…","output":"Securely access data with Flare's FDC! 🔒"},{"text_input":"1\/ A very consequential governance proposal for @flarenetworks will be opened for voting tomorrow: \"The Flare Data Connector (FDC) strengthens Flare's position as the blockchain for data.\" 4 key points that you shouldn't miss 🧵","output":"Flare's FDC vote: key for data blockchain! 📊"},{"text_input":"Hello Flare Community, Thank you for all the feedback you’ve shared regarding our @Galxe quest. We have thoroughly reviewed your concerns and have been working on the issues you raised. Tasks related to verification and point claiming are now functioning as intended with…","output":"Galxe quest issues fixed! 🎉"},{"text_input":"@sentosumosaba @Galxe Farming is hard, but maybe after several experiences (once everything is set up), doing quests could be a nice activity for the weekend :)","output":"Weekend questing sounds fun! 🌟"},{"text_input":"@Tommy_Boy32803 @Galxe Respect your decision and appreciate your participation. The retro is still happening as planned, and we hope to bring you an even better experience next time!","output":"Retro is on! 🎉"},{"text_input":"@ubbah Can you describe the error with a screenshot? Feel free to join our Telegram and Discord, and we'll help look into your situation. Links are in the bio.","output":"Join our Telegram\/Discord for help! 📷"},{"text_input":"@AceThaGreatest Which part is not working? Could you describe the situation? You can check this out and even submit a ticket:","output":"Need help? Submit a ticket here! 🛠️"},{"text_input":"@Mister_B90 @j0Osko This is our Filip, @j00sko. Check out the Flare team badge he has. I understand it takes some time to get used to Galxe, but after one or two quests, you will get the hang of it. Here's their help center where you can also submit a ticket: We can…","output":"Explore Galxe quests! 🌟"},{"text_input":"4\/ Resources How to Mint and Redeem Video: What is FAssets: Guide: Bookmark this to try it when you’re free 🔆","output":"Mint & Redeem FAssets Guide! 🔆"},{"text_input":"3\/ Rewards Track your progress in real-time by visiting the Flare quest page. The leaderboard shows your ranking and total points compared to other participants. Top Rewards will receive: • 1st Place: $1,000\/week • 2nd Place: $800\/week • 3rd Place: $600\/week","output":"Win up to $1,000\/week on Flare! 🏆"},{"text_input":"2\/ Get started First, set up your Galxe account and verify your social accounts. ▸ Next, go to: ▸ Complete simple social tasks. Then kickstart the minting process!","output":"Set up Galxe, verify socials, and mint! 🚀"},{"text_input":"1\/ You are just 4 steps away from getting a share of the $40,000 prize pool. Minting and redeeming are the 2 key steps you need to complete. Here's how 👇 Unroll 🧵 for a step-by-step guide for the latest FAssets Beacon Quest.","output":"Join the FAssets Quest for a $40K prize! 💰"},{"text_input":"@eli5_defi Get rewarded just by testing the product using free test tokens 💚","output":"Test our product with free tokens! 💚"},{"text_input":"@JimKnox123 @KBinjjang @GalxeQuest Yes. You can connect your Bifrost to Galxe via WalletConnect.","output":"Connect Bifrost to Galxe via WalletConnect! 🔗"},{"text_input":"@DigiAssetUK @GalxeQuest What part is confusing? Let's see if this guide helps: There are some tutorial videos on the way.","output":"Check out our upcoming tutorial videos! 📹"},{"text_input":"@madave_lui @GalxeQuest Top Rewards: 1st Place: $1,000\/week 2nd Place: $800\/week 3rd Place: $600\/week","output":"Win big! 🏆 Top 3 prizes: $1,000, $800, $600\/week!"},{"text_input":"The FAssets Beacon Quest is live🔆 Complete tasks to win a share of $40,000 in FLR, with $10,000 distributed weekly. Explore FAssets, bridge $BTC, mint, redeem, and provide collateral—all trustless and secure. Join the quest, powered by @GalxeQuest:","output":"Win $40K in FLR by completing FAssets tasks! 💰"},{"text_input":"Want to hear @HugoPhilion live but can’t make it to Dubai? We’ve got you. 🎙️Panel: Blockchain's Core Technical Advancements: Simplicity in Complexity 👥 Speakers: @giozzi, @musalbas, @CharlieHusats, @ArthurB, @sunshinelu24 📆11:40 AM GST Set reminders:","output":"Blockchain panel live at 11:40 AM GST! 🎙️"},{"text_input":"For the first time, Horia Magureanu, Flare’s Research Scientist, will be speaking at an event — and not just any event. He’ll be delivering a keynote at @encodeclub London, presenting an ideal solution to the traditional trade-offs faced by blockchain oracles ☀️ Sign up:…","output":"Horia Magureanu's keynote on blockchain oracles! 🌟"},{"text_input":"@CryptobuddyInfo @EOSNetworkFDN @build_on_bob @Chainflip @StellarOrg @blast @BSquaredNetwork @radixdlt @injective @dYdX ☀️","output":"Crypto networks unite! 🌐"},{"text_input":"Flare hackathon guide: If you have any questions, feel free to reach out to our team at the booth or on our Discord. Just start building: ☀️","output":"Build at Flare Hackathon! ☀️"},{"text_input":"Calling builders in\/coming to London! We have prepared a $20K bounty with @encodeclub. 4 days left to apply. Find all the resources you need in the reply. 🏗️","output":"$20K bounty for builders in London! 🏗️"},{"text_input":"5\/ Without further ado, start voting today! FIP.10 is now live and awaiting your votes🔥 Upcoming Proposals: ▸ SIP.04: Oct 21 ▸ STP.09: Oct 24 You can review the proposal details anytime at","output":"Vote now on FIP.10! 🗳️"},{"text_input":"4\/ 💡Got multiple wallets? You can transfer votes from one wallet to another while keeping tokens in their original address. This simplifies your voting process, allowing you to manage votes from one place.","output":"Transfer votes between wallets easily! 💡"},{"text_input":"3\/ There are 3 kinds of proposals in Flare governance. All are currently initiated by the Flare Foundation, but in the future, community-initiated proposals will also be possible. Learn more:","output":"Flare governance: 3 proposal types. 🌟"},{"text_input":"2\/ Once your tokens are wrapped, head to the “Voting” tab on the Flare Portal. Choose a proposal and either vote for or against it.","output":"Vote on proposals in the Flare Portal! 🗳️"},{"text_input":"1\/ Voting is key to influencing decisions on the and networks. 🙋🏻 With every proposal, wrapped tokens (WFLR\/ WSGB) allow you to cast your vote. Wrap them at","output":"Vote with wrapped tokens! 🗳️"},{"text_input":"Have you checked our latest proposals? Some are waiting for your vote already🗳️ If you are unsure how to vote or what it’s about, let’s explore voting on @FlareNetworks together.","output":"Vote on Flare proposals now! 🗳️"},{"text_input":"@ghx0107 Also, take a look at the STP.09 governance proposal, which seeks to bring the FDC onto the Songbird network. Voting starts on Oct 24:","output":"Voting on STP.09 starts Oct 24! 🗳️"},{"text_input":"DeFi opportunities on @FlareNetworks 🌞 1️⃣ Looking for yield on FLR? Swap for sFLR on a DEX and hold. Swap for sFLR and supply to Kinetic to earn additional yield. Swap for sFLR and LP into an sFLR\/wFLR pool to earn rFLR. 2️⃣ Looking for USD yields? Get USDX and wrap it…","output":"DeFi on Flare: Swap FLR for sFLR, earn yields! 🌞"},{"text_input":". @HugoPhilion takes the stage at Blockchain Life 2024 in Dubai on Oct 22. His session will be livestreamed here on X @FlareNetworks 👀 Or even better, see you in person @BlLife_Forum:","output":"Hugo Philion live at Blockchain Life 2024! 🌐"},{"text_input":"New to @FlareNetworks? We've put together a workshop packed with essentials to jumpstart your journey. Choose your session and start right away—let's b3ild this weekend ☀️ 0:00 Introduction 1:58 Flare as L1 7:53 Coston2 and Songbird Explained 10:01 What does…","output":"Join our Flare workshop this weekend! ☀️"},{"text_input":"Oracles can bring any data onchain — not just prices. Think other chains' states, social media data, sports results, election outcomes, and even IDs. Many still don't grasp this potential.","output":"Oracles bring real-world data onchain! 🔗"},{"text_input":"Flare is growing. Every. Single. Day. A big shoutout to all the projects contributing to the future of DeFi on Flare — one transaction at a time. @SparkDexAI @Kinetic_Markets @enosys_global @SceptreLS @XDFiProtocol @StargateFinance @rainprotocol @LayerZero_Core @ClearpoolFin…","output":"Flare's DeFi ecosystem is thriving! 🚀"},{"text_input":"3 proposals in 1 week 💥 We want to remind you that the best way to have a voice in shaping @FlareNetworks’ future is through governance. Learn how voting works, why it matters, who can vote, and more in this article:","output":"Vote to shape Flare's future! 🗳️"},{"text_input":"Another milestone for Flare and FAssets 🎉 The Flare Data Connector is coming to \"In its initial deployment, FDC will support the attestation types required for the FAsset system, as well as EVM transaction types.\" Voting starts on Oct 24 ⤵️","output":"Flare Data Connector supports FAssets! 🎉"},{"text_input":"Over 2K joined our first online workshop (recording available on our YouTube). If you’ve built something from what you learned, tweet us with your handle — and we’ll grant you the dev role on our Discord right away 🫡","output":"Built a cool project from the workshop! 🚀"},{"text_input":"@_WaterAmi Your BTC deserves premium security while tapping into yields 🫡","output":"Secure your BTC and earn yields! 🔒"},{"text_input":"4\/ Next steps: Be sure to review the full proposals\/ summary blog: Understand the new structure, minimum participation requirements, and how the rewards work before casting your vote! 🗳️","output":"Review proposals before voting! 🗳️"},{"text_input":"3\/ Benefits for community: ✅ Improved security and accuracy of FTSO feeds. ✅ Encouraged honest behavior among data providers. ✅ Enhanced overall network stability and reliability.","output":"Improved FTSO security & reliability! 🔒"},{"text_input":"2\/ Voting Periods: FIP.10: October 18 - 24, 2024 SIP.04: October 21 - 27, 2024 All token holders, except the Flare Foundation and Flare VC Fund, can vote at the Flare Portal.","output":"Vote on Flare proposals! 🗳️"},{"text_input":"1\/ The new pass-based incentive structure aims to enhance provider participation across all Flare protocols. This ensures that data providers contribute reliably, benefiting the stability of the entire ecosystem ☀️","output":"Boosting provider participation with new incentives! ☀️"},{"text_input":"As the Blockchain for Data, continues to scale, its 100 data providers are increasingly important ☀️ We're introducing a new system to encourage providers to participate consistently and penalize inactivity, leading to improved security across protocols — aka \"better…","output":"Incentivizing active data providers for security! 🔒"},{"text_input":"🚨 45-Minute Countdown Get ready for our first-ever Developer Workshop with @FlareNetworks' lead engineer, @j00sko 👷‍♂️ Set your reminders and join us live to supercharge your skills and connect with fellow developers:","output":"Join our Developer Workshop with Flare Networks! 🚀"},{"text_input":"Simple as that. Join us tomorrow at 1PM UTC for a workshop crafted specifically for all of the devs out there looking to dive deeper into using Flare’s tech. Set your reminders here ▶️","output":"Flare dev workshop tomorrow at 1PM UTC! 🚀"},{"text_input":"@nidhisinghattri @EFDevcon You'll do great! Excited to enjoy the Bangkok morning together 🏃‍♀️","output":"Good luck in Bangkok! 🏃‍♀️"},{"text_input":"@XNobraid @EIareNafworxs @HugoPhilion @kbwofficial What are you trying to connect to? The site above is fake. Please find all official links on our only website (link in bio).","output":"Check official links in our bio! 🔗"},{"text_input":"Save it for later: Thank you all for partnering with us on our trip to Korea. We look forward to visiting Korea again 🇰🇷 도중 너무나 많은 사랑을 주셔서 감사합니다 @kbwofficial @FACTBLOCK @hashed_official @FlareNetworksKR","output":"Thanks for the love, Korea! 🇰🇷"},{"text_input":"As promised, here’s the full recording of @HugoPhilion’s @kbwofficial panel. Timestamp 👇 0:30 Evolution of Blockchain and Importance of Data 3:00 Current State of Oracles 5:29 Summary of Current Oracle Issues before Flare 7:00 Introduction to Flare's Data Protocols 9:15 Flare:…","output":"Watch @HugoPhilion discuss blockchain & oracles! 📊"},{"text_input":"@HugoPhilion We take security seriously, and we're bringing tools to Flare to enable proactive protection for the Flare community. We are currently working on the integration, so stay tuned.","output":"Flare boosts security with new tools! 🔒"},{"text_input":"FLR voters, we need you 🤚🏻 New proposals are up: SIP. 04 and FIP.10 - Adding an Incentive Structure for Participation in All Protocols. ▸SIP.04: ▸FIP.10: The new incentive structure introduces a pass-based system where…","output":"Vote on SIP.04 & FIP.10! 🗳️"},{"text_input":"@madmank79 Redeeming is the best for the system and for users to qualify for the drop.","output":"Redeem to qualify for the drop! 🎉"},{"text_input":"@Pewags1 Click redeem and enter the amount of FTestXRP you want to redeem.","output":"Redeem your FTestXRP now! 💰"},{"text_input":"If you’re holding more than 1,000 FTestXRP, you won’t qualify for the retro airdrop. We see you holding onto them... 👀 Redeem them now:","output":"Redeem FTestXRP now to qualify for airdrop! 🚀"},{"text_input":"Join our upcoming workshop this Wednesday. This is part of our ongoing initiatives to support your exploration of use cases on @FlareNetworks. With Flare, you can build useful applications using high-integrity data and more.","output":"Explore Flare use cases at our workshop! 🚀"},{"text_input":"The latest is here, and this time we're talking in-depth about 0:35 What are FAssets? 1:05 Economic security of FAssets 1:39 How do Flare's enshrined oracles - FTSO and FDC power FAssets ⬇️","output":"Exploring FAssets & Flare's oracles! 🔍"},{"text_input":"To qualify for the FAssets Retro Airdrop, make sure to participate in the Open Beta on Coston and soon on and ☀️ We're putting together some video guides, so if you have any specific requests, feel free to let us know 👇🏻","output":"Join FAssets Retro Airdrop! ☀️"},{"text_input":"@XRP4UandMe @HugoPhilion This is not our website. Please stay vigilant.","output":"Be cautious of fake sites! 🚨"},{"text_input":"Data is crucial for blockchain adoption, you already know this. What you might not know is that our industry needs better data solutions. Your dApp deserves a blockchain that offers native data access w\/ maximum security. Get this tweet to 400 likes, we'll drop the full video.","output":"Boost blockchain with secure data! 🚀"},{"text_input":"The 1st-ever Flare Builder Online Workshop kicks off on Oct 16. This is your chance to get a proper introduction to \"What is Flare?\" Understand why and how to start building on and beyond☀️ Perfect for new web3 builders. Sign up:","output":"Join the Flare Workshop on Oct 16! ☀️"},{"text_input":"@XrpTom Your Testnet BTC address. Choose \"Receive\" and then select \"Bitcoin\" in the Bifrost wallet. More detailed guide:","output":"Use Bifrost to receive Testnet BTC! 🚀"},{"text_input":"@XrpTom You can use or which gives 0.000039 BTC per claim. We will run testBTC airdrops too. Please stay tuned to @FlareNetworks.","output":"Claim 0.000039 BTC! Stay tuned for airdrops! 🚀"},{"text_input":"FAssets Beta Retro Airdrop Update is Here 🪂 First, a quick recap: Since launching on Coston testnet on June 4th, reached: &gt; 40K participants &gt; 450K transactions &gt; 48M FXRP minted &gt; 6.85 FBTC minted💥 The retro airdrop is designed for the Flare community to explore…","output":"FAssets Beta Airdrop: 40K users, 450K transactions! 🚀"},{"text_input":"Flare Emissions Committee Quarterly Report 🔖 During the last epoch, the Flare Emissions Committee allocated rewards to dApps to begin bootstrapping liquidity on @FlareNetworks. The following dApps distributed rFLR during this period: @SparkDexAI @blazeswapdex…","output":"Flare rewards dApps for liquidity boost! 🔥"},{"text_input":"@Kinetic_Markets @DeBankDeFi Kinetic is continuously expanding into new arenas ☀️","output":"Kinetic is growing in new areas! 🌟"},{"text_input":"Flare's first running event at @EFDevcon: 🏃‍♂️ Start fresh, think sharp, and build real connections. @FlareNetworks is hosting multiple events at in Bangkok. This is going to be fun ☀️","output":"Flare's running event at Devcon in Bangkok! 🏃‍♂️"},{"text_input":"One of the best things in crypto: being rewarded just for using the products. is now live on Coston: Start testing with upcoming retro airdrops and quests. More info is on the way 🪂","output":"Earn rewards by testing on Coston! 🪂"},{"text_input":"As onchain finance continues to expand, the demand for secure, cost-effective, and scalable oracle systems rises ☀️ @FlareNetworks is creating a new DeFi Hub with a full-stack EVM L1 featuring built-in oracles and a robust ecosystem, opening up exciting opportunities for devs…","output":"FlareNetworks: New DeFi Hub with built-in oracles! 🚀"},{"text_input":"@eomjipark @0xTechnoViking @encodeclub @dfinity @nillionnetwork Likewise 🤙","output":"Networking with tech enthusiasts! 🤝"},{"text_input":"Yet another epoch of rFLR rewards is live 🌟 New rFLR rewards are available on @SparkDexAI, @blazeswapdex, @enosys_global and @Kinetic_Markets. Jump into their pools to start earning yours!","output":"New rFLR rewards live! Earn on SparkDex, BlazeSwap! 🌟"},{"text_input":"@jayc_BM @HugoPhilion @with_blockmedia Thank you for the interview @jayc_BM 🤗","output":"Great interview, thanks @jayc_BM! 😊"},{"text_input":"The monthly burn has been completed. 66.29M $FLR was sent to 🕳 The 2.1 billion tokens we are burning account for ~40% of the original token allocation for investors. Learn more:","output":"66.29M $FLR burned, 40% of investor tokens gone! 🔥"},{"text_input":"Check out the full panel from DeFi Day with @AcheronTrading and @dexalot, where @HugoPhilion explains how Flare is developing a new DeFi Hub that provides fresh opportunities for both developers and users. Watch it here:","output":"Flare's new DeFi Hub: opportunities await! 🚀"},{"text_input":"DeFi is not ready for mass adoption without truly decentralized and secure oracles. @FlareNetworks is committed to providing stronger guarantees for its future.","output":"DeFi needs secure oracles for mass adoption! 🔗"},{"text_input":"FlareDrop.20 is now live and available to claim 🪂 The three random blocks for WFLR holding calculations are: 29,893,485 \/\/ 30,268,482 \/\/ 30,576,284. Rewards ratio stands at 2.78484209 FLR per 100 WFLR held. Understand what these numbers mean:","output":"Claim FlareDrop.20 now! 🪂"},{"text_input":"London, we are coming ☀️ 📅 October 11th, 14:55 📍 @zeebulive Live Main Stage Panel @MaxLuck95 will explain how @FlareNetworks is driving innovation with data. For developers, we will see you at @encodeclub London (Oct 25-27).","output":"Flare Networks' innovation at London panel! 🌟"},{"text_input":"Everyone talks about being decentralized, but true decentralization comes from decentralized data. Flare's enshrined oracles aren’t external services; they’re integrated and secured by 100 validators, who are responsible for bringing data and proofs onchain. Validators must…","output":"Flare: True decentralization with 100 validators! 🔗"},{"text_input":"Join us bringing trustless DeFi to BTC and XRP. Get rewarded for your support — it's that simple. Retroactive airdrop? Still on. Start your journey today:","output":"Earn rewards with BTC & XRP DeFi! 🚀"},{"text_input":"Everything you need to know about the incentives available on in 3 minutes: 00:36 - FlareDrops Explanation 1:24 - FTSO Delegation Rewards 2:01 - $FLR Staking Rewards 👇","output":"Incentives: FlareDrops, FTSO, $FLR Staking 💡"},{"text_input":"\"Code should be enough to trust the data. Oracles need to be more secure and transparent with their data. This is where Flare's oracle system comes into play.\" Watch the full interview with @HugoPhilion and @BlocksterCom.","output":"Flare's oracle boosts data trust and security! 🔒"},{"text_input":"SparkDEX will upgrade its contracts today on October 4th to enable users depositing cUSDX and WFLR in pools to be eligible for FlareDrops, FTSO delegation rewards, and cUSDX rewards while earning rFLR. All SparkDEX liquidity providers should be prepared to migrate their…","output":"Upgrade today! Earn rewards on SparkDEX! 🚀"},{"text_input":"It will be a great opportunity to hear from other leaders like @giozzi at Cardano, @musalbas at Celestia, @CharlieHusats at Bitlayer, @ArthurB at Tezos and @sunshinelu24 at Vechain Get your tickets, use code FLARE10 for 10% off:","output":"Join top blockchain leaders! 🎟️ #CryptoEvent"},{"text_input":"Flare can enhance your building experience, making it better and simpler. Get truly decentralized data at minimal costs and maximized security — powered by the design of a full-stack EVM L1 with enshrined oracles. @HugoPhilion will share more insights at @BlLife_Forum.","output":"Flare: Decentralized data, secure & cost-effective! 🔥"},{"text_input":"FTSOv2 Rewards — How They Work in Simple Math 🔓 🔴 V1 Rewards Epoch 223: 100% Epoch 224: 100% Epoch 225: 100% 🟡 V1 + V2 (Transition) Epoch 226: 50% Epoch 227: 50% Epoch 228: 50% from V1 + 50% from V2 (from Epoch 226) Epoch 229: 50% from V1 + 50% from V2 (from Epoch 227) In…","output":"FTSOv2 Rewards: Transitioning to V2! 🔄"},{"text_input":"@Kinetic_Markets Thank you for breaking things down for the users 👏","output":"Thanks for the insights, Kinetic Markets! 👏"},{"text_input":"@Blum_OG @eli5_defi @HugoPhilion 🫡 Let us know if you have any questions!","output":"Ask us anything about DeFi! 💡"},{"text_input":"FlareDrop.20 is fast approaching 💧 Raise your hand if you've already set up autoclaiming ✋️ If not, what are you waiting for? No more unclaimed claim all the FTSO delegation rewards you deserve. Guide:","output":"Set up autoclaiming for FlareDrop.20! ✋️"},{"text_input":"Today’s oracles have limited data, are expensive to use, and because each feed has a variable level of security, they create a complex developer experience. Devs, you have an alternative 👇","output":"Try a new oracle solution! 🚀"},{"text_input":"The call for decentralization is back. From the very beginning, Flare has been built on this ethos, providing data in the most decentralized way possible to builders and users. This commitment will drive us to outlast others in our pursuit of a truly decentralized system…","output":"Decentralization is key! #Flare 🌐"},{"text_input":"@eli5_defi We'd love to discuss this topic indeed! Your car analogy is quite spot-on. How would you like to dive deeper into the tech? :) @eli5_defi","output":"Let's explore DeFi tech! 🚗"},{"text_input":"Shoutout to the amazing @CommunityFlare for consistently adding value and educating the Flare community ☀️ Catch the full playlist of tutorials:","output":"Flare tutorials by @CommunityFlare! ☀️"},{"text_input":"@Kinetic_Markets @GenfinityIO @IOV_OWL @HugoPhilion @SceptreLS @RuleXRP @Danrocky @CommunityFlare Congrats 💎","output":"Congrats to all involved! 🎉"},{"text_input":"Just 10 days to go until @zebu_live, and we’re excited to meet our London community ☀️ @maxluck95 will share how free and high-integrity data can unlock new adoption in this space. See you there: 🕰️ October 11th, 14:55 📍 Zebu Live Main Stage","output":"Excited for @zebu_live! Join us Oct 11, 14:55. 📍"},{"text_input":"@0x99Gohan This guide is incredibly detailed 🤓 @FlareNetworks community, take a look 👆","output":"Check out this detailed guide! 📘"},{"text_input":"@BlocksterCom @HugoPhilion @FlareNetwork @IvanZhelev_ Thank you, @BlocksterCom team! It was nice meeting you at Token2049 @IvanZhelev_ 🤝","output":"Great meeting at Token2049! 🤝"},{"text_input":"Why we believe enshrining &gt; restaking Decoding @HugoPhilion: 🔎 Restaking 1. Risk exposure Reusing the L1 token introduces risks across all staking layers, potentially impacting dApps dependent on restaked security. 2. Operation burden Every additional AVS increases…","output":"Restaking risks: exposure & operational burden. 🔍"},{"text_input":"3 challenges to onchain AI adoption: 1. Complex compute 2. Data richness 3. Confidentiality And there's a possible solution. Who wants to hear more? 🤚🏻","output":"Tell me the solution! 🤔"},{"text_input":"We envision a DeFi future that combines Web2 experience with Web3 security. Thank you @TokenPostKR for the report. This will be a series of three deep dives into @FlareNetworks' technology tailored for the Korean community.","output":"Exploring DeFi with FlareNetworks for Korea! 🚀"},{"text_input":"@SicairosDavid @NairiUsher @HugoPhilion @CommunityFlare @flrdomains We have quite a UK community👍 Our next event in London is @Zebu_live on October 10. Will we see some of you there?","output":"See you at Zebu Live in London! 🎉"},{"text_input":"FTSOv2 rewards will be available from Epoch 228 onwards ✅️ The rewards are claimable a few days after the epoch ends. The next Epoch 228 ends tomorrow, September 30. ▶️ Check the latest epoch status and v2 registered entities in our system explorer:","output":"FTSOv2 rewards claimable soon! 🎉"},{"text_input":"@GRE4XRP @LastTartigrade @NairiUsher It takes longer wait times for minting &amp; redeeming FBTC due to the one-hour Bitcoin confirmation time.","output":"Bitcoin confirmations slow FBTC minting ⏳"},{"text_input":"“Minting and redeeming FXRP feel like wrapping and unwrapping FLR — very smooth and easy,” says a community member. Try it for yourself: Watch the video for a quick walkthrough 👇","output":"Minting FXRP is as easy as wrapping FLR! 🚀"},{"text_input":"Is it too late to ask what the Oracle Problem is? Never. @dineshkpinto breaks down the concept of an oracle in simple terms 🧩 Tune in to our YouTube channel for the full recording of our recent AMA with @PolyhedraZK.","output":"Oracle Problem: Trusting data from outside sources. 🤔"},{"text_input":"🌞You’ve just claimed $100 FLR from FlareDrops. What’s your next move?","output":"Invest in FLR or hold for future gains? 🤔"},{"text_input":"And that’s a wrap for this month’s Ecosystem Bytes. Flare’s ecosystem continues to grow, with new dApps and upgrades enabling exciting use cases. The next edition will be even busier☀️Happy weekend!","output":"Flare's ecosystem is thriving! 🌟"},{"text_input":"6\/ Polyhedra's @zkBridge_eco has integrated with Flare 🔔 If you have a dApp and are interested in getting the benefits of zero-knowledge for security and utilize FTSOv2 fast &amp; free price feeds, now is the time. DM us if you need help. Listen to our recent AMA 👇","output":"Polyhedra integrates zkBridge with Flare! 🚀"},{"text_input":"5\/ Flare’s builders are innovating with our native oracles. @Bet14official is among the first to build a more complex prediction market utilizing the Flare Data Connector.","output":"Flare's oracles power new prediction markets! 🔮"},{"text_input":"4\/ @Kinetic_Markets helps bring more ETH to the Flare ecosystem via 🫶","output":"ETH integration with Flare via Kinetic Markets 🌐"},{"text_input":"3\/ @SparkDexAI has been listed on @DefiLlama, and the pools are now live in the 'Yields' dashboard. This means more visible data and opportunities for you to discover.","output":"SparkDexAI now on DefiLlama! 🚀"},{"text_input":"2\/ The @enosys_global team has rolled out their much-anticipated v3 DEX on Flare mainnet, bringing new features and performance boosts.","output":"Enosys v3 DEX now live on Flare! 🚀"},{"text_input":"1\/ @FlareMetrics has launched the FlareFi Summer Dashboard, making it easier to track and explore DeFi activity on Flare.","output":"FlareFi Summer Dashboard is live! 🚀"},{"text_input":"Welcome to Ecosystem Bytes, your monthly roundup of key progresses and updates across the @FlareNetworks ecosystem","output":"Ecosystem Bytes: FlareNetworks updates! 🌐"},{"text_input":"Missed it? We have you covered: Thank you again to @PolyhedraZK for the invitation and for sharing the stage with us.","output":"Thanks @PolyhedraZK for the invite! 🙌"},{"text_input":"Flare devs aren’t the only ones hard at work. Our designers have been busy cooking up some fresh new merch for you 🍳 Which color is your favorite?","output":"New merch drop! What's your favorite color? 🎨"},{"text_input":"Heads up, devs 👋 You can now easily access @Flarenetworks' FTSOv2 price feed across chains using @PolyhedraZK's zkBridge. 1.8 seconds of latency and mostly free usage. Join @dineshkpinto today to learn how to call data in real-time in 1H ⤵️","output":"Access FTSOv2 price feed via zkBridge! 🚀"},{"text_input":"@0xGlitch_ @Tim_Roughgarden This is great! I'm wondering what the day 2 agenda will be like. Maybe we could join our AMA with @PolyhedraZK today? We're calling our native oracle FTSOv2 price feeds in real-time. ☀️","output":"Excited for Day 2! Join our AMA today! ☀️"},{"text_input":"Why do fast feeds matter? ☀️ Because half-minute differences can mean a lot. Current BTC Price in USD: $63,262 vs $63,234 Left➡️ block-latency feeds, updating every 1.8 seconds Right➡️ anchor feeds, updating every 90 seconds If you're creating a lending protocol, near-instant…","output":"Fast feeds = crucial for accurate crypto pricing! ⏱️"},{"text_input":"Staking rewards for epochs 222-225 are ready ✅ Check &amp; make sure your $FLR isn’t left behind 🔔 New to FLR Staking? Here's a good guide ⤵️ A liquid staking solution is also available on Flare. Study @SceptreLS and the utilities…","output":"Check your $FLR staking rewards now! 🔔"},{"text_input":"@PolyhedraZK Interesting, we'll also stream it on our discord 🫡@dineshkpinto @vreeland looking forward to the chat.","output":"Streaming on Discord! 🎥"},{"text_input":"If you’ve been exploring @FlareNetworks, you might have come across three types of rewards: ➖ FlareDrops ➖ FTSO Delegation Rewards ➖ FLR Staking Rewards Learn all about them in the latest episode of ⬇️","output":"Explore Flare rewards: FlareDrops, FTSO, FLR Staking! 💡"},{"text_input":"@MLayshock @ftso_au Hi Testudo, this is our latest communication about this. Hope it helps:","output":"Latest update on the topic! 📢"},{"text_input":"@enosys_global @SceptreLS 6\/ Hungry for more info about FlareDrops? 🪂 Learn more about FlareDrops: Autoclaiming Guide: Flare Portal:","output":"Learn about FlareDrops and autoclaiming! 🪂"},{"text_input":"5\/ Some of the FAQs ◾Do I miss FlareDrops if I use my tokens in DeFi? Not necessarily. E.g. @Enosys_global ensures FLR in their pools still receive FlareDrops and FTSO rewards. Liquid staking FLR in @SceptreLS also retains FlareDrops eligibility. ◾I didn’t claim my…","output":"FlareDrops are safe in DeFi! 💧"},{"text_input":"4\/ How to Set Up Autoclaiming? accrue every 30 days. Unclaimed FLR will be burnt after 67 days. Don’t miss out—learn how to set up autoclaiming. (LINK in the last tweet)","output":"Set up autoclaiming to avoid losing FLR! 🔥"},{"text_input":"3\/ How to Qualify for FlareDrops? To qualify, wrap your FLR or stake FLR. If you’re new to FLR, check or for where to get FLR. Make sure to use a compatible wallet. &gt; Add Flare as a custom network: &gt; FLR is the native asset on…","output":"Wrap or stake FLR to qualify for FlareDrops! 🔥"},{"text_input":"2\/ What are FlareDrops? FlareDrops are monthly token distributions for users who wrapped or staked their $FLR. This is how we reward active network participants. Next Drop ➡️ Oct 7th","output":"Next FlareDrop on Oct 7th! 🎉"},{"text_input":"1\/ ☀️24.25B FLR will be distributed as FlareDrops over 36 months. ☀️Every 30 days, ~670M FLR are distributed ☀️69.5K users already claimed their rewards Ready to join FlareDrops.20? Quick guide and FAQs 🧵","output":"Join FlareDrops: Claim your FLR rewards! 💰"},{"text_input":"It was a pleasure to visit Korea this year! We heard our booth was quite popular ☀️ A special thanks to @kbwofficial, @FACTBLOCK, @tokenpost, @hashed_official, @with_blockmedia, and @DecenterKR. Let’s stay connected. Hugo's panel recording is coming 🔜","output":"Visited Korea! Booth was popular. Thanks all! ☀️"},{"text_input":"You can monitor everything FTSO in real time. &gt; Track reward epochs' status and schedule. &gt; Find out who is validating blocks and providing data. &gt; Check available price feeds and get updates every 1.8s.","output":"Track FTSO rewards & updates every 1.8s! 📊"},{"text_input":"Update on FTSOv2 Rewards on Flare A week ago, the Flare Time Series Oracle v2 went live on Flare mainnet, introducing changes to FTSO rewards. TL;DR: V1 rewards are reduced in epochs 226 (ended today) and 227 due to the V2 deployment entering the beta phase, where rewards will…","output":"FTSOv2 live on Flare! Rewards updated. 🚀"},{"text_input":"@dexalot @AcheronTrading It was great connecting with your teams and community🤝","output":"Networking with @dexalot & @AcheronTrading! 🤝"},{"text_input":"@JeenLolkema Hello Jeen, thank you for all your contributions. We'll let other builders know that if they need help with Excel, they should come to you. And if you ever want to try the actual coding, feel free to drop us a message; we're more than happy to support a dedicated community…","output":"Excel expert? Reach out to Jeen! 📊"},{"text_input":"Enshrined oracles leverage the entire network's stake to secure every data feed. @FlareNetworks offers two types: One that supports up to 1,000 price feeds and another that provides proof of blockchain states and real-world data. Getting started:","output":"Flare Networks: Secure data feeds & blockchain proof! 🔗"},{"text_input":"Freeing up collateral in helps others test the system too. The more testing, the better the product. Learn how to mint AND redeem your FAssets:","output":"Mint & redeem FAssets to improve the system! 🚀"},{"text_input":"Stormy skies may be lingering after TOKEN2049, but Flare is shining bright ☀️ ✅ We shared our vision at @AppChainDay @token2049. ✅ Joined panels discussing DeFi and Oracles with @dexalot @AcheronTrading. ✅ Connected with the vibrant Singaporean community. Safe travels,…","output":"Flare shines at TOKEN2049! ☀️"},{"text_input":"@FlareNetworksKR @kbwofficial @HugoPhilion @with_blockmedia Thank you @with_blockmedia 🤝","output":"Thanks for the support! 🤝"},{"text_input":"@tina_connects Thanks for the kind words @tina_connects, safe travels ☀️","output":"Safe travels, Tina! 🌞"},{"text_input":"Tune in to the full discussion in @HugoPhilion's recent chat with @cryptonews:","output":"Catch Hugo Philion's chat on @cryptonews! 🎧"},{"text_input":"In just 2 minutes⏳ You can grasp the challenges @FlareNetworks addresses and its full-stack solution for builders.","output":"FlareNetworks: Solving blockchain challenges! 🚀"},{"text_input":"@Stoic_Cpt @Ripple Here's ours: We will update it more constantly 🫡","output":"Looking forward to the updates! 🚀"},{"text_input":"This is just the beginning of what the Flare DeFi Emissions Program can bring 👇 $16M+ TVL and 1M+ wallet addresses. You are not too late to participate. What exactly is the program about? ---- 1. Flare DeFi Emission Program It’s a 510M FLR program designed to catalyze DeFi…","output":"Flare DeFi: Join 510M FLR program now! 🚀"},{"text_input":"Laying the decentralized data foundation for dApps with a Web2-like experience, while ensuring Web3 verifiability, is something @FlareNetworks is deeply passionate about, and it’s why we’re here. Thank you for inviting us to share Flare's vision with the Korean community,…","output":"Building Web3 with Web2 ease! 🚀"},{"text_input":"@DgtlNumismatist You can replace MM with any EVM compatible browser wallet and it will work the same.","output":"Use any EVM wallet, it works the same! 🔄"},{"text_input":"@MarketAcross @HugoPhilion @TK_Humanity @Humanityprot @jbrukh @coinfund_io @OVioHQ @jamie247 Hey, that's us. Thanks for the tweet, team @MarketAcross.","output":"Thanks for the shoutout! 🚀"},{"text_input":"@0x99Gohan Great guide 🫡 @sparkdexAI @StargateFinance @SceptreLS @Kinetic_Markets","output":"Thanks for the guide! 🚀"},{"text_input":"Developers, this one’s for you 👇 Watch this step-by-step guide where we walk you through deploying your first smart contract on Flare.","output":"Deploy your first Flare smart contract! 🚀"},{"text_input":"Dear @nickcampion, thank you for your service. The Flare team and community recognize your invaluable contribution in laying a solid groundwork for our brand. Delighted to grow talent internally with @_Waterami taking over as Flare’s new Head of Marketing. Best of luck to both…","output":"Congrats @_Waterami! 🎉"},{"text_input":"@0xagarwal @uttam_singhk We're looking for developers as cool as Uttam🫡","output":"Looking for developers as cool as Uttam! 😎"},{"text_input":"It takes: 1.8s 10 lines of code 0 cost To get secure data on @FlareNetworks. Try now:","output":"Secure data on Flare in 1.8s, 10 lines, $0! 🚀"},{"text_input":"🎙️@hugophilion just finished a panel at @token2049, discussing AI x Blockchain. Did anyone catch anything new? Next up: Stop by the @OKXweb3 carnival to get the latest updates from the stage ▶️","output":"AI x Blockchain insights from @token2049 panel! 🤖"},{"text_input":"@luganodes Thank you for supporting Flare's journey to set a new standard for decentralized data 🫡","output":"Supporting Flare's decentralized data journey! 🚀"},{"text_input":"If you’re at @token2049, don’t miss today’s panel. @HugoPhilion, co-founder of @flarenetworks, will discuss the intersection of AI and Blockchain with @TK_Humanity, @jbrukh and @jamie247 Join us at the Sky Stage from 5:30-6PM","output":"AI & Blockchain panel at #TOKEN2049, 5:30PM! 🚀"},{"text_input":"@Santiag78758327 @PayMeInXRP_ @RealVision @HugoPhilion YES please 🤙","output":"Excited for XRP updates! 🚀"},{"text_input":"Yesterday, we casually celebrated 3rd birthday with a new explorer: Cheers to Songbird, a highly performant canary network with a 1-second block time that handles 803K transactions every day — happy birthday 🎂","output":"Songbird turns 3! 🎉 Fast and reliable network."},{"text_input":"enshrined oracles benefit builders and users. Price data is often free -&gt; attract builders -&gt; increased network usage &amp; higher transaction volume 📈 Want to chat further? Meet us tomorrow: &gt; DeFi Day at 1:30 PM: &gt; @Token2049 at 5:30 PM, Sky…","output":"Oracles boost DeFi growth! 📈"},{"text_input":"@tina_connects @HugoPhilion See you at @token2049 Also, come visit us at Hugo is giving a panel, and we'll prepare a nice goodie bag for you. :)","output":"Excited for @token2049! 🎉"},{"text_input":"@CoinDesk @RiscZero @boundless_xyz @limewire @agoric @noble_xyz @wanchain_org @LogX_trade @VelarBTC @Liqquidity 🫡","output":"Crypto partnerships and collaborations! 🚀"},{"text_input":"7\/ Want to learn more about what’s under the hood? Read on: And start building:","output":"Explore the details and start building! 🚀"},{"text_input":"6\/ FTSOv2 supercharges Flare DeFi, empowering dApps to refine and expand their offerings. For example: • @Kinetic_Markets: More efficient loans &amp; liquidations • @XDFiProtocol @SparkDexAI: Create advanced financial instruments • @LayerZero_Labs @rainprotocol: Facilitate…","output":"FTSOv2 boosts Flare DeFi for dApps! 🚀"},{"text_input":"5\/ All the benefits above, while not sacrificing any bits of decentralization and security. Flare’s 100 validators continue to serve a dual role, as block validators and data providers. This enshrined architecture ensures that every single feed is secured by the entire network.","output":"Flare: Secure, decentralized, dual-role validators! 🔒"},{"text_input":"4\/ 3️⃣ Cost-Effective: Querying block-latency feeds from FTSOv2 is mostly free on Flare. FTSOv2 removes financial barriers by offering most feeds at no cost, making decentralized data more accessible than ever.","output":"Free data feeds on Flare! 🚀"},{"text_input":"3\/ 2️⃣ Support up to 1000 feeds And this is not limited to crypto price feeds but various asset classes including equities and commodities, with access to 2 weeks of historical data. That means unlocking more use cases.","output":"1000 feeds for diverse assets! 📈"},{"text_input":"2\/ Now, let's learn about what's so powerful in FTSOv2: 1️⃣ Block-latency feeds: FTSOv2 updates with each new block on Flare, roughly every 1.8 seconds. This makes it the ideal oracle for DeFi - supporting use cases including lending and borrowing, perpetual and options trading,…","output":"FTSOv2: Fast oracle updates for DeFi! 🚀"},{"text_input":"1\/ To grasp its power, you'd better start building: It takes only 10 lines of code to get price feeds:","output":"Get price feeds in 10 lines of code! 🚀"},{"text_input":"Flare Time Series Oracle has had zero downtime since its inception. V2 is getting even better. ▸ Block-latency feeds ▸ Scalable to 1,000 feeds ▸ Free to query 🧵","output":"Flare Oracle: Zero downtime, 1,000 feeds! 🚀"},{"text_input":"\"We want to provide a web2-like experience with web3 guarantees.\" In this podcast, @HugoPhilion discussed Trusted Execution Environments (TEE) with @mattzahab. Thank you for the invitation @cryptonews. Give it a listen ⤵️","output":"Web3 security with a web2 feel! 🔒"},{"text_input":"@MacroBrooks We genuinely appreciate the kind words, @MacroBrooks. FTSOv2 supports Flare's vision as the Blockchain for Data. This product upgrade, the result of a year-long research effort, underwent rigorous testing on Flare's canary network, Songbird, for several months under volatile…","output":"FTSOv2 boosts Flare's data blockchain vision! 🚀"},{"text_input":"Introducing Flare Time Series Oracle v2 More data, delivered faster. Free to query any crypto feeds that are as secure as the network. Now on @FlareNetworks mainnet ☀️","output":"Flare Time Series Oracle v2: Fast, secure crypto data! ☀️"},{"text_input":"Don't let your $FLR sit idle. Here's what you can do: &gt; Wrap your FLR for &gt; Delegate to get extra rewards. &gt; Dive into DeFi for rFLR yields. Many of you have wrapped &amp; delegated, but DeFi is still new to many. 👉 A quick guide:","output":"Boost $FLR: Wrap, Delegate, Explore DeFi! 🚀"},{"text_input":"@routescan_io @flarescan_com @HugoPhilion @flare_builders @CommunityFlare Love the sound of 1M ☀️","output":"Excited for 1M milestone! 🌟"},{"text_input":"Active users of Open Beta: Up only ⬆️ Quick reminders: &gt; Redeemers, we need you just as much as minters. &gt; We love seeing the participation. Do remember to touch grass this weekend 🌳🫡","output":"Open Beta users rising! 🌱"},{"text_input":"Friday the 13th? Not so unlucky for @FlareNetworks ☀️ Thanks to your support, we just hit a new ATH of $15.58M TVL; with: • 115 WETH • $1.55M USDC.e • $1.45M USDT bridged to Flare via @StargateFinance.","output":"Flare hits $15.58M TVL on Friday the 13th! 🚀"},{"text_input":"Flare Data Connector enables dApps on @FlareNetworks to access data (real-world, internet, external chains) without relying on third-party oracles. One use case is decentralized prediction markets. Examples: • Olympics Prediction Market Game @KalmiaLTD • Sports Betting…","output":"Flare connects dApps to real-world data! 🌐"},{"text_input":"@Truegems_io It was nice 👏 Hope some members of the Flare community had the chance to experience it.","output":"Glad you enjoyed it! 😊"},{"text_input":"@hugophilion in the latest interview with @chainalysis. Tune in ▶️","output":"Interview with @hugophilion on @chainalysis! 🎙️"},{"text_input":"Flare is the blockchain where data is as secure as the network itself 🔒","output":"Data security on Flare is top-notch! 🔒"},{"text_input":"The Flare community made an NFT for Mint it before it's too late ☀️","output":"Mint the Flare NFT now! ☀️"},{"text_input":"@lmp_xrp Mind that you can now also stake via MM\/wallet connect on Flare Portal.","output":"Stake XRP on Flare Portal via MM\/wallet connect! 🚀"},{"text_input":"Attention $FLR stakers: Rewards for epochs 218-221 are now available for claiming. 6.7B FLR (nearly $100M) staked today. Thank you for supporting both the security and success of Flare. Remember, you can still receive and vote on governance while staking. 🫡","output":"Claim your FLR rewards for epochs 218-221! 💰"},{"text_input":"Let's revisit the concept of enshrined oracles. Understand how Flare Time Series Oracle is enshrined and how it will restore a decentralized, manipulation-resistant data layer. Enshrined oracles are here. @FlareNetworks will be the catalyst.","output":"Enshrined oracles boost decentralized data! 🔗"},{"text_input":"@flareoracle_io Nice step-by-step guide👍 The next emission should be around Oct 4.","output":"Emission expected around Oct 4. 📅"},{"text_input":"@KalmiaLTD @Apillon Solid &amp; open source project 👏 Builders, be inspired:","output":"Open source project for builders! 👷‍♂️"},{"text_input":"We are heading to Singapore for @token2049 ☀️ 🎤 Filip Koprivec @j00sko’s keynote at @AppChainDay 📅 September 17, 1:50PM 🔗 🎤 Panel of @hugophilion on AI on the Ledger: Transforming Blockchain with Artificial Intelligence 📅 September 18, 5:30-6PM 📍…","output":"Heading to Singapore for @token2049! 🌟"},{"text_input":"One way to support @FlareNetworks is to stay tuned to the latest developments of the Flare DeFi Emission program. Start by learning about rFLR. Here’s a quick guide on how to earn rFLR rewards and which dapps are distributing them ⤵️","output":"Learn about rFLR rewards and supporting dapps! 🚀"},{"text_input":"Now you can add this minting event to your calendar: We're blessed that Flare is backed by a diligent &amp; talented community like @Truegems_io @DieCsHamburg. More interesting community initiatives are coming your way. Start by participating in this one 🫡","output":"Join the Flare minting event! 🌟"},{"text_input":"@HouseofChimera @Fresh_Cryptos @XRPBrainst0rm @xrpchamp589 @uppercent_ @XrpTom @block_bonez @SolitaireRoom Thanks for this, it's a good summary 👍 @HouseofChimera","output":"Great summary, thanks! 👍"},{"text_input":"Bitcoin is now supported in FAssets Open Beta ✅ Bridge testBTC from the @Bitcoin network to Coston in just a few clicks. Win extra testBTC to get you started now: The first 100 to like, retweet and reply with their testBTC segwit address win 👇","output":"Bridge testBTC to Coston easily! 🚀"},{"text_input":"6\/ Claim your rewards regularly (every 3.5 days) to compound your earnings. Consider setting up autoclaiming, because unclaimed rewards will be burned after 90 days. Learn about rewards and FLR delegation in the latest blog article:","output":"Claim rewards every 3.5 days! 🔥 #CryptoTips"},{"text_input":"5\/ How to choose? Use tools like @flaremetrics &amp; the FTSO monitor to select best performing providers. Some of the key factors to consider, in addition to rewards, are:","output":"Use tools like @flaremetrics to choose wisely! 🔍"},{"text_input":"4\/ How to delegate? To start you need to wrap you FLR into WFLR, and SGB into WSGB on Flare Portal, then choose a data provider. Then, delegate using the Flare Portal or your wallet like @BifrostWallet.","output":"Wrap FLR\/SGB, choose provider, delegate! 🚀"},{"text_input":"3\/ Who are you delegating to? Data providers of the Flare Time Series Oracle. They're independent entities that gather data from various sources and feed it into the FTSO smart contract. When you delegate, you assign your vote power (your holdings of WFLR\/WSGB) to an FTSO Data…","output":"Delegating to FTSO data providers! 📊"},{"text_input":"2\/ Why delegating? Delegating your FLR or SGB tokens is a simple and effective way to earn rewards while supporting @FlareNetworks to be the Blockchain for Data. By delegating, you contribute to Flare’s enshrined oracles. Read more about enshrined oracles:","output":"Earn rewards by delegating FLR\/SGB tokens! 🚀"},{"text_input":"@Toni241179 @HugoPhilion @danheld 👀 We have a working alternative here:","output":"Check out our new solution! 🚀"},{"text_input":"@dexalot @token2049 @AcheronTrading Exciting 👏 Be there to learn everything about all DeFi opportunities on Flare, Dexalot and Acheron.","output":"Learn DeFi on Flare, Dexalot & Acheron! 🚀"},{"text_input":"Non-stop growth in FAssets participation 🔥 Another 4.6M TestXRP minted into FTestXRP in just 1 month. Let’s boost those redemption numbers: Redeeming is vital for the success of the Open Beta and your airdrop eligibility.","output":"Boost FTestXRP redemptions for airdrop eligibility! 🚀"},{"text_input":"Thank you to everyone who joined us at @kbwofficial. We truly cherished every conversation, which fueled our passion to be the leading blockchain for data 🇰🇷 Next up: @token2049 🇸🇬","output":"Excited for @token2049 in Singapore! 🚀"},{"text_input":"@DigitalID_ 36-19 = 17 months to go, with around 11 billion FLR remaining for distribution.","output":"17 months left, 11B FLR to distribute! 🚀"},{"text_input":"If you’ve been wrapping your FLR token, the time to collect your rewards has come. &gt; Rewards rate: 2.88 FLR\/ 100 WFLR &gt; Block used for snapshots: 28,468,399 \/\/ 29,010,261 \/\/ 29,272,693 Remember unclaimed rewards will be burned after 67 days.","output":"Claim your FLR rewards now! ⏳"},{"text_input":"1,093,254 wallets are holding $FLR. Here’s what you need to know as an FLR holder: 1️⃣ 66M FLR just burned as part of our 2.1B burn plan to strengthen the ecosystem. 2️⃣ FlareDrop.19 is coming in 2H—a 36-month airdrop program for our active community. 3️⃣ New rFLR rewards epoch…","output":"FLR: 66M burned, airdrop & rewards coming! 🔥"},{"text_input":"@Truegems_io Congratulations @Truegems_io @DieCsHamburg. This is a win for the community 👏","output":"Congrats to @Truegems_io & @DieCsHamburg! 🎉"},{"text_input":"Understanding rFLR 1️⃣ Claim ≠ Withdraw: Once claimed, your rFLR begins vesting and accruing Early withdrawal incurs a 50% penalty. 2️⃣ rFLR is allocated monthly to participating dApps, which then distribute it to eligible users. 3️⃣ Any unclaimed, unallocated, or…","output":"rFLR: Claim, vest, or face 50% penalty! 💡"},{"text_input":"@FlareNetworksKR Hope the Korean community enjoyed the fun 👏 Public round is going to be hot.","output":"Public round will be exciting! 🔥"},{"text_input":"We hear your excitement about testing FBTC. While we can't control the testBTC transaction fees, we're committed to making your minting experience easier. We've just sent extra testBTC to yesterday's airdrop recipients to help cover the fees. Stay tuned for our 2nd round of…","output":"Extra testBTC sent to cover fees! 🚀"},{"text_input":"@eadorotarou That sounds eerie. We don't require users to whitelist anything before, during, or after minting and redeeming FTestBTC.","output":"No whitelist needed for FTestBTC minting! 🚀"},{"text_input":"Bridging $XRP to @FlareNetworks is imminent. Try it now on Spend 3 minutes to learn how to: • Become a collateral provider • Add $FLR to the agent pool • Claim your rewards ☀️ Got ideas for our next tutorial?","output":"Bridge $XRP to Flare, earn rewards! ☀️"},{"text_input":"@DOGElonMusk420 @HugoPhilion Truegem's contracts can be verified and publicly accessible on the Flare explorer. We look forward to the minting.","output":"Excited for Truegem's minting on Flare! 🚀"},{"text_input":"We had distributed 1 testBTC to 100+ active users fast with minimum promotion. The excitement for is real. Happy testing.","output":"Testing 1 testBTC with 100+ users! 🚀"},{"text_input":"A new epoch of rFLR rewards is here💫 @SparkDexAI, @blazeswapdex, and @Kinetic_Markets have received new rFLR incentives for users. Join their incentivized pools to claim your share. Stay tuned for @enosys_global, @XDFiProtocol, and @RainProtocol to distribute their rFLR…","output":"New rFLR rewards at SparkDexAI, BlazeSwap, Kinetic! 💫"},{"text_input":"We know you’re very excited about FBTC, and waiting for the faucet can be a bit of a drag. To kick things off, we’re running a testBTC giveaway over the next 6 hours. - Like &amp; RT this post - Drop your testBTC address in comments Be among the first 100 to get testBTC to mint☀️","output":"Join the testBTC giveaway! 🌟"},{"text_input":"@JBUKUC @BifrostWallet @Flare_Labs We don't own this faucet so we can't change the values there, however we are preparing something to help our users start minting...","output":"Preparing minting support for users soon! 🚀"},{"text_input":"The Way to FAssets NFT collection is a testament to the creativity and enthusiasm of community. Get your free NFT and unlock new opportunities in your FAssets journey ⤵️","output":"Claim your free NFT and explore FAssets! 🚀"},{"text_input":"Bitcoin is now supported on FAssets Open Beta 🟠 Users can now bridge TestBTC at using @BifrostWallet. Developed by @Flare_Labs, FAssets offers a trust-minimized bridge, providing a decentralized bridging solution for $BTC $XRP.","output":"Bitcoin now on FAssets Open Beta! 🟠 #CryptoBridge"},{"text_input":"Oracles are the weakest link for many protocols. Are we doing enough to bring secure, trustless, and decentralized data on-chain? If we can, what new possibilities will it unlock? Join us at @kbwofficial for @HugoPhilion's keynote today, September 4, at 1:20 PM 🇰🇷.","output":"Join @kbwofficial for Hugo Philion's keynote! 📅"},{"text_input":"@HypernativeLabs @bloccelerate @Boldstartvc @borderless_cap @CMT_Digital @Quantstamp @Re7Capital Congratulations, @HypernativeLabs! Here’s to proactive security in crypto👏","output":"Congrats @HypernativeLabs on crypto security! 🎉"},{"text_input":"Join us in celebrating the launch of the Way to FAssets NFT collection ☀️ This initiative showcases the power of community collaboration and innovation within the ecosystem. Thank you, @Truegems_io and @DieCsHamburg Looking forward to more minting details 👀","output":"Way to FAssets NFT launch! 🚀"},{"text_input":"@keepgoingthat @contentosio @Community_Sui @TeamLiquid @TeamLiquidLoL @MantaNetwork @MantaNetwork_KR @MantaNetwork_LA @akashnet_ @NearKoreaDAO @Polkadot 🫡 See you tomorrow","output":"Excited for tomorrow's event! 🚀"},{"text_input":"$2.8M in stables ( $USDC.e and $USDT) have been bridged to since @StargateFinance integrated Flare on July 18. IYKYK:","output":"$2.8M bridged via Stargate to Flare since July 18 🚀"},{"text_input":"If you’re heading to • Meet the Flare team at Booth 34: Sep 3-4, 9AM-6PM KST • @HugoPhilion's keynote: Sep 4, 1:20 PM KST at Sui Stage • Side event: Sep 5 w\/ @tokenpost. Sign up: Got build ideas with the Blockchain for data? Message us ☀️","output":"Meet Flare at Booth 34, Sep 3-4, 9AM-6PM KST ☀️"},{"text_input":"ICYMI, you can test again: Which features would you like us to create videos about? 🕳 🐇","output":"Suggest video topics! 📹"},{"text_input":"@Web3Arthur @OrderlyNetwork @HoldstationW @Calderaxyz @myshell_ai @BitgetAcademy 👋 See you there.","output":"Excited for the event! 🚀"},{"text_input":"Yesterday, we reached an ATH in TVL. Flare DeFi Emissions Program has kickstarted some real actions. ☀️ Shall we continue?","output":"ATH in TVL! Flare DeFi is booming! 🚀"},{"text_input":"Flare’s co-founder @HugoPhilion is going to be a speaker at a panel during the @BlLife_Forum this autumn. Find out more about the event ➡️","output":"Flare's Hugo Philion to speak at BlLife Forum! 🎤"},{"text_input":"@Ebubechi_GMI ➤ If you have successfully participated in any of the incentivized pools of these dApps, you are qualified to claim rFLR. See the full list on @flaremetrics ☀️","output":"Claim rFLR if you joined incentivized pools! ☀️"},{"text_input":"WATCH the full video ▶️ Like this episode of Let us know in replies what video we should do next.","output":"What video should we do next? 🤔"},{"text_input":"New Flare Explainer series on YouTube is here ☀️ See why Flare is the blockchain for data and how our enshrined oracles inherit the network security.","output":"Flare's new series: Blockchain & data insights! ☀️"},{"text_input":"@ADAonSOL @elonmusk @AllDogsMatter @aeyakovenko @rajgokal @solana @HalieyWelchX 👀 Flare would love to learn more about this. Look at this Golden Retriever...","output":"Golden Retriever interest from Flare! 🐶"},{"text_input":"Flare is coming to @kbwofficial on Sept 1-7 🇰🇷 📍Visit us at booth 34 from 9AM-6PM KST for a chance to win Flare merch, NFT and 10 prizes of KRW 700,000 in FLR. 🎙️Don’t miss @HugoPhilion's keynote on Sept 4 at 1:20PM on the Sui Stage. 🪩 We’re teaming up with @tokenpost to…","output":"Flare at KBW: Booth 34, Sept 1-7! 🎉"},{"text_input":"@FlothOnFlare Nice work. Would love to learn more about it. Sent you a message @FlothOnFlare 🫡","output":"\"Thanks! Check your messages. 📩\""},{"text_input":"30 minutes left until the AMA with @SparkDexAI Make sure to join the conversation and set your reminders👇","output":"Join the AMA with @SparkDexAI in 30 mins! 🔔"},{"text_input":"We can’t stress enough the importance of redeeming your FTestXRP❗️ By doing so, you free up collateral, enabling others to mint FAssets. P.S. Don't hold more than 1,000 FTestXRP to qualify for the airdrop. It’s a win-win💡","output":"Redeem FTestXRP to free collateral! 🚀"},{"text_input":"Join us tomorrow for an AMA with @SparkDexAI. Our DeFi analyst @0xthanos will also be there to take some questions. Ask your questions below and join us live. @spintax2 will bring you on stage ☀️ Set your reminder:","output":"AMA with @SparkDexAI & @0xthanos tomorrow! 🌟"},{"text_input":"$FLR staking rewards for Epochs 214-217 are ready to be claimed ✅ Did you know you can stake and claim rewards directly with your @Ledger in the Flare app? Step-by-step guide:","output":"Claim $FLR rewards with Ledger in Flare app! 💰"},{"text_input":"Flare will soon be integrated with @PolyhedraZK’s zkBridge 🌉 @zkBridge_eco integration boosts Flare’s cross-chain security using zero-knowledge proofs, ensuring strong safety and liveness guarantees. As a @LayerZero_Labs V2 Decentralized Verifier Network (DVN), Polyhedra…","output":"Flare integrates zkBridge for secure cross-chain! 🌉"},{"text_input":"@SparkDexAI @AlexiAtlas @0xMetavault We will be there with questions 🫡 Our DeFi analyst @0xthanos will be there to take some questions too. Ask your questions below and join us live. @spintax2 will bring you on the stage ☀️","output":"Join us live for DeFi Q&A! ☀️"},{"text_input":"Agree with Vitalik that finance alone isn't enough for blockchain's potential. But have we done enough to actually decentralize finance? If your DeFi relies on a centralized oracle, is it really DeFi? To your question @llamaonthebrink in the thread: We believe that the current…","output":"Decentralize oracles for true DeFi! 🔗"},{"text_input":"Supercharge your Flare DeFi strategy with Thank you @flaremetrics 🫡","output":"Boost your Flare DeFi with @flaremetrics! 🚀"},{"text_input":"Impressive metrics from the Open Beta reset of FAssets, which is live for just 6 hours. ⬆️ $1.37M traded ⬆️ $930K TVL ⬆️ 7K TX This is going to be wild 🚅","output":"FAssets Open Beta: $1.37M traded in 6 hours! 🚀"},{"text_input":"Next: FTestBTC support🌈 We’ve expanded wallet support for FBTC and are testing Agent’s vault with TestBTC. Minting and redeeming of FTestBTC will be available very soon. We’re excited to see how you engage with FAssets Open Beta and explore all the features it offers. Stay…","output":"FTestBTC support expanded! Minting soon! 🌈"},{"text_input":"5️⃣ Engage with FAssets Open Beta Get involved in testing and stay tuned for news about retroactive airdrops. Just like before, don’t forget to redeem your assets, and remember not to hold more than 1,000 FTestXRP to qualify for the airdrop. For our advanced users, follow the…","output":"Test FAssets Beta & qualify for airdrops! 🚀"},{"text_input":"4️⃣ Public Dashboard Track the Open Beta performance: - Value traded - Number of transactions - Accumulated pool rewards - FAssets system health: Total available supply of FTestXRP) and Total Value Locked (TVL): sum of all collateral pools Note: The metrics currently displayed…","output":"Track Open Beta: Value, Transactions, Rewards 📊"},{"text_input":"3️⃣ Wallet Support New wallet support for @MetaMask and @Coinbase Wallet for liquidity provision on the Pool page. The support for full operation is in progress. Currently, only @BifrostWallet fully supports all operations (Mint, redeem, collateral provision). Let us know what…","output":"New wallet support for MetaMask & Coinbase Wallet! 🚀"},{"text_input":"2️⃣ Minting and Redeeming FAssets The minting and redeeming process remains similar to the previous version, with the added ability to choose agents: When minting, you'll see a list of available agents along with their names and vault addresses. 🆕 Pay attention to: ▸Mint…","output":"Mint & redeem FAssets: choose agents! 🆕"},{"text_input":"1️⃣ Become a Liquidity Provider Provide liquidity by adding CFLR to agents' collateral pools and earn rewards*: 1. Choose a pool and click 'Deposit'. 2. You can withdraw anytime. 3. View your updated position &amp; claim your rewards at the top of the pool page. CFLR faucet:…","output":"Earn rewards by adding CFLR to collateral pools! 💰"},{"text_input":"FAssets Open Beta reset completed ✅ Welcome to the official dashboard: This guide highlights the key features of the FAssets Open Beta🔓","output":"FAssets Beta is live! Check the dashboard! 🚀"},{"text_input":"@4AhomeLOAN Appreciate all efforts you put into educating people about Flare, Steve 🎩","output":"Thanks for the support! 🙌"},{"text_input":"@TheFlareablePir Practicing our gratitude skills. Thank you @theflareablepir 🫂","output":"Grateful for @theflareablepir's support! 🙏"},{"text_input":"We may not have emphasized this enough: You are the key to our success. As core supporters, you contribute to the growth of the chain in every way—holding and using the base assets, testing dapps early on, helping each other, and spreading the word about Flare both online and…","output":"You are the key to Flare's success! 🔑"},{"text_input":"@LydonJC Overcollateralised, non-custodial, trustless, decentralized bridges, secured by native oracles for price and state.","output":"Decentralized bridges secured by native oracles. 🔗"},{"text_input":"BTC cannot be moved across chains, as the BTC are confined to the Bitcoin network without native bridging solutions to other composable chains. Through FAssets, Bitcoin can connect with other chains, unlocking its full potential to decentralize finance.","output":"BTC bridges to DeFi with FAssets! 🚀"},{"text_input":"Savior @Warlock__NKey ☀️Thank you for hosting us and being our guest at the same time:","output":"Thanks for hosting and joining us! 😊"},{"text_input":"Friday AMA 😌 A nice catch-up with @Kinetic_Markets on what to look forward to. We hope you can make it; we will be inviting speakers from the community.","output":"Join our Friday AMA with @Kinetic_Markets! 🎤"},{"text_input":"Do you know which dapps are already participating in the 510 million FLR DeFi emissions program? a. SparkDEX b. BlazeSwap c. Kinetic d. All of them. And it is just the beginning ☀️","output":"All are in the 510M FLR DeFi program! ☀️"},{"text_input":"@_WaterAmi Enshrined oracles also mean a stronger, more robust network. That's also us.","output":"Stronger network with enshrined oracles! 🔗"},{"text_input":"@CryptoRResearch @MapProtocol @BSquaredNetwork @Coredao_Org @VenomFoundation @HyperliquidX ☀️","output":"Crypto partnerships and collaborations! 🚀"},{"text_input":"We're hosting an AMA series featuring Flare DeFi ecosystem projects on @X. Our guest this week is @Kinetic_Markets, an algorithmic non-custodial lending platform. Join us: Bring your burning questions as we'll open up the floor to community speakers🍿","output":"Join our AMA with @Kinetic_Markets! 🔥"},{"text_input":"The winners of the @kbwofficial tickets giveaway are here🎟️ Congratulations to @cem2ran @calminspace @GrapeRipple @YasukazuBike @KisungKim17. We’ll be reaching out via DM, so stay tuned. While you’re at KBW, drop by our booth for some pink merch that’ll make you stand out☀️","output":"Congrats to the KBW ticket winners! 🎟️"},{"text_input":"FAssets Open Beta Update 🆕 As previously announced, the Ripple XRP Testnet was reset on Monday, necessitating a pause in the FAssets Open Beta. All testXRP tokens, including those within the FAssets Open Beta, are now invalid. To enable Open Beta participant to start…","output":"Ripple XRP Testnet reset; FAssets Beta paused. 🛑"},{"text_input":"We are on our first University Tour in Korea ☀️ At Flare, we’re passionate about investing in the future and advancing blockchain education. It was a pleasure sharing insights with students at @inhauniv. See you soon at @kbwofficial 🫡","output":"Flare's 1st Korea Uni Tour: Blockchain insights! 🌟"},{"text_input":"@CommunityFlare @StargateFinance Always there for the Flare community 🫡","output":"Supporting Flare community! 🚀"},{"text_input":"You still have a chance to win a ticket to @KBWOfficial. The steps are simple, tell your friends &amp; join now 👇","output":"Win a ticket to @KBWOfficial! Join now! 🎟️"},{"text_input":"Flare DeFi Emissions, which went live 2 weeks ago, is already showing positive signs: ▸ $1.2M USDC, $1.2M USDT &amp; 42 WETH bridged to @FlareNetworks via @StargateFinance. ▸Flare's TVL up 53% (+$4.64M). ▸13.74M Tx in 14 days. It's just the beginning. Learn more in our pinned…","output":"Flare DeFi: $4.64M TVL boost, 13.74M Tx in 14 days 🚀"},{"text_input":"@BifrostWallet @WalletConnect @Bitcoin @dogecoin @litecoin @THORChain Great progress 🤝","output":"Crypto collaboration success! 🚀"},{"text_input":"FAssets milestones achieved since the demo app went live 76 days ago 👇 Let's aim even higher after the XRP testnet reset tomorrow.","output":"FAssets progress! 🚀 XRP testnet reset tomorrow."},{"text_input":"ICYMI, Flare has a $250K bounty on @immunefi, with $100K for critical finds. We're continuously shipping and auditing to maintain top-tier security. We invite whitehat heroes to help make @FlareNetworks the most secure blockchain for data.","output":"Flare offers $250K bounty for security finds! 🔍"},{"text_input":"Heading to @KBWOfficial with Hugo as a speaker at the event 🇰🇷 We want to meet you there. 5 tickets to &gt; Follow @FlareNetworks &amp; @HugoPhilion. &gt; Like &amp; RT this post. &gt; Bonus: Support @FlareNetworksKR. Winners will be announced on Aug 21 ☀️✈️","output":"Win tickets to meet Hugo at KBW! 🎟️"},{"text_input":"FAssets is not a custodial bridging solution. It is a decentralized system, enabling a multi-sided decentralized marketplace that brings BTC, XRP and DOGE utility. Shout out to 32,564 participants - minters, redeemers, agents and liquidators in the open beta. ☀Reset &amp;…","output":"Decentralized BTC, XRP, DOGE utility! 🚀"},{"text_input":"Flare is launching our first University Tour in Korea 🇰🇷 In partnership with @incheon_gov, @kisa118, Blockchain Innovation Technology Center, Incheon Technopark, and Inha University, we will share knowledge in a 2-month program to foster the next generation of crypto leaders 🌿…","output":"Flare's Korea Uni Tour: Crypto Leadership 🌿"},{"text_input":"We're thrilled to announce that the app is now available on @Ledger☀️ Securely manage your $FLR: stake, claim rewards, wrap tokens, vote on proposals, and delegate to the Flare Time Series Oracle, all with a dedicated app on your hardware wallet.","output":"Manage $FLR on Ledger: stake, vote, delegate! 🔒"},{"text_input":"@0x99Gohan This is great 👏 Calling projects participating in @FlareNetworks DeFi emission to take a look and give some love to Gohan. @SparkDexAI @blazeswapdex @Kinetic_Markets @enosys_global @rainprotocol","output":"Support Gohan in @FlareNetworks DeFi! 🚀"},{"text_input":"FAssets is utilizing EIP-2535 Diamond Standard, developed by @mudgen, which enables the modularity and upgradeability within the FAssets System.🫡 More about FAssets' future-proof design:","output":"FAssets uses EIP-2535 for modular upgrades. 💎"},{"text_input":"Staking rewards for epochs 210-213 are here 👨‍🍳 New to $FLR staking? Stake your FLR to support validators and earn more rewards beyond Requirements ⤵️ There are also liquid staking options like @SceptreLS.","output":"Stake $FLR for rewards! 💰"},{"text_input":"Our take on a better Bitcoin DeFi future We're just getting started. It's been 15 years since the launch of Bitcoin. Could the current state of blockchain technology have offered a product that would have avoided today's global issues? Not yet. But if we collectively as an…","output":"Building a better Bitcoin DeFi future! 🚀"},{"text_input":"Risk 3: Deep integration WBTC's extensive integration across 334 pools in various DeFi protocols like MakerDAO, Aave, Compound, and Uniswap makes it a systemic risk. Any issues with WBTC could have far-reaching consequences throughout the DeFi ecosystem.","output":"WBTC issues could shake the entire DeFi space! ⚠️"},{"text_input":"Risk 2: Centralized custodial via BitGo WBTC's reliance on BitGo as the sole custodian creates a single point of failure. The full KYC requirement also goes against the ethos of decentralization that many in the crypto community value.","output":"Centralized risk with BitGo custody! ⚠️"},{"text_input":"Risk 1: New WBTC joint venture The transfer of control to a joint venture involving BitGo, BiT Global, and Justin Sun's Tron ecosystem raises concerns about trust and future management. This change in custody structure has prompted industry concerns regarding whether that trust…","output":"New WBTC venture raises trust concerns. 🤔"},{"text_input":"Quick summary of the current state of WBTC • 154K minted WBTC, representing 0.76% of Bitcoin's market cap • 41% of WBTC used in lending, with MakerDAO as the largest market","output":"154K WBTC minted, 41% in lending. 📈"},{"text_input":"MakerDAO recently proposed halting new borrowing against WBTC to migrate risks. So what are the risks? 🧵 (1\/5)","output":"Risks in WBTC borrowing prompt MakerDAO action. 🛑"},{"text_input":"@CryptoKoryo @SparkDexAI And it's just one of many Flare dapps with an incentivization program. List will be constantly updated:","output":"Flare dapps offer incentives! 🚀"},{"text_input":"@CommunityFlare Great respect for you, John, for always providing insights to our community.","output":"Thanks for the insights, John! 🙌"},{"text_input":"Polyhedra is conducting a vote on integrating Flare into zkBridge. This integration positions @FlareNetworks at the forefront of cross-chain development, leveraging @zkBridge_eco's zk-proof technologies, which work in conjunction with @LayerZero_Labs' Decentralized Verification…","output":"Voting on Flare's zkBridge integration! 🚀"},{"text_input":"Take our quick survey (10 mins) for a chance to win 5,000 $FLR by telling us: • How you use Flare and $FLR • Your favorite DeFi activities • Features you crave Let's build the ultimate DeFi playground 🧩✍️","output":"Win $FLR! Share your DeFi insights in our survey! 🧩"},{"text_input":"We're hitting the road 🚗 Find us at @kbwofficial, @token2049, @summit_defi, @EFDevconnect, and @ETHGlobal. Show some love and let us know if you'll be there for special ☀️ merch.","output":"Join us at top crypto events! 🌟"},{"text_input":"Reminder 🚨 XRP testnet resets on August 19th. The FAssets open beta will also be reset. We will resume the beta with airdropping new TestXRP, an official dashboard, FTestBTC support, and more updates 🪂 Take some time this weekend to redeem FTestXRP 🙏 Learn more:","output":"XRP testnet reset on Aug 19. Redeem FTestXRP! 🚨"},{"text_input":"@dohnjarrow TestXRP will expire and go to 0 when XRP testnet reset happens. Before that, no extra actions are required.","output":"TestXRP will reset to 0 on testnet reset. 🚀"},{"text_input":"Check out a great tool for evaluating FTSO data providers 🔍 Analyze their performance &amp; make informed decisions about delegating your vote power. Don’t just chase high rewards; support those who engage with their delegators and strengthen the network💡","output":"Evaluate FTSO providers for informed voting! 🔍"},{"text_input":"1M wallets milestone unlocked 🔓 94,582,365 transactions without a single moment of downtime since @FlareNetworks mainnet launch on July 13, 2022. Day by day we grow. Thank you to all $FLR community.","output":"1M wallets & 94M+ transactions! 🚀 #FlareNetwork"},{"text_input":"Team will be at Appchain Day during @token2049, with @j00sko delivering a keynote alongside top builders ☀ Any must-meet crypto communities we should know about?","output":"Excited for Appchain Day! Any community tips? 🌟"},{"text_input":"Thanks for joining us. We've discussed the FAQs and heard feedback from you. Missed it? You can always check the history in the channel. @alexersceptreLS will also be around in their Telegram to help you navigate Sceptre. Let us know if you enjoyed the AMA, and suggest…","output":"Check channel history for AMA recap! 📜"},{"text_input":"@Nebuchadnzzr @Danrocky @SceptreLS We hear you. Just the start, let's explore the best format for our community.","output":"Exploring new formats for our community! 🚀"},{"text_input":"We're kicking off AMAs with Flare DeFi ecosystem projects. First up: @SceptreLS - a liquid staking protocol designed to maximize FLR yield. Join us today at 1 PM UTC in the sceptre-ama channel on our Discord. Tune in and fire questions 🔥","output":"Join Sceptre AMA today at 1 PM UTC! 🔥"},{"text_input":"@Kinetic_Markets Thanks for sharing how you will incentivize users with the FLR DeFi emissions. For those who wonder what rFLR is, take a look:","output":"rFLR is a reward token in the FLR DeFi ecosystem. 💡"},{"text_input":"Claim FlareDrop.18 now 💧 &gt; Rewards rate: 3 FLR\/100 WFLR. &gt; Block snapshots used: 27,175,147 \/\/ 27,559,525 \/\/ 27,935,733 New to Hold $WFLR or stake $FLR for 3 random snapshots in the past 23 days.","output":"Claim FlareDrop.18 now! 💧 3 FLR\/100 WFLR rate."},{"text_input":"@saadakb27044496 The reason we encourage users to redeem their FTestXRP is because that will free up the agents' collateral so the FAssets system reset will be smoother.","output":"Redeem FTestXRP for a smoother system reset! 🔄"},{"text_input":"@JBUKUC All historical participation on the testnet has been recorded (we have the addresses) and will be included in the retroactive airdrop calculation if you follow the rest of the requirement (see paragraph \"Extra info on retroactive airdrop\").","output":"Check airdrop eligibility! 🚀"},{"text_input":"Important Update: XRP Testnet Reset, FAssets Beta Reset XRP testnet will be reset on August 19th, invalidating all FTestXRP. FAssets open beta on Coston will be paused and reset until the XRP testnet stabilizes. Action required: • Redeem FTestXRP by August 18th, 11:59 PM EST.…","output":"Redeem FTestXRP by Aug 18, 11:59 PM EST! ⏰"},{"text_input":"66,293,390 $FLR burnt. This directly benefits you: \"Without this burn, the investors would be able to claim approximately 3x their original allocation through the unfairly diluting community holdings.\" More about the 2.1 billion $FLR burn:","output":"$FLR burn benefits holders! 🔥 #CryptoNews"},{"text_input":"@Kinetic_Markets @GenfinityIO @IOV_OWL @Danrocky @CommunityFlare @HugoPhilion @RuleXRP A huge congradulations, Kinetic ☀. We encourage everyone to explore their lending &amp; borrowing platform and share feedback. Looking forward to our upcoming AMA.","output":"Congrats Kinetic! Explore their platform! 🚀"},{"text_input":"Doubling down on transparency and communication ☀️ The Flare DeFi ecosystem is growing rapidly, marking a new chapter with increased liquidity, users, and project teams. To effectively navigate this exciting phase, we are taking proactive steps to strengthen visibility and…","output":"Flare DeFi grows with more liquidity and users! 🚀"},{"text_input":"@Mister_B90 @SparkDexAI @0xAnna0 Good idea, we will invite @SparkDexAI for an AMA.","output":"Inviting @SparkDexAI for an AMA! 🎉"},{"text_input":"@enosys_global Thanks for the writeup, @enosys_global 👍 A few things: The pools are not defined by Flare but by the emissions commiteee. Also, they are suggested by the emissions committee but are not dictated. So the decision is with the dapps on how they incentivize to achieve liquidity…","output":"Dapps decide incentives, not Flare. 💡"},{"text_input":"Live 🚨 Rewards for the first epoch are now available to claim. @blazeswapdex and @SparkDexAI are distributing allocations for users to claim at Flare Portal. Remember: Once claimed, your rFLR will be wrapped and become eligible for FlareDrops. ☀️","output":"Claim your rewards at Flare Portal now! 🌟"},{"text_input":"Tips 💡 To maximize rewards, users can hold any monthly rFLR token distribution to fully vest over 12 months before withdrawing. Users may also withdraw immediately with a 50% penalty.","output":"Hold rFLR for 12 months to maximize rewards! 💡"},{"text_input":"How to claim? Users can claim their rewards via the Flare Portal at which point they will start vesting and accruing monthly rFLR will vest over 12 months. Each month, users can withdraw 1\/12 of their vested rewards as WFLR.","output":"Claim rewards monthly via Flare Portal! 💰"},{"text_input":"rFLR are rewards given to users who add liquidity to incentivized pools in select dapps within within the @FlareNetworks ecosystem. At the end of each reward period, dapps will allocate rFLR rewards to qualifying users participating in rFLR-incentivized pools. 🌾","output":"Earn rFLR by adding liquidity in Flare dapps! 🌾"},{"text_input":"What is rFLR? rFLR (Reward Flare) is a token introduced as part of Flare's new DeFi emissions program. A quick 🧵","output":"rFLR is a token in Flare's DeFi program. 💡"},{"text_input":"The 510 million FLR DeFi emissions program is now live ☀️ Help us grow @FlareNetworks' DeFi ecosystem and boost the success of the FAssets launch. Rewards will be distributed to protocol participants monthly. Learn how to get involved:","output":"Join Flare's DeFi program for monthly rewards! 💰"},{"text_input":"Flare provides reliable, secure, ultra-low-cost data with ease of use. So now, what can be built? 16 novel use cases highlighted by @HugoPhilion 👇 Start this Sunday and get accelerated with the Flare ecosystem support program:","output":"Build with Flare: secure, low-cost data solutions! 🚀"},{"text_input":"Are you watching the Join the fun with this Olympics Prediction Market Game: Leveraging Flare's Data Connector, it offers a decentralized betting experience. Now supports: ⛹️🏒⚽🤾🤽‍♀️ Note: For educational purposes only.","output":"Olympics Prediction Game: Bet & Learn! 🏅"},{"text_input":"@focus_kermit @Danrocky Huge thanks to you again, Andrzej. Your answer on the advantages of Flare's data is simply spot on.","output":"Flare's data advantages are spot on! 📊"},{"text_input":"“Developers are going to build their applications on the chain that serves their purposes, that provides the protocols that they need. And when you’re talking about mass adoption, the protocols that people need to use will be DATA.” Data was what we started with, and will…","output":"Data protocols drive blockchain adoption! 📊"},{"text_input":"@Danrocky Dan, you brought incredible energy to the call 🔥 Your thoughtful questions and contributions made it truly engaging. A community like ours, with members like you and @focus_kermit, is what makes Flare special. We also look forward to more lively discussions like this.","output":"Great energy, Dan! Looking forward to more! 🔥"},{"text_input":"@_WaterAmi @DefiLlama @Kinetic_Markets @ClearpoolFin @enosys_global @SceptreLS @blazeswapdex @SparkDexAI @steerprotocol 👀","output":"Crypto partnerships and collaborations 👀"},{"text_input":"@marcdotnarc @HugoPhilion @Danrocky @Kinetic_Markets @CommunityFlare Glad that it is helpful @marcdotnarc ☀️","output":"Glad it's helpful, @marcdotnarc! ☀️"},{"text_input":"Welcome Mr. Tipbot to our Discord 🤝 @AstralCredits This friendly bot makes tipping &amp; rewarding community a breeze. ✅ Supports a wide range of Songbird &amp; Flare network tokens. ✅ Easy to use: type \"\/\" for commands &amp; follow the prompts.","output":"Tip with Mr. Tipbot on Discord! 🤝"},{"text_input":"We're now a verified organization on @X 🛡️ We are adding affiliated badges to help you identify @FlareNetworks team members. Your safety is our priority. More security measures coming.","output":"Verified on @X! 🛡️ More security measures soon."},{"text_input":"Staking rewards for epochs 206 - 209 have been distributed🎉 5,334 active delegators are supporting our network security and enjoying: ✨ Compounding staking rewards ✨ FlareDrops ✨ Voting rights ✨ Additional utility in DeFi via @SceptreLS Need more reasons? Come explore ☀️","output":"Staking rewards distributed! Enjoy benefits! 🎉"},{"text_input":"What can decentralized data do for prediction markets? Try Prediction Market⤵️ Leverage the Flare Data Connector for verifiable proofs of final results. Participate in global events trustlessly with @FlareNetworks—the blockchain for data.…","output":"Decentralized data boosts prediction market trust! 📊"},{"text_input":"5\/ 🔮 Looking ahead: • More protocols will be joining soon. • We'll be sharing more detailed information about emissions in the coming weeks. Stay tuned to @FlareNetworks for updates and announcements as we continue to grow the Flare ecosystem. 🌱","output":"More protocols & emissions info coming soon! 🌟"},{"text_input":"4\/ ✨Participating protocols: The first participating protocols are @SparkDexAI and @blazeswapdex. DeFi protocols interested in joining reach out to us 🤝","output":"Join @SparkDexAI & @blazeswapdex in DeFi! 🚀"},{"text_input":"3\/ 🎁 Claiming: • Users can claim rewards from • Once claimed, rewards will start accruing • Redeeming options: a) Follow a 12-month vesting schedule for each monthly emission. b) Redeem unvested rewards early at 50% of their value.","output":"Claim rewards: vest or redeem early at 50%! 🎁"},{"text_input":"2\/ 📊 How it works: The Emissions Committee allocates incentives to dapps for their pools\/vaults, aiming to boost liquidity on Flare. Users earn rewards by participating in dapps with incentivized pools\/vaults.","output":"Boost liquidity on Flare with dapp rewards! 🚀"},{"text_input":"1\/ 🗳️ Community approval: FIP.09 On June 28, 2024, Flare initiated voting for FIP.09, introducing the FLR Protocol Emissions program with a total budget of 510 million FLR tokens. FIP.09 has been approved with overwhelming support. (1,176,092,379 votes for).","output":"FIP.09 approved! 510M FLR tokens for emissions. 🚀"},{"text_input":"We’re thrilled to announce the launch of the FLR Protocol Emissions program. It officially kicks off ☀️ Here’s everything you need to know 🧵","output":"FLR Protocol Emissions program launched! 🚀"},{"text_input":"With the $FLR emission plan nearing, keep an eye on these projects mentioned by @HugoPhilion in his @Cointelegraph interview that recently launched on Flare☀️ @RainProtocol @SparkdexAI @StargateFinance @XDfiProtocol @Kinetic_Markets @SceptreLS Which ones are you using? 👀","output":"Excited for $FLR projects! 🚀 Which are you using?"},{"text_input":"Grants from the Flare Foundation are designed to support innovative and impactful projects in order to accelerate the growth of the Flare ecosystem. Visit:","output":"Get a Flare Foundation grant! 🚀"},{"text_input":"On-chain sports prediction applications can be leveled up by verifiable data proofs secured at network level from Flare Data Connector. Who is building it? 👀","output":"Flare is building on-chain sports predictions! 🏈"},{"text_input":"The first batch of dapps is about to get $FLR emissions to share incentives. The Flare ecosystem is maturing rapidly, and we're excited to reward early adopters and liquidity providers. Learn how this will fuel growth and benefit the entire community:","output":"$FLR rewards for early adopters! 🚀"},{"text_input":"Never too late to start your rewarding Flare journey. ☀️ Get all the how-to guides on","output":"Start your Flare journey today! ☀️"},{"text_input":"What happened yesterday in the call? @FlareNetworks ecosystem calls are always recorded so you can play back anytime. But if you want a concise summary, here you go: Thanks for joining us @LayerZero_Labs @StargateFinance @SparkDexAI 🤝","output":"Flare call recap: LayerZero, Stargate, SparkDex 🤝"},{"text_input":"Space in 1 hour 🧑‍🚀 Meet the teams behind @LayerZero_Labs, @StargateFinance &amp; @SparkDexAI. Learn about their vision and how they're bringing value to @FlareNetworks. Wrap up with insights from @HugoPhilion on what's next for Flare ☀️ Hosted by…","output":"Join us for insights on Flare's future! 🚀"},{"text_input":"Summer slows online chatter, but building never stops. Focus on coding &amp; check out these tools to create useful dapps: • Flare Time Series Oracle→ Free, near-real-time price feeds • Data Connector→ Easily access data proofs from other chains Questions? Ask away👋","output":"Build dapps with Flare & Data Connector! 🚀"},{"text_input":"If you're in Nashville for @TheBitcoinConf, let's meet. We'd love to discuss the trillions in idle assets and the centralized bridge challenges for your $BTC. We're working on a permissionless &amp; trustless bridge secured by 2x collateral. Curious to hear your thoughts over ☕🥃","output":"Discuss BTC bridge solutions over coffee? ☕"},{"text_input":"Bookmark the blog &amp; thread to read later. 👉 Come to our discord # BUILDers-only 💪 to find out what you need to start building.","output":"Join our Discord to start building! 💪"},{"text_input":"6️⃣ Lastly, and what's already live: Transfer assets directly between blockchains without wrapping or creating new versions. You can now already send USDT, USDC and ETH from any supported chains to Flare via @StargateFinance:","output":"Cross-chain transfers now live with Stargate! 🚀"},{"text_input":"LayerZero V2 also empowers your DAO and gaming projects ✨ 4️⃣ Manage assets and permissions across multiple blockchains from a single contract for simpler dapp governance. 5️⃣ Move in-game assets freely between blockchains for a wider and more collaborative gaming experience.","output":"LayerZero V2: Simplify dapp governance & gaming! 🎮"},{"text_input":"3️⃣ Manage your digital identities with ease. Imagine a world where your users don't need to juggle multiple wallet addresses &amp; usernames for different chains to interact with your Flare dapps. That's the power of LayerZero V2 &amp; universal nameservices for Flare developers.","output":"Simplify digital IDs with LayerZero V2! 🌐"},{"text_input":"@LayerZero_Labs 2️⃣ Borrow and lend across chains with cross-chain money markets. This creates a more interconnected financial landscape on Flare, opening doors for yield farming and more. In the recent hackathon, lzLend() gave it a shot and won our $7K track 🥇","output":"Cross-chain lending wins $7K at hackathon! 🏆"},{"text_input":"Now, let's talk about the use cases. 1️⃣ Seamless token usage Imagine users seamlessly using tokens across different blockchains. LayerZero's OFT standard makes this a reality, paving the way for a thriving DeFi ecosystem on Flare.","output":"Tokens across blockchains with LayerZero! 🚀"},{"text_input":"Recap: Flare is now connected to 75+ blockchains &amp; 50,000+ dapps enabled by the LayerZero V2 integration. This opens up a world of possibilities for developers to build powerful cross-chain tools and services.","output":"Flare links 75+ blockchains & 50k+ dapps! 🚀"},{"text_input":"Learning &amp; starting something new this summer? Try building with @FlareNetworks x @LayerZero_Labs V2 ☀️ Here are 6 use cases to get you inspired 🧵","output":"Build with Flare & LayerZero V2 this summer! ☀️"},{"text_input":"@Danrocky @SparkDexAI Swap listing on @SparkDexAI is permissionless.","output":"Swap on @SparkDexAI is permissionless! 🚀"},{"text_input":"Flare Discord has a new look ☀️ We've streamlined channels, simplified onboarding, and packed it with more community events. Come hang out, explore, and let us know your thoughts:","output":"Flare Discord revamped! Join us! ☀️"},{"text_input":"Flare is the blockchain for data. We offer a vast array of data feeds &amp; proofs, secured at the network layer by our built-in oracles. This goes beyond accessibility - it's data certainty. Build with confidence - check out recent hackers winning with @FlareNetworks:","output":"Flare: Secure data feeds & proofs on blockchain! 🔗"},{"text_input":"DeFi on @FlareNetworks accelerated ☀️ Latest news: • LayerZero V2 integration • Flare live on Stargate bridge • SparkDEX launch Meet the team &amp; learn what's next: @crosschaingah (@LayerZero_Labs) @0xLamps (@StargateFinance) @anitang195 (@SparkDexAI)","output":"DeFi growth on Flare: LayerZero, Stargate, SparkDEX 🚀"},{"text_input":"@xrpjesus2 @HugoPhilion @FutureISBrightG @sentosumosaba @jungleincxrp 🕶️","output":"Cool shades! 😎"},{"text_input":"@jerri_nft @Cointelegraph @HugoPhilion Starting at 2PM UTC on @Cointelegraph.","output":"NFT event at 2PM UTC on @Cointelegraph! 🚀"},{"text_input":"Building with the Flare money legos is going to be fun. Fun fact: Both this phrase and the hashtag were coined by our community. We should be proud.","output":"Flare money legos: community pride! 🏗️"},{"text_input":"@AABest @Cointelegraph @HugoPhilion @X Will happen on @Cointelegraph X (Live stream).","output":"Live stream on @Cointelegraph X! 📺"},{"text_input":"🔖 @Cointelegraph x @HugoPhilion: Don't miss it this Monday. Live on @X at 2pm UTC. Covering everything from the latest technology &amp; ecosystem updates to insights into future plans of @FlareNetworks ☀️","output":"Flare Networks update live on Monday at 2pm UTC! ☀️"},{"text_input":"To the 1,500 hackers at @ETHGlobal, you impressed. Did you build with @FlareNetworks? You're a true believer in decentralization and security. Can't wait to see what you build next ☀️","output":"Great work at @ETHGlobal! 🌟"},{"text_input":"Happy Friday. No algo play, no social farming. But a kind reminder: recharge for the action-packed week ahead. ☀️","output":"Recharge for next week's action! ☀️"},{"text_input":"The gates are open 👐 USDC, USDT, and ETH can now move seamlessly from Ethereum, Arbitrum, Polygon, Base, BNB Chain, and more leading chains to @FlareNetworks on Stargate. See you on the other side ✨","output":"Cross-chain transfers to Flare now live! 🚀"},{"text_input":"@SamuelXeus @StargateFinance Fees = source chain gas fees (no fee on Flare nor charged by Stargate). E.g. $0.02 gas fee if bridging USDT from Arbitrum to Flare.","output":"Bridging USDT: $0.02 gas fee. 🚀"},{"text_input":"@Danrocky Dan gets it. We'll explain this further in our upcoming ecosystem call 🫡","output":"Join our ecosystem call for more insights! 📞"},{"text_input":"FTSOv2 rewards are now live on 🟢 Plus, we're excited to introduce 19 new feeds on Songbird, with updates every 90 seconds. Stay tuned for these to be added as block-latency feeds, with updates every 1-2s ⚡ Learn more:","output":"FTSOv2 rewards live! 19 new feeds on Songbird ⚡"},{"text_input":"⛓️ @StargateFinance now integrates @FlareNetworks. Enjoy unified liquidity between Flare and 25+ top chains, including Ethereum, Arbitrum, Optimism, and Base. $USDC, $USDT &amp; $ETH are coming to the Flare ecosystem. Deep liquidity powers ☀️","output":"Stargate integrates Flare for unified liquidity! 🌐"},{"text_input":"Every data feed on Flare is protected by network-level security, where 100 validators ensure network consensus &amp; deliver data☀️ Delegate your $FLR to validators to support them &amp; earn rewards every 2 weeks on top of Claim epochs 202-205 rewards now. Stake today👇","output":"Stake $FLR for rewards & support validators! 🔒"},{"text_input":"Excited to hear builders are buzzing about the Flare x LayerZero track at @ETHGlobal Brussels✨ Secure data + cross-chain stack = powerful dapps solving real problems. Easy to start building⤵️ Check out the workshop recording &amp; join our Discord for today Q&amp;A with our dev rel.","output":"Flare x LayerZero: Build powerful cross-chain dapps! 🚀"},{"text_input":"Introducing the latest bug bounty program on @FlareNetworks, powered by @Immunefi 🛡️ Security is paramount for Flare. Help us strengthen our ecosystem by finding vulnerabilities and earn up to $250K in $FLR rewards. No KYC required. Join the hunt now:","output":"Earn $250K in $FLR for finding bugs! 🛡️"},{"text_input":"@NicholasLobue Great questions @NicholasLobue. We're working on a comprehensive introduction to the Flare DeFi ecosystem, but in the meantime, a contest to encourage the family to share their strategies could be a fun initiative...?","output":"Flare DeFi strategy contest coming soon! 🚀"},{"text_input":"@absinthe0901 @ETHGlobal @algoroad @SwineCoder @ferrabled @Celo @arbitrum @hyperlane Your team is amazing ☀️ We'd love to hack with you again.","output":"Let's hack together again! 🌟"},{"text_input":"@Rhayuumi @HugoPhilion @kbwofficial We'd love to. What to start with first?","output":"\"Let's kick off with the basics! 🚀\""},{"text_input":"ETHCC is behind us. Next stop: Seoul 🇰🇷 Time to greet our Asian community. @FlareNetworks co-founder @HugoPhilion and team will be in Seoul for @kbwofficial. Let us know if you have a community there and we should talk.","output":"Flare Networks heads to Seoul for KBW! 🇰🇷"},{"text_input":"Voting opens today for SIP.03: Enabling staking on and aligning Songbird's code with Flare's for a stronger canary network 🐦 ▸ Full proposal: ▸ Vote here: (Switch to Songbird network) Deadline: July 22 ⏳","output":"Vote on SIP.03 for Songbird staking! 🐦"},{"text_input":"@AlgoFoundation @SparkDexAI @QuickswapDEX Thank you @AlgoFoundation 🤝","output":"Thanks for the support! 🚀"},{"text_input":"DeFi primitives on @FlareNetworks, such as stablecoins, money markets, staking, liquid staking, and perpetuals, are emerging alongside the $FLR emission program. Exciting times ahead ☀","output":"DeFi grows on Flare with $FLR! 🚀"},{"text_input":"@JackLatrack @SparkDexAI You can reach the SparkDEX team on Telegram and Discord — links can be found on their homepage.","output":"Contact SparkDEX via Telegram or Discord! 🚀"},{"text_input":"☀️ @SparkDexAI is bringing 100x perp DEX &amp; AI-powered AMM to @FlareNetworks. Supported by @QuickswapDEX, it leverages Flare's enshrined oracle for price feeds &amp; LayerZero's integration for seamless trades across 12 chains. Visit","output":"100x DEX & AI AMM on Flare with 12-chain trades! 🚀"},{"text_input":"@sentosumosaba @maxluck95 Max is one of our very well-informed and highly skilled teammate as well. ☀","output":"Max is a top-notch teammate! 🌟"},{"text_input":"Update on STP.07 (approved on May 27) 🆕 Rewards for FTSO Fast Updates on start July 18th. Delegate to data providers supporting the FTSOv2 to maximize the potential delegation rewards. 💡 List: More about STP.07:","output":"FTSO Fast Updates start July 18! Delegate now! 🚀"},{"text_input":"@tina_connects Thank you so much @tina_connects for your truly valuable contributions to Flare 👊","output":"Thanks @tina_connects for your impact on Flare! 👊"},{"text_input":"@bryanfullam Intern messed up the thread, and unfortunately your quote tweet is now unavailable. 🙏 Still, congratulations on your win. It's a pleasure to collaborate with talented people like you. We look forward to seeing you again soon.","output":"Congrats on your win, Bryan! 🎉"},{"text_input":"Deep dives into more projects and interviews with builders are coming next week. Off to the Afterparty and football ⚽","output":"Exciting projects & interviews next week! 🎉"},{"text_input":"lzLend is a peer-to-peer cross-chain lending platform with an aggregated cross-chain oracle. @thisisaaly, @mattiapomelli The FTSO inspired the team to build an oracle aggregator that aggregates price feeds from various chains and relays them to all…","output":"Cross-chain lending with oracle aggregation! 🔗"},{"text_input":"Rain Frame makes Rainlang shine 🌈 @bryanfullam This is the second web3 hackathon Brian attended, focusing on Rainlang, a syntax language that simplifies building trading strategies. Combining Farcaster's framework, Rain Frame allows DeFi strategies to…","output":"Rainlang simplifies DeFi strategies! 🌈"},{"text_input":"X-Data-aggregator @GaetanoMondelli While most oracle solutions only provide price data, DeFi protocols can benefit from more detailed information, such as liquidity, volatility, or owner concentration. X-Data-aggregator aggregates the data from…","output":"Enhanced DeFi insights with X-Data-aggregator 📊"},{"text_input":"Net Zero 🌻 @absinthe0901, @algoroad, @ferrabled, @SwineCoder There are transparency and trust issues in sustainable energy solutions. Web3 offers better solutions to generate carbon footprint data and offset emissions. NetZero is using the Flare Data…","output":"Web3 boosts transparency in carbon tracking 🌍"},{"text_input":"Brussels hackathon came to a close 🔥 An incredible 355 submissions and many used @FlareNetworks to empower their dapps. Meet the winning projects and get inspired 🧵","output":"355 projects at Brussels hackathon! 🚀"},{"text_input":"2 years ago, we started everything from 0. Happy birthday @FlareNetworks 🎂","output":"Flare Networks turns 2! 🎉"},{"text_input":"Principles aligned. Learn more about how and why integrates Flare and what it means for the @FlareNetworks ecosystem:","output":"Flare integration boosts ecosystem growth! 🚀"},{"text_input":"Find us in pink at the @ETHGlobal hackathon. Just say to connect 🫡 Kind reminder: Afterparty powered by @FlareNetworks at the main venue starting at 5PM on Sunday.","output":"Join us at the ETHGlobal hackathon! 🎉"},{"text_input":"SIP.03 notice period is ending soon 🚨 It opens up validation to allow anyone to become a validator and bring the Songbird code up to speed with Wrap your $SGB to vote. Voting period: 16-Jul-2024 to 22-Jul-2024 🔔","output":"Vote on SIP.03: 16-22 Jul 2024! 🗳️"},{"text_input":"@maskmanrealwan @_LanaNT_ @ETHGlobal Flare has been on the mainnet since 14 July 2022.","output":"Flare mainnet live since July 2022! 🚀"},{"text_input":"Unleash the power of Flare's enshrined price oracle for seamless crosschain apps. We'll guide you step-by-step. Join us (Workshop Room 3) at 3:40 PM. And get swag &amp; build tips at our booth ☀ @ETHglobal @EthCC","output":"Join us for Flare's crosschain oracle workshop! ☀"},{"text_input":"The Flare team is aware of questions being raised around some Blockchain website domains. Currently, there's no evidence of any issues affecting Flare network or its official websites. We're actively monitoring the situation and will provide updates if necessary.","output":"Monitoring blockchain domains. No issues found. 🔍"}]